{
    "id": 1009686,
    "name": "Umar",
    "description": "Umar and her sibling Dormammu gathered matter to themselves to increase their power, a practice anathema to their fellow Faltine who consider energy to be superior to matter.",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/40/image_not_available",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1009686",
    "comics": {
        "available": 13,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009686/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/20168",
                "name": "Doctor Strange, Sorcerer Supreme (1988) #1"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/20181",
                "name": "Doctor Strange, Sorcerer Supreme (1988) #21"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/20182",
                "name": "Doctor Strange, Sorcerer Supreme (1988) #22"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/20183",
                "name": "Doctor Strange, Sorcerer Supreme (1988) #23"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/20184",
                "name": "Doctor Strange, Sorcerer Supreme (1988) #24"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/20210",
                "name": "Doctor Strange, Sorcerer Supreme (1988) #48"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/20238",
                "name": "Doctor Strange, Sorcerer Supreme (1988) #73"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/38109",
                "name": "Incredible Hulks (2009) #635"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/2319",
                "name": "Marvel Masterworks: Doctor Strange Vol. (Hardcover)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/2820",
                "name": "Marvel Masterworks: Doctor Strange Vol. (Hardcover)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/11073",
                "name": "Strange Tales (1951) #150"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/11075",
                "name": "Strange Tales (1951) #152"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/11078",
                "name": "Strange Tales (1951) #155"
            }
        ],
        "returned": 13
    },
    "series": {
        "available": 4,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009686/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/3741",
                "name": "Doctor Strange, Sorcerer Supreme (1988 - 1996)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/8842",
                "name": "Incredible Hulks (2009 - 2011)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1468",
                "name": "Marvel Masterworks: Doctor Strange Vol. (2005)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2076",
                "name": "Strange Tales (1951 - 1968)"
            }
        ],
        "returned": 4
    },
    "stories": {
        "available": 15,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009686/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/10271",
                "name": "Cover #10271",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/10278",
                "name": "Cover #10278",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/10280",
                "name": "Into the Dimension of Death!",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/10289",
                "name": "The Fearful Finish--!",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/43199",
                "name": "Love is the Spell.  The Spell is Death!",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/43234",
                "name": "TBOTV: Legends and Lore of the Dark Dimension, Part 1",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/43236",
                "name": "Dormammu Ascendant [The Dark Wars, Part 2 of 4]",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/43237",
                "name": "TBOTV:Legends and Lore of the Dark Dimension, Part 2",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/43238",
                "name": "The Dark Wars Part 3 of Four",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/43239",
                "name": "Mondo Mordo [The Dark Wars, Part 3 of 4]",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/43240",
                "name": "TBOTV:Legends and Lore of the Dark Dimension, Part 3",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/43242",
                "name": "Do Not Go Gently Into That Dark Night...[The Dark Wars, Part 4 of 4]",
                "type": ""
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/43299",
                "name": "To Serve in Heaven",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/43361",
                "name": "Threshold of Ashes [Last Rites, Second Verse]",
                "type": ""
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/93007",
                "name": "Interior #93007",
                "type": "interiorStory"
            }
        ],
        "returned": 15
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009686/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1009686/umar?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Umar?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "blurb": "",
        "real_name": "Umar",
        "aliases": "Umar the Unrelenting",
        "identity": "No dual identity",
        "occupation": "Despot, Conqueror",
        "citizenship": "Faltine Dimension, Dark Dimension",
        "place_of_birth": "Faltine Dimension",
        "relatives": "[[Sinifer]] (parent/genitor), [[Dormammu]] (brother), [[Clea]] (daughter), [[Doctor Strange (Stephen Strange)|Stephen Strange]] (son-in-law)",
        "groups": "None",
        "education": "Inapplicable",
        "height": "5'11",
        "weight": "200 lbs.",
        "eyes": "Green",
        "hair": "Black",
        "powers": "Possesses extensive mystic knowledge; able to cast powerful spells for many purposes. Her powers are augmented while she is wearing the \"flames of regency\" around her head; with the flames of regency, her power waxes and wanes based on the devotion of the Dark Dimension's citizens have for her. Whenever Dormammu has been deposed as ruler of the Dark Dimension, the flames have appeared around Umar's head. Clea is the only other entity enown to have the power to wield the flames.",
        "abilities": "Umar can also tap into the energies of her brother Dormammu, and has temporarily increased her powers through the entities Gaea and Eternity. Umar is able to manipulate ambient magical energy of the universe, as well as the energy within her own body. Her many magical powers include projecting mystical energy bolts, the ability of [[Glossary:T#teleportation|teleportation]] through other dimensions, Umar has master the casting of illusions, changing size, time travel, transmutation of matter, controlling weather, animating normally inanimate matter, generating force fields, and controlling the minds of others. As a member of the Faltine race, her humanoid body is physically superior to that of a human, and she is apparently immune to the process of aging.",
        "weapons": "None",
        "paraphernalia": "None",
        "debut": "Strange Tales #150 (Nov. 1966)",
        "origin": "Doctor Strange #71 (1985); Doctor Strange: Sorcerer Supreme #22 (1990)",
        "significant_issues": "[[OHOTMU:Bibliography-AZ12#Umar|Official Handbook Bibliography]]",
        "main_image": "Umar_Head.jpg",
        "bio_text": "Umar was born anywhere from thousands to millions of years ago in the [[Glossary:D#dimension|dimension]] of the [[Faltine]], a species of energy-based entities. Umar and her sibling [[Dormammu]] gathered matter to themselves to increase there power, a practice anathema to their fellow Faltine who consider energy to be superior to matter. Ultimately slaying their parent [[Sinifer]] by transforming it into dead matter, they were driven from their home and assumed humanoid form to explore dimensions. Their search for conquest brought them to the [[Glossary:D#Dark Dimension|Dark Dimension]], a mystic realm riddled with natural wraps into pocket universes within the universe itself. At the time of their arrival, the Dark dimension's multi-species society had been at peace for almost 28,000 years and was in the third millennium of the rule of [[King Olnar]].",
        "bio": "Umar was born anywhere from thousands to millions of years ago in the [[Glossary:D#dimension|dimension]] of the [[Faltine]], a species of energy-based entities. Umar and her sibling [[Dormammu]] gathered matter to themselves to increase there power, a practice anathema to their fellow Faltine who consider energy to be superior to matter. Ultimately slaying their parent [[Sinifer]] by transforming it into dead matter, they were driven from their home and assumed humanoid form to explore dimensions. Their search for conquest brought them to the [[Glossary:D#Dark Dimension|Dark Dimension]], a mystic realm riddled with natural wraps into pocket universes within the universe itself. At the time of their arrival, the Dark dimension's multi-species society had been at peace for almost 28,000 years and was in the third millennium of the rule of [[King Olnar]].\n\nDespite the warnings of his sorcerer advisers the [[Glossary:M#Mhuruuks|Mhuruuks]], Olnar offered Dormammu and Umar sanctuary and power in exchange for the knowledge of how to shatter dimensional barriers and absorb other dimensions into his domain. After decades of such conquest, Dormammu whether by chance or design, led Olnar to the dimension of the [[Mindless Ones]], indestructible rampaging dreadnoughts who slew Olnar and many other Dark Dimension denizens. Dormammu and Umar repelled and confined the creatures behind a barrier, using the confusion to murder most of the Mhuruuks and strip the remaining of most of their power. The siblings were hailed as heroes by the Dark Dimension, of which they were proclaimed regents; Olnar's infant son [[Orini]] deemed no threat, and he was allowed to live under their care. Umar had been weaken by her battle with the Mindless Ones, and Dormammu claimed sole authority over the Dark Dimension, ordering her to live apart from his subjects. As ruler, Dormammu altered his body into a form of living mystical energy, one that resembled the forms that he and Umar had while living in the Faltine dimension, but Umar remained in her humanoid form. The flames of regency enveloped Dormammu's head, a sign which would each ruler of the Dark Dimension from then on.\n\nGrowing up as Dormammu's loyal ward, the adult Orini eventually met Umar, and was attracted to her. Seeking to explore her humanity, Umar secretly had an affair with Orini, but after their sexual encounter, Umar was disgusted by the act of love making and shunned Orini. As a result of their brief union, Umar gave birth to a daughter, [[Clea]]. She refused to acknowledge Clea as her daughter and gave her to Orini to raise. Clea was brought in ignorance of her origins.\n\nAs Umar's ambitions grew Dormammu came to regard her as a threat, and finally banished her to a pocket dimension where she would be unable to escape or attain more knowledge of the mystic arts. Umar remained trapped in this dimension until recent years, when Dormammu foolishly challenged the cosmic entity [[Eternity]]. Eternity cast Dormammu into a realm unknown, and as an result, the spell confining Umar was broken. Umar returned to the Dark dimension and claimed the throne for herself, with the flames of regency now encircling her head. Discovering that her brother's plans to conquer the Earth had been repeatedly thwarted in recent months by [[Doctor Strange (Stephen Strange)|Dr. Strange]], heir apparent to the title of [[Glossary:S#Sorcerer Supreme|Sorcerer Supreme]] of Earth, Umar set out to destroy him. She learned that Dr. Strange had become attracted to Clea and used her own daughter as bait, at one point casting an illusion of Clea around one of the Mindless Ones in an attempt to destroy her foe. When Umar began to invade Earth itself, Dr. Strange's mentor the [[Ancient One]] aided his pupil and led him to release the creature [[Zom]], an old foe of Dormammu. When Umar faced Zom, who considered her an enemy because she was kin to Dormammu, she fled in panic back to the Dark Dimension, temporarily swearing off plans of conquest.\n\nDormammu eventually summoned Umar to the Realm Unknown and the two forged an uneasy alliance against their enemies as he sought the means to resume his invasion of Earth. Clea and the human mystic [[Bentley, Victoria|Victoria Bentley]] both surreptitiously influenced Umar into aiding Dr, Strange with her power, and Strange triumphed over Dormammu. In a later scheme, Dormammu's from was dispersed by the mystical [[Evil Eye]] artifact, but his followers' will gradually reassemble the flames which comprise his form in the Dark Dimension. Umar brought his flames to the Earth's core, and in his new form he bound the Earth mother [[Gaea]]. Umar and Orini drew Dr. Strange into the Dark Dimension and attempted to use the monstrous [[G'uranthic Guardian]] to steal his life-force, but it only managed to absorb his mystical knowledge, and Clea helped her lover regain his full power. Dormammu imprisoned the [[Scarlet Witch]], but her lover the [[Vision]] came to rescue her, and he briefly incapacitated Umar to facilitate an escape. Umar tuned on Dormammu  when he finally moved against the Earth, and fought Dr, Strange and Clea with Gaea's power, but she was defeated and Orini brought her back to the Dark Dimension.\n\nWhen Dormammu played a game of chess against the [[Asgardians|Asgardian]] [[Odin]], with [[Master Order & Lord Chaos|Lord Chaos and Master Order]] representing their respective sides, all of reality was threatened to be overwhelmed by chaos if Dormammu won. Umar served Dormammu and fought the Asgardians [[Thor]] and [[Sif]], but the game was ultimately a draw. After Dormammu was scattered across time and space following a battle with Dr. Strange, Umar resumed sole rule over the Dark Dimension, but oppressed citizens convinced Clea to lead them in a rebellion. Clea opposition inspired the people of the Dark Dimension to reject Umar's authority and resist the \"tax collections\" (absorption of mystic energy) that she enforced. Believing that Dr. Strange was behind the rebellion, Umar made interdimensional attacks upon Strange, at first interfering with him as he was in the mist of helping the [[Black Knight (Dane Whitman)]] purge his [[Ebony Blade]] of its blood curse, and then sending sea serpents and water elementals after her enemy. Strange was forced to enter the Dark Dimension and aid the rebellion.\n\nClea and Umar finally faced each other in personal combat, and Clea secretly activated a gemstone which broadcast the sounds and images of the battle across the Dark Dimension. As a result, the populace learned that Clea was the daughter of Umar and Orini, and they watched as Umar removed the barrier which held the Mindless Ones in captivity when she needed additional power to combat Clea. As Dr. Strange and the long banished Mhuruuks battled the Mindless Ones, the people of the Dark Dimension lost faith in Umar, and her power was slowly drained as the flames of regency dwindled from about her head and appeared around Clea. After Umar's defeat, Clea was declared the Dark Dimension's new ruler, since she was known to be related by blood to both Dormammu and the still-beloved King Olnar, granting her massive approval among the people. Umar and Orini were placed into suspended animation and banished from the Dark Dimension.\n\nWhen Dormammu eventually regained control of the Dark Dimension from Clea, he freed Umar, but she quickly turned on him and aided Clea, Dr. Strange, and Dormammu's one-time minion [[Baron Mordo]] in opposing him. Dr Strange suspected that Umar did care for Clea as her daughter, and that it had motivated her change of heart. To end the conflict, Umar agreed to let Dormammu have a dimension of his own to rule. However, the dimension that Umar gave him was that of the Mindless ones. Umar made Mordo her consort, and resumed ruling the Dark Dimension, but Dormammu plotted against her, tricking Clea into forming another rebellion. When Umar was overthrown, Dormammu claimed the Dark Dimension again, and imprisoned Umar. Baron Mordo was left to go his own way. ending their brief relationship.\n\nWhile Umar was in the Dark Dimension prison, she encountered the heroine [[Hellcat (Patricia Hellstrom)|Hellcat (Pasty Walker)]], who was opposing Dormammu. She attempted to make Hellcat release her, but she refused. Later, when the powerful creature [[Archenemy]] threatened the Dark Dimension, Umar rejected an offer to assist the sorceress [[Magik (Amanda Sefton)]], but Dormammu joined Magik's allies in destroying the Archenemy.\n\nRecently Dormammu obtained vast cosmic power from the essence of Eternity, and used this power to remake reality in his own image. Umar quietly tolerated his indulgences, and when Dr. Strange led the [[Defenders]] to oppose Dormammu, she wound up taking the [[Hulk (Bruce Banner)|Hulk]] as her prisoner and lover, but was disappointed when the Hulk transformed into his mortal form, Bruce Banner. Umar secretly transferred Dormammu's powers into herself and helped the Defenders defeat her brother, to honor an agreement that she would undo his alterations to reality. To punish her brother, Umar cast Dormammu into the form of a pathetic human and banished him to Earth, leaving her as ruler of the Dark Dimension. It is not clear how long she may retain her cosmic abilities.",
        "categories": [
            "Horror",
            "Magic",
            "Women"
        ]
    }
}