{
    "id": 1009511,
    "name": "Psycho-Man",
    "description": "",
    "modified": "2011-10-10T16:38:33-0400",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/5/e0/4c003c82b377c",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1009511",
    "comics": {
        "available": 8,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009511/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/892",
                "name": "4 (2004) #11"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/1550",
                "name": "4 Vol. 2: The Stuff of Nightmares (Trade Paperback)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/35533",
                "name": "Amazing Spider-Man (1999) #661"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/39041",
                "name": "Amazing Spider-Man (1999) #661 (X-Men Art Variant)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/35534",
                "name": "Amazing Spider-Man (1999) #662"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/13096",
                "name": "Fantastic Four (1961) #281"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/13151",
                "name": "Fantastic Four (1961) #330"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/5081",
                "name": "Fantastic Four Visionaries: John Byrne Vol. 6 (Trade Paperback)"
            }
        ],
        "returned": 8
    },
    "series": {
        "available": 5,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009511/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/725",
                "name": "4 (2004 - 2006)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1253",
                "name": "4 Vol. 2: The Stuff of Nightmares (2005)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/454",
                "name": "Amazing Spider-Man (1999 - 2013)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2121",
                "name": "Fantastic Four (1961 - 1998)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1760",
                "name": "Fantastic Four Visionaries: John Byrne Vol. 6 (2006)"
            }
        ],
        "returned": 5
    },
    "stories": {
        "available": 7,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009511/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/3059",
                "name": "\"THE STUFF OF DREAMS\" PART 2 (OF 3) With a diseased Psycho-Man loose somewhere in the city, the very fabric of New York’s realit",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/12837",
                "name": "With Malice Towards All!",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/12952",
                "name": "Good Dreams!",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/78586",
                "name": "Amazing Spider-Man (1999) #661 - Int",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/78589",
                "name": "Amazing Spider-Man (1999) #662",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/78590",
                "name": "Amazing Spider-Man (1999) #662 - Int",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/88610",
                "name": "Amazing Spider-Man (1999) #661 X-Men Art Variant - Int",
                "type": "interiorStory"
            }
        ],
        "returned": 7
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009511/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1009511/psycho-man?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Psycho-Man?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Unrevealed",
        "identity": "No dual identity",
        "occupation": "Conqueror, scientist",
        "place_of_birth": "[[Traan]]",
        "groups": "None",
        "citizenship": "Planet Traan, [[Sub-Atomica]] system, [[Glossary:M#microverse|Microverse]]  dimension",
        "education": "Unrevealed",
        "aliases": "None",
        "relatives": "None",
        "height": "5'9\" (on Earth)",
        "weight": "135 lbs. (on Earth)",
        "eyes": "Pale yellow-green",
        "hair": "Unrevealed",
        "powers": "Psycho-Man usually depended on armor and weapons. He has sometimes stated that he derives power from the emotions he causes, like a psychic vampire. He recently gained some of the powers of his Control Box, as well as the ability to generate solid energy forms to give substance to his illusions.",
        "paraphernalia": "His primary weapon is his portable Control Box, which stimulates fear, doubt, or hate; the type of emotion and its duration and intensity are adjustable, from mild to potentially life-threatening. The fear-ray frequently causes its victims to hallucinate. He sometimes reverses the effects of his Control Box, bombarding others with courage, confidence, and love, making them reckless and overly sentimental. He has also used larger devices with far greater range and effectiveness, affecting the entire populace of a planet. He has access to shrinking and enlarging technology.",
        "abilities": "Psycho-Man has great intelligence and mathematical genius, as well as extensive knowledge of technology far in advance of present-day Earth's.",
        "debut": "Fantastic Four Annual #5 (1967)",
        "main_image": "Psycho-man.jpg",
        "bio_text": "The Chief Scientist and ruler of the technocracy governing the five planets of the [[Sub-Atomica]] system within the [[Glossary:M#microverse|Microverse]] (a reality accessed via the energies of shrinking), Psycho-Man discovered the secrets of fear itself with the guidance of the Earth goddess Nox. When his system became overcrowded, he sought a new home for his people and chose Earth, whose population he believed had no defense against his weaponry. He created a human-sized armored suit and Control Box. Unable to transport a weapon large enough to affect the entire planet, he employed several criminals whom he kept in line via his Control Box-[[Ivan]], [[Live Wire]], and [[Shell-Shock]]-successfully gathering the materials to construct his large Control weapon. However, the land he used as his base had been recently purchased as Panther Island by the [[Black Panther (T'Challa)|Black Panther]]. With the help of the [[Inhumans]], the Black Panther fought with him and bested his partners. Then, with the appearance of the [[Human Torch (Johnny Storm)|Human Torch]], [[Thing (Benjamin Grimm)|Thing]], [[Triton]], and [[Lockjaw]], they fought him directly, but were stalled by his massive psycho ray that kept them at bay with their greatest fears. But [[Gorgon (Inhuman)|Gorgon]] arrived moments later and discovered the ruse and helped his friends escape and destroy the gun; and in a final battle, the Black Panther sneaked up behind Psycho-Man and grabbed him, where-in he disappeared again into the Microverse.",
        "bio": "The Chief Scientist and ruler of the technocracy governing the five planets of the [[Sub-Atomica]] system within the [[Glossary:M#microverse|Microverse]] (a reality accessed via the energies of shrinking), Psycho-Man discovered the secrets of fear itself with the guidance of the Earth goddess Nox. When his system became overcrowded, he sought a new home for his people and chose Earth, whose population he believed had no defense against his weaponry. He created a human-sized armored suit and Control Box. Unable to transport a weapon large enough to affect the entire planet, he employed several criminals whom he kept in line via his Control Box-[[Ivan]], [[Live Wire]], and [[Shell-Shock]]-successfully gathering the materials to construct his large Control weapon. However, the land he used as his base had been recently purchased as Panther Island by the [[Black Panther (T'Challa)|Black Panther]]. With the help of the [[Inhumans]], the Black Panther fought with him and bested his partners. Then, with the appearance of the [[Human Torch (Johnny Storm)|Human Torch]], [[Thing (Benjamin Grimm)|Thing]], [[Triton]], and [[Lockjaw]], they fought him directly, but were stalled by his massive psycho ray that kept them at bay with their greatest fears. But [[Gorgon (Inhuman)|Gorgon]] arrived moments later and discovered the ruse and helped his friends escape and destroy the gun; and in a final battle, the Black Panther sneaked up behind Psycho-Man and grabbed him, where-in he disappeared again into the Microverse.\n\nShortly thereafter, the Human Torch, Thing, and [[Mister Fantastic]] entered the Microverse seeking the [[Silver Surfer]] to prevent [[Galactus]] from consuming Earth. Detecting their presence, Psycho-Man sent his [[Indestructible]] robot to capture them, but the Silver Surfer wiped it from existence before returning to Earth. Psycho-Man then transported the [[Fantastic Four]] members aboard his ship and sent a number of armored forms against them; however, the heroes trapped Psycho-Man and convinced him that Galactus posed a threat to his world as well, and he returned them to Earth. Soon after, Sub-Atomica was overrun by the invading Insectivorids of [[Annihilus]]. Psycho-Man captured the Surfer to power his energy weapons and [[Spider-Man (Peter Parker)|Spider-Man]] to probe his mind for the means of driving off the insect swarm, but they escaped back to Earth. Annihilus was eventually driven off. \n\nApparently exiled by his people, Psycho-Man retreated to his Worldship, employing androids to clear space debris around him. Though remaining a man of science, he came to worship gods of Chaos. Psycho-Man also reclaimed his armor from the Fantastic Four, which led them to pursue him back to the Microverse. Meanwhile, Arcturus Rann and the Micronauts were attacked by his androids and followed them back to Psycho-Man's ship. There the teams joined forces to thwart Psycho-Man's plot to conquer the universe, though the Microversian Insectivorid, Jasmine, was slain by one of Psycho-Man's creatures.\n\nPsycho-Man later easily conquered [[Mirwood]], the Microverse planet of Princess [[Pearla]], seeking to seize the metal from its Mines of Nuvidia, which provided immunity to his emotion-control. He then returned to Earth, using an artificial being as his Hate-Monger, fanning bigotry and hatred into violent chaos across New York City, and transforming the [[Invisible Woman|Invisible Girl]] into his pawn Malice, Mistress of Hate. The Hate-Monger was destroyed by the villain-killing [[Scourge of the Underworld]], and the Fantastic Four restored Malice to her right mind. The Fantastic Four pursued Psycho-Man to Mirwood where, despite being initially captured and duped into believing they had been trapped at tiny size, they overpowered him. Confronting her tormentor, Sue Richards usurped his Control Box, subjecting him to all three emotions at maximum intensity, leaving him a withered husk and collapsing his autonomic nervous system. Allegedly requiring artificial support to survive, he sent a robot duplicate to Earth some time later, but it was easily defeated by Fantastic Four clones created by [[Aron the Watcher|Aron the Rogue Watcher]]. Psycho-Man then managed to shrink the entire Sub-Atomica system and held it hostage on his worldship until they acknowledged him as their ruler again. Lacking the power to restore the system to true size, he sought out the cosmic Uni-Power (briefly granted to beings to become [[Captain Universe]]), summoning Spider-Man and a number of its other past possessors to the Microverse. Finding Spider-Man and the rest bereft of those energies, Psycho-Man imprisoned them, but they broke free; subjected to an overload of his own shrink-ray by Spider-Man, Psycho-Man vanished from existence. \n\nAfter the apparent death of Mr. Fantastic, Psycho-Man plotted vengeance against the Invisible Woman, reconquering Mirwood and using Pearla to dupe the Fantastic Four into believing that Mr. Fantastic was in the Microverse. The Fantastic Four's newest member, [[Ant-Man (Scott Lang)|Ant-Man]], exposed Psycho-Man's involvement, and the seemingly invalid villain blew up his own base in an effort to slay his foes, though they escaped. Surviving as well, Psycho-Man occupied the facilities of Baron Karza, a Microverse tyrant then believed dead. Psycho-Man sought the future technology of the cyborg [[Kane, Garrison|Garrison Kane]] ([[Weapon X]]) to enhance the power of the Baron's Dog Soldiers, leading to a conflict with Kane's allies [[Cable]], [[Domino (Neena Thurman)|Domino]], and [[Copycat]], as well as [[Rann, Arcturus|Arcturus Rann]], [[Marionette]], and [[Bug]]. Cable used his psychic powers to bombard Psycho-Man with the powerful love emotions existing between Kane and Copycat, incapacitating the villain, who was left in stasis under the Rann's' supervision.\n\nWhen the Stark-Fujikawa Corporation somehow acquired one of Psycho-Man's armored suits and Control Boxes, Dr. Bradley Beynon used them to seek vengeance on Reed Richards, whom Beynon felt had stolen his ideas. The real Psycho-Man confronted him to retrieve his property, but both he and Beynon were sent back to the Microverse by a malfunctioning shrink ray. When the Silver Surfer pursued the extradimensional [[Tenebrae]] into the Microverse, Psycho-Man captured them both. The Surfer broke free, but Psycho-Man then joined with Tenebrae to capture the Silver Surfer and use him to power his ship as they plotted to conquer Earth; however, Tenebrae's former associates the [[Coroner]] had assimilated into the group-mind of the [[Mergence]] and attacked them, and Psycho-Man narrowly escaped back to his own realm. When Sub-Atomica's existence appeared to be threatened by energies from Earth, Psycho-Man traced them back to the young mutant Hope (Esperanza Ling), and he attempted to claim her power for himself. Hope was protected by Spider-Man, the alien Technarch [[Warlock (Technarchy)|Warlock]], and the telepath [[Psimon]], so Psycho-Man transported them back to his ship where his more powerful weapon nearly drove them all mad. The panicked Hope's technology-disrupting power nearly destroyed his ship, and Psycho-Man was forced to admit defeat and send the heroes home. \n\nShortly thereafter, all of the Microverse-type realms were merged during a conflict between the mad Titan [[Thanos]] and the revived Baron Karza. Around that time, [[Fredd]], the alternate-dimension evil twin clone future self of [[Photon (Genis-Vell)|Captain Marvel]] (Genis-Vell), was banished from his reality in an energy cocoon by his world's Reed Richards. He arrived in the Microverse, where his power was detected by Psycho-Man, who enlisted [[Drax the Destroyer]] to shatter the cocoon. Once freed, Fredd proved immune to the power of Psycho-Man, whom he dominated, and he captured Earth-616 (mainstream Earth)'s Captain Marvel to test Psycho-Man's enlarging the ray's ability to restore him to Earth. Captain Marvel took control of Fredd's Nega-Bands and tapped into Psycho-Man's Control Box, driving Fredd into a frenzy that culminated with his exploding Psycho-Man's World Ship.\n\nPsycho-Man finally began to succumb to the nerve degeneration initiated by Sue Richards'; attack. Dying, he returned to Earth to gain vengeance on his greatest enemies. His powers enhanced to a new degree, he caused the Fantastic Four to be evicted from the [[Baxter Building]], taking it as his own base. From there he spread his power across Manhattan, causing increasing levels of terror, violence, and depression. Sue, however, was able not only to sense his power, but to manipulate his energies, purging the city of them. Using the blind [[Masters, Alicia|Alicia Masters]] as a double to catch Psycho-Man unaware, Sue knocked him out by obstructing his airway, and he was placed in stasis.",
        "categories": [
            "Cosmic",
            "Fantastic_Four",
            "Villains"
        ]
    }
}