{
    "id": 1009555,
    "name": "Sage",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/5/90/4c003c44095cb",
        "extension": "png"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1009555",
    "comics": {
        "available": 6,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009555/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/5085",
                "name": "New Excalibur (2005) #11"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/6132",
                "name": "New Excalibur Vol. 2: Last Days of Camelot (Trade Paperback)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/16590",
                "name": "X-Men: Die by the Sword (2007) #1"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/1084",
                "name": "X-Treme X-Men: Savage Land (Trade Paperback)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/12394",
                "name": "X-Treme X-Men: The Savage Land (2001) #1"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/12396",
                "name": "X-Treme X-Men: The Savage Land (2001) #3"
            }
        ],
        "returned": 6
    },
    "series": {
        "available": 6,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009555/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/935",
                "name": "New Excalibur (2005 - 2007)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1897",
                "name": "New Excalibur Vol. 2: Last Days of Camelot (2007)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/8086",
                "name": "Wolverine Saga (2009)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2890",
                "name": "X-Men: Die by the Sword (2007 - 2008)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/144",
                "name": "X-Treme X-Men: Savage Land (1999)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2107",
                "name": "X-Treme X-Men: The Savage Land (2001 - 2002)"
            }
        ],
        "returned": 6
    },
    "stories": {
        "available": 6,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009555/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/5162",
                "name": "3 of 3",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/26043",
                "name": "Cover #26043",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/26047",
                "name": "Cover #26047",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/26128",
                "name": "Day of the Atom Part One: Black Holes",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/26144",
                "name": "Hark How the Bells--!",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/33460",
                "name": "5XLS - 1 of 5",
                "type": "cover"
            }
        ],
        "returned": 6
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009555/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1009555/sage?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Sage?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Tessa (presumed, full name unrevealed)",
        "identity": "Secret",
        "occupation": "Adventurer, former spy, personal assistant to [[Shaw, Sebastian|Sebastian Shaw]], mercenary",
        "place_of_birth": "Unrevealed",
        "groups": "Formerly [[Exiles]], [[Excalibur]], [[X-Men]], X-Treme Sanctions Executive, [[Hellfire Club]]",
        "citizenship": "U.S.A.",
        "education": "Unrevealed",
        "aliases": "None",
        "relatives": "Unrevealed",
        "height": "5'7\"",
        "weight": "135 lbs.",
        "eyes": "Blue",
        "hair": "Black",
        "powers": "Sage is a mutant who possesses a cyberpathic mind that functions like a computer with unlimited storage capacity. Sage is able to record and analyze vast amounts of data, including the entire genetic code of another living being, and can also calculate complex statistics in mere seconds.",
        "abilities": "Sage is skilled in the martial arts, and is a formidable hand-to-hand combatant thanks to her having complete conscious control over her own body. Sage is also self-taught in a wide range of firearms, which she can use with considerable skill and accuracy.",
        "paraphernalia": "Sage wears a pair of custom-built cyber shades that function as a wireless broadband computer network amongst like models. The shades provide an audio/video feed via an in-built computer system outfitted with miniaturized conventional microphones and cameras, and can also project a three-dimensional image into the visual field of the wearer that can be expanded to allow others to see with whom the wearer is communicating or information they are reviewing. The shades provide input by means of a virtual reality iconographic keyboard, and have an alternate visual input system for when a user’s hands are otherwise occupied. The shades can be interfaced with any external data network whether terrestrial or alien in origin. The shades also possess various sensors for detecting telepathic resonance patterns, tracking energy trails, and analyzing electronic circuitry, amongst others.",
        "weapons": "Sage wields a pair of handguns that fire non-lethal projectiles.",
        "debut": "(Unidentified) X-Men #132 (1980), (identified, as Tessa) Marvel Graphic Novel #4 (1982), (as Sage) X-Men #109 (2001)",
        "origin": "X-Treme X-Men #44 (2004), X-Treme X-Men #7 & 9 (2002)",
        "significant_issues": "Kidnapped by Pierce, rescued by Xavier (Marvel Graphic Novel #4, 1982); first encountered Bogan, left Hellfire Club (X-Treme X-Men #41, 2004); joined X-Men (X-Men #102, 2000); joined X-Treme X-Men (X-Men #109, 2001); evolved Beast's mutation (X-Treme X-Men #3, 2001); held prisoner by Shaw (X-Treme X-Men #5-9, 2001-2002); evolved Rogue's mutation (X-Treme X-Men #13, 2002); investigated murder at Bogan's estate (X-Treme X-Men #20-23, 2003); investigated murder at Mansion (New X-Men #139-141, 2003); defeated Bogan (X-Treme X-Men #40-45, 2004); rejoined X-Men (X-Treme X-Men #46, 2004); joined Excalibur (New Excalibur #5, 2006); joined Exiles (X-Men : Die by the Sword #5, 2007)",
        "main_image": "Csas.PNG",
        "bio_text": "Little is known of the life of the woman known as Tessa except that she had lived in a small village in the Balkan region of Europe whilst still a young girl, and that she had spent time in a harem under unrevealed circumstances. Just prior to her teenage years, Tessa found herself caught up in the Russian invasion of Afghanistan. She was forced to learn to fight to survive encounters with both soldiers and local bandits, and took weapons and equipment from the bodies of fallen combatants. One day, Tessa felt herself compelled to enter a cave in the nearby Hindu Kush mountain range. There, she found the powerful telepathic mutant named [[Professor X|Charles Xavier]], who had been trapped under a massive stone block by the alien being named [[Lucifer]]. Initially wary of him, Tessa rescued the critically injured mutant but soon after they encountered a United Nations aid convoy being attacked by bandits. Tessa drove off the attackers and then avenged the death of one young U.N. worker by brutally murdering the bandit that had raped and killed her.",
        "bio": "Little is known of the life of the woman known as Tessa except that she had lived in a small village in the Balkan region of Europe whilst still a young girl, and that she had spent time in a harem under unrevealed circumstances. Just prior to her teenage years, Tessa found herself caught up in the Russian invasion of Afghanistan. She was forced to learn to fight to survive encounters with both soldiers and local bandits, and took weapons and equipment from the bodies of fallen combatants. One day, Tessa felt herself compelled to enter a cave in the nearby Hindu Kush mountain range. There, she found the powerful telepathic mutant named [[Professor X|Charles Xavier]], who had been trapped under a massive stone block by the alien being named [[Lucifer]]. Initially wary of him, Tessa rescued the critically injured mutant but soon after they encountered a United Nations aid convoy being attacked by bandits. Tessa drove off the attackers and then avenged the death of one young U.N. worker by brutally murdering the bandit that had raped and killed her.\n\n\nYears later, Xavier recruited Tessa at the same time that he formed his original team of teenage mutant students he called the X-Men. Xavier kept Tessa's presence at his mansion a secret as he intended to utilize her own mutant telepathic talents as a spy in his fight for peaceful coexistence between mutants and humans. Tessa's first mission was to infiltrate the organization for the rich and powerful known as the [[Hellfire Club]] and to gain the trust of Sebastian Shaw, leader of the Club's Inner Circle at its New York branch. For years, Tessa acted as Shaw's familiar, advising and counseling him in both his legitimate and illegal business practices, all the while gathering information for Xavier. Shaw found Tessa's ability to function as a living computer invaluable and kept her in his employ for many years, even during the time he was deposed as leader of the Club.\n\nEarly in Tessa’s time with the Club, its renegade White Bishop, [[Pierce, Donald|Donald Pierce]], attempted a coup of the Club's leadership. Pierce kidnapped Tessa, believing that without her Shaw's position could more easily be compromised. She was rescued by Xavier and his team of [[New Mutants]] and, upon her return to the Club, Pierce was expelled.\n\nLater, Tessa ran afoul of one of the Club’s regular and valued patrons, a reclusive billionaire named [[Bogan, Elias|Elias Bogan]]. Shaw had made a wager with Bogan during a game of cards whereupon if Shaw lost, Bogan would win the Club's then-White Queen, the telepathic mutant [[Frost, Emma|Emma Frost]]. Bogan had never lost a game before, but with Tessa’s help Shaw won the bet. Bogan honoured the wager, but knew who was truly responsible for his defeat and exacted his revenge on Tessa, capturing her and branding her face with facial tattoos. Rescued by the X-Man [[Storm]], Tessa soon affiliated herself with the X-Men, acting as part of their support crew. In order to shield herself from detection by Bogan, Tessa consciously shut down her telepathic abilities, relying solely on her computer-like mind to assist her new teammates.\n\nWhen [[Kelly, Robert|Senator Robert Kelly]] announced his intention to run for the Presidency on an anti-mutant platform, Tessa met with him to persuade him otherwise by convincing him that his actions were no different to those of the mutant terrorist [[Magneto (Magnus)|Magneto]]. Kelly was not so easily swayed, however, and it wasn’t until a mutant sacrificed his life to save Kelly that he realized his folly.\n\nSoon after, Tessa was given the codename Sage by Storm who recruited her into a splinter group of [[X-Treme X-Men]] who set out to search for the diaries of the blind mutant seer named [[Destiny (Irene Adler)|Destiny]] that predicted the future of mutantkind. On the new team's first mission, Tessa was instrumental in saving the life of her teammate the [[Beast (Henry McCoy)|Beast]] after an encounter with the self-professed enhanced human named [[Vargas]]. Sage used a heretofore-unseen ability to advance the Beast's evolution to its next stage, healing him of his injuries and activating his latent secondary mutation.\n\nEventually learning of Tessa's deception, Shaw allied himself with [[Lady Mastermind]], the daughter of former Hellfire Club member [[Mastermind (Jason Wyngarde)|Jason Wyngarde]], to exact revenge on his former assistant. Lady Mastermind trapped Tessa in a convincing illusion, making her believe that she was once again Shaw's assistant back in the Hellfire Club. Tessa was freed thanks to the efforts of [[Lifeguard|Heather Cameron]], an Australian mutant with the ability to manifest various super-human powers depending on what the current situation called for, and the X-Men defeated Shaw once more.\n\nTessa later catalyzed the latent mutant powers of Heather’s brother Davis, who subsequently joined the X-Treme X-Men as [[Slipstream]], as well as evolving her teammate [[Rogue|Rogue's]] mutant ability to grant her control over the manifestation of the powers and abilities she has absorbed over the years.\n\nTessa often used her computer-like mind to assist her teammate [[Bishop (Lucas Bishop)|Bishop]] in his activities as a homicide detective, such as when they were called upon to investigate the attempted murder of Emma Frost, now a member of the X-Men and an instructor at Xavier’s school.  Later, when the X-Treme team encountered Bogan once more after a murder at his Alaskan estate, Sage and Bishop were called in to investigate. A young mutant named Jeffrey Garrett was wanted for questioning after Bogan had his family killed and, in retaliation, he teleported Bogan's associates onto the nearby glacier where they froze to death. Garrett fled to the [[Xavier Institute For Higher Learning|Xavier Institute]] where he came under the protection of Frost. However, Bogan had secretly possessed the young boy and when Frost scanned his mind, Bogan took possession of her. Sage and Bishop followed the trail to the mansion where Bogan captured them, but the timely arrival of Storm allowed them to escape and defeat the villain.\n\nBogan returned to plague the X-Treme X-Men soon after when he captured and mentally enslaved Bishop, hoping to use him as a weapon against his teammates. With the aid of several of their former allies the X-Men were able to rescue Bishop, which allowed Sage to defeat Bogan once and for all. Sage then accompanied her teammates back to New York to assist in the rebuilding of the mansion following an attack by Magneto, after which they rejoined the core X-Men team.\n\nLater, Sage joined a new incarnation of the British super-team Excalibur and later joined the Exiles, however, she was absorbed by the Crystal Palace, recently.",
        "categories": [
            "X-Men",
            "Heroes",
            "Mutants"
        ]
    }
}