{
    "id": 1009551,
    "name": "Russian",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/8/10/4c003c4af200f",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1009551",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009551/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009551/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009551/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009551/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1009551/russian?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Russian?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Unrevealed",
        "aliases": "The Ivan",
        "identity": "Secret, known to select underworld crime bosses.",
        "occupation": "Hitman, mercenary, one man death squad.",
        "citizenship": "Russia",
        "place_of_birth": "Smolensk, Russia.",
        "relatives": "Unrevealed",
        "groups": "Gnucci Crime Syndicate, Grand Nixon Island Paramilitary Organization, founding member of [[Daredevil (Matthew Murdock)|Daredevil]], Man Without Fear fan club of Smolensk.",
        "education": "Unrevealed",
        "height": "7’2’’",
        "weight": "573 lbs",
        "eyes": "Blue.",
        "hair": "Reddish-blond.",
        "powers": "Following his resurrection and subsequent reconstruction at the hands of General Kreigkopf’s paramilitary organization, The Russian possessed greatly enhanced strength and damage resistance. This is as a result of a large amount of Adamantium being surgically grafted to his bones, as well as various super-hard plastics being added to his physical structure, and the addition of a Titanium jaw. He has since been proven able to withstand knife and gunshot wounds, as well as emerging largely unscathed from a full-blown plane crash.",
        "abilities": "Despite having no formal training in the art of combat, The Russian is a world class brawler and street fighter. Implanted lungs from a gorilla as well as a combination of three hearts mean The Russian is capable of greatly enhanced feats of endurance and is extremely slow to tire in combat. He also possesses boosted olfactory senses as a result of the procedures carried out on him.",
        "weapons": "The Russian almost never uses weapons, as he favors decimating his opponents in a sustained and brutal beating.",
        "paraphernalia": "",
        "debut": "Punisher #8 (2000), (post-reconstruction) Punisher #1 (2001)",
        "origin": "",
        "significant_issues": "",
        "main_image": "Russian.jpg",
        "bio_text": "Little is known of the origins of the man known as the Russian, save for the fact he has a history of violence. A long-time associate of Ma Gnucci and her mafia cartel, the Russian has raised the ire of many powerful individuals. This has included yakuza hit squads, and even extended as far as to persuade an unidentified government agency to send the Special Forces team Bravo Force to hunt him down during his time in Kazakhstan. Defeating Bravo Force with ease, The Russian released the sole survivor of the team with a warning for the repeated attempts on his life to stop, or else he would come for those that sanctioned the attacks.",
        "bio": "Little is known of the origins of the man known as the Russian, save for the fact he has a history of violence. A long-time associate of Ma Gnucci and her mafia cartel, the Russian has raised the ire of many powerful individuals. This has included yakuza hit squads, and even extended as far as to persuade an unidentified government agency to send the Special Forces team Bravo Force to hunt him down during his time in Kazakhstan. Defeating Bravo Force with ease, The Russian released the sole survivor of the team with a warning for the repeated attempts on his life to stop, or else he would come for those that sanctioned the attacks. \n\nFollowing these events, the Russian received a call from Ma Gnucci requesting his assistance in dealing with the [[Punisher (Frank Castle)|Punisher]]. Accepting this offer, the Russian attacked the Punisher in his apartment, overpowering Castle and beating him senseless, before falling prey to a hot slice of pizza in the eyes. This allowed the Punisher the chance to trip the Russian, then use his morbidly obese neighbor, Mr Bumpo, to smother the Russian to death. The Punisher then cut off the Russian’s head and used it to taunt Ma Gnucci. \n\nA short while later, a paramilitary organization under the command of former US General Kriegkopf took the Russian’s remains to their base on Grand Nixon Island. It was here that he was reconstructed using Adamantium, super hard plastics, and a variety of organs obtained from animals such as gorillas into a killing machine they planned to hire out to the highest bidder. One downside of this reconstruction was the need to inject a series of untested chemicals and hormones to help the Russian’s body accept it’s new parts. The side effect of these hormones was that they caused the Russian to grow breasts, much to his twisted delight. \n\nBefore heading off on his first assignment for his new masters, the Russian requested one more chance at defeating the Punisher. Again the Russian severely beat Frank Castle, before tying him up and throwing him from the top floor of the Empire State Building. The Punisher was saved by the intervention of [[Spider-Man (Peter Parker)|Spider-Man]], who was then knocked unconscious by the Russian and employed by the Punisher as a human shield. The Punisher then used Spider-Man’s web shooters to stun the Russian, before knocking him off the roof, through the pavement, and down into the path of an oncoming subway train. \n\nDespite this ordeal, the Russian managed to make it back to the extraction point, and was returned to Grand Nixon Island and reconstructed once more. The Russian was then placed on a 747 to begin his first mission for his new bosses. Immediately upon take-off, the Punisher, who had come to Grand Nixon Island in pursuit of General Kreigkopf, shot down the jet. The Russian survived this crash with only superficial injuries, and then chased the Punisher onto a plane loaded with a forcefully obtained French nuke, destined to be dropped onto a meeting of European leaders taking place in Brussels, Belgium. Following yet another brutal fight, the Punisher managed to hook the Russian to the nuke, which he then dropped from the plane onto Grand Nixon Island, annihilating all life on the base.",
        "categories": [
            "Deceased",
            "International",
            "Marvel Knights",
            "Villains"
        ]
    }
}