{
    "id": 1009639,
    "name": "Super-Skrull",
    "description": "After the Fantastic Four stopped the Skrulls' attempted invasion of Earth, Skrull Emperor Dorrek invested vast resources into creating a superbeing of his own.",
    "modified": "2013-11-01T16:51:40-0400",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/9/b0/5274138fe6deb",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1009639",
    "comics": {
        "available": 10,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009639/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17271",
                "name": "Annihilation: Conquest (2007) #1"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17405",
                "name": "Annihilation: Conquest (2007) #2"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17645",
                "name": "Annihilation: Conquest (2007) #3"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/4317",
                "name": "Annihilation: Super-Skrull (2006) #3"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17755",
                "name": "Avengers (1996) #13"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17638",
                "name": "Avengers: The Initiative (2007) #9"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/21366",
                "name": "Avengers: The Initiative (2007) #14"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/24571",
                "name": "Avengers: The Initiative (2007) #14 (SPOTLIGHT VARIANT)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/5199",
                "name": "Irredeemable Ant-Man (2006) #1"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/15894",
                "name": "Irredeemable Ant-Man Vol. 1: Low-Life (2007)"
            }
        ],
        "returned": 10
    },
    "series": {
        "available": 6,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009639/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/3061",
                "name": "Annihilation: Conquest (2007)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1080",
                "name": "Annihilation: Super-Skrull (2006)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/3621",
                "name": "Avengers (1996 - 1997)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1945",
                "name": "Avengers: The Initiative (2007 - 2010)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/977",
                "name": "Irredeemable Ant-Man (2006 - 2007)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2423",
                "name": "Irredeemable Ant-Man Vol. 1: Low-Life (2007)"
            }
        ],
        "returned": 6
    },
    "stories": {
        "available": 9,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009639/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/5496",
                "name": "1 of 6 -",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/5945",
                "name": "Annihilation: Super-Skrull (2006) #3",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/36194",
                "name": "Annihilation: Conquest (2007) #1 - Int",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/36494",
                "name": "Annihilation: Conquest (2007) #2 - Int",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/36907",
                "name": "Avengers: The Initiative (2007) #9",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/36934",
                "name": "Annihilation: Conquest (2007) #3 - Int",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/37685",
                "name": "World War 3 Part 2 of 4",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/47184",
                "name": "Avengers: The Initiative (2007) #14",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/54370",
                "name": "Avengers: The Initiative (2007) #14, Spotlight Variant",
                "type": "cover"
            }
        ],
        "returned": 9
    },
    "events": {
        "available": 3,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009639/events",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/events/229",
                "name": "Annihilation"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/events/293",
                "name": "Annihilation: Conquest"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/events/269",
                "name": "Secret Invasion"
            }
        ],
        "returned": 3
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1009639/super-skrull?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Super-Skrull?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Kl'rt",
        "aliases": "Invincible Man, Lon Zelig, Bobby Wright (Captain Hero), Joshua Plague; has impersonated many beings including Hulkling, Franklin Richards, Iron Fist, Thing, Denny Marek, Captain Mar-Vell, Carol Danvers, Walter Lawson, Franklin Storm",
        "identity": "Publicly known",
        "occupation": "Soldier, warrior",
        "citizenship": "[[Skrulls|Skrull Empire]]",
        "place_of_birth": "[[Tarnax IV]] (destroyed), Tarnax System, Andromeda Galaxy",
        "relatives": "[[Jazinda]] (daughter), Sarnogg (son, presumed dead), unidentified Countess (estranged wife, presumed dead)",
        "groups": "None; Formerly [[Phalanx]], [[United Front]]",
        "education": "Graduate of the Skrullian military academy",
        "height": "6'8\" (Variable)",
        "weight": "625 lbs. (Variable)",
        "eyes": "Yellow (Variable)",
        "hair": "None (Variable)",
        "powers": "Super-Skrull has been genetically altered to possess all the powers of the Fantastic Four. As such, he can elongate any part of his body, emit and control flames, use his control over flame to fly, become invisible, form invisible force fields, possess superhuman strength, and transform into a rocky hide/body armor. He is also capable of hypnosis.",
        "abilities": "As a Skrull, Kl'rt is able to transform his body into any shape he wishes. Kl'rt is a trained soldier and commander in the Skrull army.",
        "weapons": "None",
        "paraphernalia": "None",
        "debut": "Fantastic Four #18 (1963)",
        "origin": "Fantastic Four #18 (1963)",
        "significant_issues": "",
        "main_image": "Super skrull.jpg",
        "bio_text": "After the [[Fantastic Four]] stopped the [[Skrulls]]' attempted invasion of Earth, Skrull Emperor [[Dorrek]] invested vast resources into creating a superbeing of his own. K'lrt, a decorated soldier and warrior of the Skrull empire, was chosen to undergo a process that endowed him with all the powers of the Fantastic Four, except, when powered by an interstellar beam, far stronger.  When the Super-Skrull first confronted the Fantastic Four, he bested them with their own abilities until [[Mister Fantastic]] identified the power source beamed from the Skrulls home planet and created a jamming device, depriving the Super-Skrull of his powers. Then the [[Invisible Woman|Invisible Girl]] tripped him into a crater and the [[Human Torch (Johnny Storm)|Human Torch]] melted the rock around it to seal him in.",
        "bio": "After the [[Fantastic Four]] stopped the [[Skrulls]]' attempted invasion of Earth, Skrull Emperor [[Dorrek]] invested vast resources into creating a superbeing of his own. K'lrt, a decorated soldier and warrior of the Skrull empire, was chosen to undergo a process that endowed him with all the powers of the Fantastic Four, except, when powered by an interstellar beam, far stronger.  When the Super-Skrull first confronted the Fantastic Four, he bested them with their own abilities until [[Mister Fantastic]] identified the power source beamed from the Skrulls home planet and created a jamming device, depriving the Super-Skrull of his powers. Then the [[Invisible Woman|Invisible Girl]] tripped him into a crater and the [[Human Torch (Johnny Storm)|Human Torch]] melted the rock around it to seal him in.  \n\nRealizing their champion's predicament, the Skrulls developed a stronger source of power and beamed it to him. Re-powered, the Super-Skrull, disguised himself as [[Storm, Franklin|Doctor Franklin Storm]], the father of the Invisible Girl and the Human Torch, and again attacked the Fantastic Four. He called himself the Invincible Man, and claimed that he had received his powers in the Skrulls' prison laboratory. But Mr. Fantastic soon discovered the truth and threatened the Skrull homeworld with a fight to the death with the Super-Skrull and a direct atomic attack on their homeplanet.  The Skrulls recalled the Super-Skrull and sent Dr. Storm back, although they first booby-trapped him with an explosive in an attempt to destroy the Fantastic Four. Storm, however, threw himself on the floor and took the brunt of the explosion to save his family and their friends, killing himself.\n\nHis repeated defeats at the hands of the Fantastic Four allowed the Super-Skrull to fall out of favor with his government.  Despite a second chance against the thunder [[Thor (Thor Odinson)|Thor]], the Super-Skrull was exiled. \n\n[[image:superSkrull01.jpg|thumb|left|200px]]However, due to the loyalty to his race and his extreme power levels, the Skrulls have usually found they have need of the Super-Skrull, recalling him to service time and again. For example, Dorrek once hoped the Super-Skrull would the Kree [[Captain Marvel (Mar-Vell)|Captain Marvel]]), disrupting the Kree from their surveillance of Earth, but Captain Marvel turned Kl'rt's power against him. Another time, he was drafted into the then-ongoing Kree-Skrull War, fighting the [[Avengers]] but hoping to take advantage of the war to increase his own political standing. This time, he was sent into permanent exile for treason. \n\nWorking as a free agent, the Super-Skrull became an agent for [[Thanos]] the mad Titan, running once more into Captain Marvel. This time, his defeat left him stranded on Earth without interstellar transportation. Hoping to power a starship and flee the planet, he tried to steal the Cavourite crystal but was confronted by [[Ms. Marvel (Carol Danvers)|Ms. Marvel]] and [[Spider-Man (Peter Parker)|Spider-Man]]. The Super-Skrull routed the two, but when he captured the crystal, its energies interfered with those of the interstellar beam that boosted his powers-- he found himself teleported to the Skrull throneworld. Unfortunately, he could never regain his physical form. \n\nThe throneworld soon fell victim to [[Galactus]], and the process of the planet's destruction send the Super-Skrull's disconnected form back to Earth, where it became trapped in the Van Allen Radiation Belts. Eventually, a group of scientists, including Dr. Walter Langkowski, a.k.a. the hero [[Sasquatch (Walter Langkowski)|Sasquatch]], made contact with the Super-Skrull's atoms with their equipment, inadvertantly allowing the Super-Skrull to reincorporate. The Super-Skrull's elation at being free was tempered with the fact that he was now physically dying. As a result of his entrapment within the radiation belts, he had developed a form of leukemia. Sasquatch battled the rampaging Skrull but was ultimately forced to return him to his discorporate state and return it to the Van Allen Radiation Belts once more.\n\nDuring his time of incapacitation, the Skrulls lost their natural shape-changing powers and their empire was decimated into factions. (In fact, K'lrt's wife R'Kll was the assassin who killed the Emperor Dorrek.) One of the self-proclaimed \"Empresses\" of the empire's remnants, [[S'byll]], tricked the [[Silver Surfer]] into using his power cosmic to re-form the Super-Skrull in order that they may aid her fleet in battle against the [[Badoon]]. This act threatened to escalate a new Kree-Skrull war, and the Super-Skrull convinced the Surfer to use his power cosmic to help him catalyze the latent shape-changing powers in S'byll's genetic structure. The two were able to awake the full power of a shape-changing Skrull in S'byll as well as to give her the ability to rekindle the shape-changing powers of others of her race. S'byll was sure that this ability would grant her support for her Empress-ship and allow the Skrulls to defy the Kree's genocidal efforts against the Skrulls. K'lrt stayed on as S'byll's champion, enjoying unparalleled fame as a great hero of the Skrull worlds.\n\nShortly after, the enigmatic [[Stranger]] appeared and tried to add S'byll to his collection. The attempt was foiled when the pirate [[Reptyl|Captain Reptyl]] arrived on the scene and traded his entire pirate crew for her. In return for her freedom, he asked to become a privateer in her cause, and S'byll, happy to find a new ally, accepted his service. Enraged, K'lrt dueled with Captain Reptyl for the honor of being S'byll's consort and the Warlord of the Skrulls. K'lrt lost, and was believed slain, left to drift in space. In fact, the Super-Skrull did not die, but managed to find his way back to Earth where he decided to remain hidden until he could receive orders from a legitimate heir to Emperor Dorrek. \n\nAt one point, the Super-Skrull duplicated the likeness of Danny Rand, a.k.a. [[Iron Fist (Danny Rand)|Iron Fist]], fully assuming his identity in order to use the Rand Corporation and gain economic control of the Antarctic paradise known as the [[Savage Land]]. This conflicted with the plans of another company, Oracle Inc., owned by Prince Namor the [[Sub-Mariner]]. Namor, [[Namorita]], and [[Knight, Misty|Misty Knight]] confronted Super-Skrull, who, with his plans ruined, abandoned Rand's identity and fled. (The assembled heroes set out on a search for the real Danny Rand, eventually freeing him from the alien [[H'ylthri]].)\n\nDuring his time of hiding, he appropriated the identity of Lon Zelig, a master of disguise, and he quickly gained renown in Hollywood. Eventually, he was targeted for assassination by other Skrulls, who believed K'lrt to be a living representative of an old regime and a dangerous potential menace. The Skrulls tricked the Human Torch into fighting alongside them, but K'lrt defeated the attempt and revealed the truth to the Human Torch before disappearing once more.\n\nThe Super-Skrull was impressed into serving a Skrull faction led by the [[Intelligentsia]], a Skrull version of the Kree's [[Supreme Intelligence]]. Although he apparently bristled at her leadership, he followed one of her orders to kidnap Kelly, a girl on Earth who held a special connection to the nexus of all realities. This first brought him into conflict with [[Photon (Genis-Vell)|Captain Marvel]] over her fate, but Kl'rt kidnapped her, rather than killing her as was ordered, and returned to Intelligentsia with her. Hoping to stage a coup, with the girl's powers, the Super-Skrull again fought off Captain Marvel, but Kelly instead turned her power on herself, negating her abilities, rendering the whole thing moot. The Super-Skrull was never seen working with the Intelligentsia again. \n\n[[image:superSkrull02.jpg|thumb|right|200px]]By this time, S'byll had died when her Skrull throneworld was destroyed by [[Devos]]. The Super-Skrull joined a faction of the empire who were seeking an heir to Emperor Dorrek, believing him to be found in Teddy Altman, [[Hulkling]]. Teddy was the product of the union between the original Captain Marvel and [[Anelle|Princess Anelle]], during the time of Marvel's abduction by the Super-Skrull many years ago. Despite the interference of Teddy's friends, the [[Young Avengers]], the Super-Skrull revealed the truth of Teddy's origin and killed his \"mother\", a Skrull sent by the Princess to raise her son on Earth. Teddy was forced to acknowledge his heritage to both the Kree and the Skrulls, dividing his time between the two empires. In fact, unknown to all but the Young Avengers, Kl'rt impersonated Hulking, taking his place and his role in order to spy on the two races. \n\nShortly thereafter, however, the Skrull empire fell victim to the [[Annihilation|Annihilation Wave]], although the Super-Skrull, for all his power, seemed helpless to stave its course. Believing his son to be residing on a planet in its path, Kl'rt and a Skrullian engineer [[R'kin]] hoped to find the secret to stop the Annihilation Wave and its weapon, the [[Harvester of Sorrows]], from its source: the [[Negative Zone]]. Rallying troops from a penal colony within the Zone, the Super-Skrull was instead betrayed by R'kin, who held the Super-Skrull responsible for the death of his father. Imprisoned, Kl'rt used his hypnosis to force R'kin to free him and fellow prisoner [[Praxagora]], the last of a robotic race. The Super-Skrull urged Praxagora to escape, but not before absorbing enough of her energy to make one final stand from within. Kl'rt sacrificed himself destroyed the Harvester, once more proving himself to be a hero for his people. Super-Skrull's body was later revealed to be in possession of Praxagora who had survived the explosion and joined the [[United Front]] against [[Annihilus]]. In one of the battles against Annihilus' forces Super-Skrull's body was reanimated by compination of [[Firelord]]'s and [[Ravenous]]' powers as they unleashed them in the mist of the battle. He stayed with the United Front until the end of the war.\n\nRecently, Ronan called both Kl'rt and Praxagora to Kree space in order to give them awards for their heroics during the war. However the Kree Empire was already infected by the [[Phalanx]]. Somehow the Phalanx had captured both Kl'rt and Praxagora and infected them with their techno-organic virus, causing them to become servants of the Phalanx. However, due to the intervention of the being known as [[Wraith (Zak-Del)|Wraith]] both Kl'rt and Praxagora were freed from the Phalanx's control.",
        "categories": [
            "Annihilation",
            "Cosmic",
            "Fantastic Four",
            "People who used to be dead but aren't anymore",
            "Villains"
        ]
    }
}