{
    "id": 1009587,
    "name": "Shriek",
    "description": "Shriek became a groupie for a rock band and a drug dealer on the side until the vigilantes Cloak and Dagger happened by during one of her deals.",
    "modified": "2013-11-20T17:27:36-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/8/03/528d36b054844",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1009587",
    "comics": {
        "available": 5,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009587/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/14656",
                "name": "Peter Parker, the Spectacular Spider-Man (1976) #201"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/14657",
                "name": "Peter Parker, the Spectacular Spider-Man (1976) #202"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/14658",
                "name": "Peter Parker, the Spectacular Spider-Man (1976) #203"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/14680",
                "name": "Peter Parker, the Spectacular Spider-Man (1976) #223"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/1404",
                "name": "Spider-Man Maximum Carnage (Trade Paperback)"
            }
        ],
        "returned": 5
    },
    "series": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009587/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2271",
                "name": "Peter Parker, the Spectacular Spider-Man (1976 - 1998)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1169",
                "name": "Spider-Man Maximum Carnage (2004)"
            }
        ],
        "returned": 2
    },
    "stories": {
        "available": 5,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009587/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/29780",
                "name": "Maximum Carnage, Part Five: Over the Line!",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/29782",
                "name": "Maximum Carnage, Part 9 of 14",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/29783",
                "name": "Maximum Carnage, Part Nine: The Turning Point",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/29786",
                "name": "Maximum Carnage, Part 13: War of the Heart",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/29877",
                "name": "Aftershocks, Part 2: Schemes & Dreams: For Future Screams",
                "type": "interiorStory"
            }
        ],
        "returned": 5
    },
    "events": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009587/events",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/events/151",
                "name": "Maximum Carnage"
            }
        ],
        "returned": 1
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1009587/shriek?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Shriek?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Frances Louise Barrison",
        "identity": "Known",
        "aliases": "Sandra Deel, \"First Lady of the Carnage Family\"",
        "occupation": "Mass murderer, former partner of [[Carnage (Cletus Kasady)|Carnage]], [[Carrion (Malcolm McBride)]], [[Demogoblin]] and [[Doppelganger (Infinity War)|Doppelganger)]].  Before she became Shriek, she was a rock band groupie and drug dealer.",
        "place_of_birth": "Unknown",
        "groups": "Formerly [[Carnage Family]]",
        "citizenship": "U.S.A. with a criminal record",
        "education": "Unrevealed",
        "relatives": "Carnage (adopted husband), Carrion (Malcolm McBride) and Demogoblin (adopted sons), Doppelganger (adopted pet), unidentified parents",
        "height": "5'8\"",
        "weight": "115 lbs.",
        "eyes": "Blue (left eye will glow yellow when using her powers)",
        "hair": "Black",
        "powers": "Shriek has the power to manipulate sound to either disorient her enemies or fire concussive blasts from her hands, and she also has the ability to fly and levitate objects or people indicating some form of psionic powers.  Shriek can manipulate the inner fears and angers in a person's mind and make them act on those emotions in a violent manner, and it proved capable of affecting someone as strong-minded as [[Iron Fist (Danny Rand)|Iron Fist]].",
        "weapons": "None",
        "paraphernalia": "None",
        "debut": "Spider-Man Unlimited #1 (1993)",
        "origin": "",
        "significant_issues": "Spider-Man Unlimited #1, Web of Spider-Man #101, Amazing Spider-Man #378, Spider-Man #35, Spectacular Spider-Man #201, Web of Spider-Man #102, Amazing Spider-Man #379, Spider-Man #36, Spectacular Spider-Man #202, Web of Spider-Man #103, Amazing Spider-Man #380, Spider-Man #37, Spectacular Spider-Man #203 (all above mentioned titles in “Maximum Carnage” storyline), Amazing Spider-Man #390-393 (“Shrieking” storyline), Web of Spider-Man #117, Spectacular Spider-Man #223 and Amazing Spider-Man #403, Seen with other members of the super-villain community hanging out in one of their floating hideouts (Amazing Spider-Man #552, 2008)",
        "main_image": "shriek.jpg",
        "bio_text": "",
        "bio": "As a young girl, Shriek had a miserable childhood that eventually drove her to drugs.  Her mother was ashamed of her for being overweight and she was abused by both her parents.  She became a groupie for a rock band, and a drug dealer on the side until the vigilantes [[Cloak]] and [[Dagger]] happened by during one of her deals. Having already suffered enough traumas to make her dangerously unstable, a short stay in Cloak's dark dimension pushed her over the edge into insanity. After that, she was captured and imprisoned in [[Ravencroft]]. According to her, she was also shot in the head by police and while gluing the pieces together again, the doctors apparently missed some.  However, it is still unclear as to how her powers actually developed.  It could be that she already had these powers but they didn’t manifest themselves until she was exposed to Cloak’s darkness, or they could have been a side effect of the drugs she was taking, or it could have been a combination of these events, among others, that caused her powers to develop.\n\nWhen the menace [[Carnage (Cletus Kasady)|Carnage]] was imprisoned and escaped from Ravencroft, Shriek talked him into taking her with him. After that, they met with [[Doppelganger (Infinity War)|Doppelganger]], [[Demogoblin]] and [[Carrion (Malcolm McBride)]]. Shriek's childhood problems of being obsessed with families started to surface, and she adopted Carnage as her husband, Carrion and Demogoblin as their children to which she would teach their evil ways, and Doppelganger became their adopted pet.  Carnage, demented in his own right, went along with this dysfunctional family idea of hers.  During this episode in Spider-Man’s life now referred to as [[Maximum Carnage]], Shriek used her powers to induce everyone they came across in the city of New York to be evil. Shriek and her adopted family had to battle [[Spider-Man (Peter Parker)|Spider-Man]] and several of his allies such as [[Black Cat]], [[Iron Fist (Danny Rand)|Iron Fist]], and [[Venom (Eddie Brock)|Venom]].  Doppelganger had become close to Shriek and gave his life to protect her when Carnage attacked her for her rebellious behavior.  The fighting within the [[Carnage Family]] became too much and with the death of Doppelganger, Carrion seemingly rid of the virus inside him, and Demogoblin wanting to repent for his murderous ways, Shriek thought she too had seen the light.  Shriek was returned to Ravencroft after the events of Maximum Carnage.\n\nShriek attempted to escape twice from Ravencroft. Once, alongside the vigilante [[Mayhem]] and a handful of other inmates, she was defeated by Spider-Man and [[John Jameson]] before they managed to escape.  The second was when [[Kafka, Ashley|Dr. Kafka]] was treating the seemingly cured Malcolm McBride, and tried to convince him that he was not insane by taking him to Shriek’s cell in order to show him a truly insane person.  However, seeing her “son” made her snap yet again, and broke free from her specially designed cell.  Using her powers, she reactivated the Carrion virus within McBride, and set out to reunite her “family” only it was too late for Demogoblin had also been killed and Carnage was in a coma.  Spider-Man, after a few trying events in his own life,  intercepted and attacked Shriek with a viciousness she hadn’t seen before, but she turned the tables with her sonic powers when she made Spider-Man hesitate by begging him to stop hitting her.  Shriek sensing the darkness within Spider-Man growing decided that he would be a suitable “father” for Carrion, therefore taking the place of Carnage in her demented family.  With the virus almost completely taken over Malcolm’s mind, Shriek took him to visit his mother because he was still attached to her.  Spider-Man tracked them down and was attacked by the confused Carrion while trying to save the life of his real mother, Beatrice McBride.  Spider-Man now takes his frustrations out on Carrion and just as he is about to fall Beatrice McBride pleads to Spider-Man’s conscience to stop.  It is then that Shriek realizes Spider-Man could never take the place of Carnage and blasts him with a sonic burst, and forces Malcolm to choose who he wants for his mother.  Carrion, more confused than ever, turns his power on himself but something inside Shriek changes as she sees Beatrice McBride go to embrace him possibly ending in the death of both of them.  Shriek absorbs the Carrion virus and collapses leaving Malcolm free of his curse, and enabling Spider-Man to return her to Ravencroft.  After those events, Shriek was treating the virus inside her as an unborn child when the [[Jackal]] paid her a visit and removed the virus from her body.\n\nIt could be assumed that Shriek is still undergoing therapy at Ravencroft. However, she has recently been seen at the [[\"Bar With No Name\"]] amongst a host of other super villains making bets on what was inside a mysterious chrysalis that appeared overnight in Manhattan.",
        "categories": [
            "Villains",
            "Spider-Man",
            "Spider-Man Villains",
            "Women"
        ]
    }
}