{
    "id": 1009669,
    "name": "Tiger Shark",
    "description": "A champion Olympic swimmer, Todd Arliss earned nearly half million dollars in advances for public exhibitions, but his dreams came crashing down around him when he injured his back and legs while rescuing a man who had fallen overboard from a private craft, sending Arliss into the arms of Dr. Lemuel Dorcas, who used his \"morphotron,\" which could imprint the genetic pattern of an animal onto a human, turning Arliss into a superhuman, amphibious creature.",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/9/10/4c003a9db2f77",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1009669",
    "comics": {
        "available": 8,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009669/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/29317",
                "name": "ACTS OF VENGEANCE CROSSOVERS OMNIBUS (Hardcover)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/29318",
                "name": "ACTS OF VENGEANCE CROSSOVERS OMNIBUS (DM Only) (Hardcover)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/38941",
                "name": "Fear Itself: The Deep (2011) #1"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/38942",
                "name": "Fear Itself: The Deep (2011) #2"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/38949",
                "name": "Fear Itself: The Deep (2011) #3"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/18779",
                "name": "Super-Villain Team-Up (1975) #1"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/18788",
                "name": "Super-Villain Team-Up (1975) #2"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/18789",
                "name": "Super-Villain Team-Up (1975) #3"
            }
        ],
        "returned": 8
    },
    "series": {
        "available": 4,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009669/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/9994",
                "name": "ACTS OF VENGEANCE CROSSOVERS OMNIBUS (2011)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/9995",
                "name": "ACTS OF VENGEANCE CROSSOVERS OMNIBUS (DM Only) (2011)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/14059",
                "name": "Fear Itself: The Deep (2011)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/3674",
                "name": "Super-Villain Team-Up (1975 - 1980)"
            }
        ],
        "returned": 4
    },
    "stories": {
        "available": 8,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009669/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/40222",
                "name": "Part Two:  Frenzy On a Floating Fortress",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/40241",
                "name": "In the Midst of Life...!",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/40243",
                "name": "If Vengeance Fails!",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/63788",
                "name": "Interior #63788",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/63790",
                "name": "Interior #63790",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/85445",
                "name": "Fear Itself: The Deep #1",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/85447",
                "name": "Cover #85447",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/85462",
                "name": "Interior #85462",
                "type": "interiorStory"
            }
        ],
        "returned": 8
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009669/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1009669/tiger_shark?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Tiger_Shark?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Todd Arliss",
        "identity": "Publicly known",
        "occupation": "Criminal; former professional swimmer",
        "place_of_birth": "",
        "groups": "[[Lethal Legion]]; formerly [[Offenders]], [[Masters of Evil]], [[Deep Six (heroes)|Deep Six]]; agent of [[Doctor Dorcas]], [[Llyra]]",
        "citizenship": "U.S.A.",
        "education": "Unrevealed",
        "aliases": "Aryls Tigershark",
        "relatives": "Diane Arliss (sister), Dr. Walter Newell ([[Stingray (Walter Newell)|Stingray]], brother-in-law), Tommy Newell (nephew), Lisa Newell (niece), Mara (wife, deceased)",
        "height": "6'1''",
        "weight": "450 lbs.",
        "eyes": "Grey",
        "hair": "Brown",
        "powers": "Arliss' body has been surgically and genetically altered to give him shark-like abilities. His augmented fish can withstand the pressure of the deep ocean and therefore other forms of damage. His skin is particuarly resistant against cold. He possesses superhuman strength and endurance and can swim up to 60 miles per hour. His fish-like gills enable him to breathe underwater, and his razor-sharp teeth can deliver powerful attacks. More recently, Tiger Shark’s body has mutated further into a monstrous form, heightening his superhuman strength and speed.",
        "abilities": "Todd Arliss is a championship swimmer and athlete.",
        "weapons": "None",
        "paraphernalia": "When out of water, Tiger Shark’s abilities and powers normally decline, but he wears a specially-designed \"hydro-suit\" equipped with a miniature system of pumps to circulate water around his body.",
        "debut": "Sub-Mariner #5 (1968)",
        "origin": "Sub-Mariner #5 (1968)",
        "significant_issues": "Gained superhuman powers, captured the throne of Atlantis, thwarted by Namor (Sub-Mariner #5-6, 1968); found powers diminishing, allied with Llyra, restored powers with Namor, killed Namor’s father who was used as hostage (Sub-Mariner #43-46, 1972); with Dorcas’s Aquanoids, tried to capture Namor and Spider-Man (Marvel Team-Up #14); with Attuma, tried to capture Namor but thwarted by Dr. Doom, captured by Namor (Super-Villain Team-Up #1 & 3); joined Egghead’s Masters of Evil (Avengers #222, 228-229); gave up the criminal life to marry Mara (Namor #34); joined Namor and Atlanteans against the Faceless Ones (Namor #35-40); joined the Altanteans against Xlyym (Namor #46-48); somehow mutated, appeared as member of Crimson Cowl’s Masters of Evil (Thunderbolts #3); cuffed to Armadillo, remanded by the New Warriors in their premiere episode (New Warriors #1, 2005); Joined forces with Red Hulk and others to become part of the Offenders (Hulk #10, 2009)",
        "main_image": "t_shar.jpg",
        "bio_text": "A champion Olympic swimmer, Todd Arliss earned nearly half million dollars in advances for public exhibitions, but his dreams came crashing down around him when he injured his back and legs while rescuing a man who had fallen overboard from a private craft. He was told that he would never be able to swim again, so he spent his fortune in seeking any kind of medical help. [[Doctor Dorcas|Dr. Lemuel Dorcas]] promised Arliss he could help, and, despite the pleas of his sister, Diane, Todd agreed. As part of the process, Dorcas hoped to use his \"morphotron,\" which could imprint the genetic pattern of an animal onto a human. In seeking tiger sharks to use on Todd Arliss, Dorcas accidentally captured the [[Sub-Mariner]] as well, and Namor’s genetic pattern was transformed as well as the sharks’, transforming Todd into a superhuman, amphibious creature.",
        "bio": "A champion Olympic swimmer, Todd Arliss earned nearly half million dollars in advances for public exhibitions, but his dreams came crashing down around him when he injured his back and legs while rescuing a man who had fallen overboard from a private craft. He was told that he would never be able to swim again, so he spent his fortune in seeking any kind of medical help. [[Doctor Dorcas|Dr. Lemuel Dorcas]] promised Arliss he could help, and, despite the pleas of his sister, Diane, Todd agreed. As part of the process, Dorcas hoped to use his \"morphotron,\" which could imprint the genetic pattern of an animal onto a human. In seeking tiger sharks to use on Todd Arliss, Dorcas accidentally captured the [[Sub-Mariner]] as well, and Namor’s genetic pattern was transformed as well as the sharks’, transforming Todd into a superhuman, amphibious creature. \n\nDorcas, a criminally-motivated marine biologist, gave Todd the costume and codename of Tiger Shark, hoping to use him in his own criminal ambitions. Tiger Shark,  however, had other ideas. Even though he was weak from the morphotron, he bested the Sub-Mariner and escaped for the open sea. Happening upon the Sub-Mariner's betrothed, the Lady [[Dorma]], the Shark accompanied her to [[Atlantis]], where he bullied his way into gaining the throne until Namor arrived and recaptured it, imprisoning Tiger Shark with the hopes of returning him to normal.\n\nTiger Shark escaped when Atlantis fell victim to the [[Serpent Crown]] and swam to the Sargasso Sea. There, he encountered the Mist-Men of Sargasso, a band of sailors and seamen from various cultures and time periods who were immortal prisoners of the area. Tiger Shark offered to lead them out of the area if they would serve him once they were free. The Sub-Mariner, however, found the mist-locked area and opposed the Shark once more. Tiger Shark escaped in the wake of the explosion of an experimental Nazi torpedo. Not long after, Tiger Shark again crossed paths with the Lady Dorma, who agreed to marry him if he would help save Atlantis from [[Orka]], another of Dr. Dorcas's creations, and the [[Atlanteans|Atlantean]] traitor [[Krang]]. The Shark fought valiantly against Orka and his battalion of killer whales. Locked in battle, both Tiger Shark and Orka were sucked under when a huge crevice opened in the ocean floor.\n\nEventually escaping, Tiger Shark discovered that his amphibious powers were diminishing. Hoping to capture Namor to recharge his powers, he first sought out Dr. Dorcas, but allied with the [[Lemuria|Lemurian]] empress [[Llyra]] and the scientist [[Lymondo]]. Llyra wished vengeance upon Namor for thwarting her ascent to the Atlantean throne. Tiger Shark wanted to use Lymondo's replica of the morphotron to siphon more of Namor's power into himself. Their first attempt to kidnap the Sub-Mariner failed when they kidnapped his ally, the [[Human Torch (Johnny Storm)|Human Torch]], sending their vessel to the sea bottom. Next, the three learned of and kidnapped the Sub-Mariner's human father, [[MacKenzie, Leonard|Leonard MacKenzie]]. Namor of course came to the rescue and was captured, placed into the morphotron and used to restore Tiger Shark's prowess. [[Stingray (Walter Newell)|Stingray]] also appeared, and in the ensuing struggle, Tiger Shark threw a lead pipe at Namor's father, killing him and providing the opportunity to escape. \n\nTiger Shark fled and hid out until he learned that Namor had experienced amnesia concerning the incident. Tiger Shark came out of hiding and was reunited with Dr. Dorcas. Dorcas created the Aquanoids, or \"Men-Fish,\" in a similar process used on Tiger Shark, and he and the Shark captured both the Sub-Mariner and [[Spider-Man (Peter Parker)|Spider-Man]], holding them prisoner in Dorcas’ undersea complex. Namor and Spider-Man escaped captivity, and, in battling the Aquanoids, Spider-Man accidentally triggered the destruction of the undersea base that forced all to flee. Later, they joined the undersea warlord [[Attuma]] and with Attuma's [[Octo-Meks]] war machines, captured the floating island [[Hydrobase]], taking Namor prisoner. [[Doctor Doom (Victor von Doom)|Doctor Doom]], who sought Namor as an ally, arrived and attacked Attuma and Tiger Shark, soon freeing the still-weakened Namor and taking him with him. Shortly thereafter, the vengeful Namor attacked Attuma, Dorcas, and Tiger Shark again. The Sub-Mariner hurled the defeated Tiger Shark at Dorcas, but Dorcas moved out of the way in time, and Tiger Shark's body struck an Octo-Mek, causing it to topple and crush him to death. The Sub-Mariner found Tiger Shark and turned him over to the local authorities.\n\nTiger Shark inevitably escaped and made for another try at Namor, this time kidnapping [[Namorita]]. He was confronted by [[Ms. Marvel (Carol Danvers)|Ms. Marvel]], who even pursued him beneath the waves where he was defeated by the two heroines and remanded to Atlantean custody.  The criminal [[Egghead]] rescued him, making him a member of his [[Masters of Evil]] and having him assist Egghead in his plan to totally destroy [[Pym, Henry|Hank Pym]]. Pym managed to turn the tables on all of the Masters, however, and they were taken into police custody. Some time later, Tiger Shark was again freed from prison, this time by [[Baron Zemo (Helmut)|Baron Zemo]], who wished the Shark to join his own Masters of Evil coalition. Tiger Shark helped the Masters occupy the [[Avengers]] mansion headquarters, but he left the group before the Masters' final showdown with the hero team. Tiger Shark was later seen in San Francisco, allied with [[Whirlwind]], another Master of Evil at large, but he was found by [[Tigra]] and [[Hellcat (Patricia Hellstrom)|Hellcat]] and given over to police custody.\n\nTiger Shark escaped from custody by lowering his body metabolism such as a shark might do, making it seem like he were dead. He was remanded to Stingray for recovery, where he escaped, battling him and kidnapping his sister, Stingray’s wife. Their final battle occurred in an undersea cavern, which threatened to cave-in during the fight. Tiger Shark’s humanity surfaced enough to help Stingray and his sister escape, and he was believed to have died as the cave collapsed. \n\nOn a later endeavor, the Shark was hired by the [[Kingpin]] to kill La [[Bandera]], a hero who was threatening his drug trade. He fought her and her ally, [[Wolverine (James Howlett)|Wolverine]], who savagely defeated the villain, leaving him to die by being eaten alive by sharks. Barely escaping with his life, Arliss wandered the seas for a while.\n\nHe eventually settled in a community of other underwater nomads, starting a new life as Arlys Tigershark. Tiger Shark fell in love with [[Mara]], and the two were married and soon expecting a child. Unfortunately, their peaceful life was not long to be. The [[Faceless Ones]] attacked their community, slaughtering them all, including Mara. He was helped to escape by [[Rahn, Tamara|Tamara Rahn]], and he joined Namor and the Atlanteans against the Faceless Ones, eventually stopping their threat. He retreated with Tamara to the Sargasso Sea, where he once again joined the People of the Mist as their protector. They once again returned, however, to ally with the Atlanteans, and soon the Fantastic Four, against the alien threat of [[Xlyym]].  Later still, they joined other undersea adventures in the short-lived team [[Deep Six (heroes)|Deep Six]], banding together for a rescue mission, hoping to save Namor from the Avengers. Namor rebuffed the attack, and Tiger Shark and Tamara left.  \n\nSomehow, at some point Tiger Shark mutated into a more monstrous form of a hybrid shark-man, appeared to have limited ability for speech and inhibition as well. In this form, he had somehow abandoned Tamara Rahn and reappeared on the surface world. He was invited to join the latest incarnation of the Masters of Evil, led by the current [[Crimson Cowl (Justine Hammer)|Crimson Cowl]]. Tiger Shark continued to be a part of nearly all major activities by the new Masters, running into conflict with the hero team [[Thunderbolts]], who eventually managed to bring the Masters to justice.\n\nTiger Shark has since returned to familiar endeavors. He joined another version of Deep Six that was formed this time by Attuma, who then ruled Atlantis and hoped to stop Namor and his allies, the [[Defenders]]. Instead, Namor managed to overthrow the warlord and reclaim the throne. Tiger Shark was later seen imprisoned at [[Big House|Pym Experimental Penitentiary Number One]], a prison that kept its super-powered inmates miniaturized, and participated in a breakout led by the [[Mad Thinker]] only to be thwarted by [[She-Hulk]]. He was also imprisoned on the [[Raft]], escaping during a massive breakout and avoiding capture by the new Avengers. He was instead apprehended by the [[New Warriors]], who managed to track him down and find him still cuffed to the [[Armadillo]].  \n\nRecently, the [[Red Hulk]] recruited Tiger Shark, along with [[Terrax]] and [[Baron Mordo]], to become part of the [[Offenders]] to take part in a death duel against the [[Hulk (Bruce Banner)|Hulk]] and the Defenders. Tiger Shark was pitted against his old foe, Namor, the Sub-Mariner, in the [[Dark Dimension]], but they were too evenly matched. Because the contest was a stalemate, the dread [[Dormammu]] was placed into the game by the [[Elders of the Universe]] who started it all. Dormammu seized the two intruders and demanded they tell him how they entered his world, so he may leave and conquer [[Earth]]. After the Red Hulk had triumphed in his contest with the Hulk, the [[Grandmaster]] inserted the red behemoth back into the game, and he slaughtered Terrax and the Silver Surfer after absorbing the [[Power Cosmic]]. Using the Surfer's board to travel to the Dark Dimension, Red Hulk murdered Tiger Shark, Namor and Dormammu. Later on, the Grandmaster revealed he had revived Tiger Shark and placed him back in his own time, with no memory of the event.",
        "categories": [
            "Avengers",
            "Villains"
        ]
    }
}