{
    "id": 1009475,
    "name": "Nomad",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/3/50/4c003d1875f38",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1009475",
    "comics": {
        "available": 12,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009475/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/16246",
                "name": "Cap Transport (2005) #7"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/1978",
                "name": "Captain America (2004) #7"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17886",
                "name": "Captain America Annual (1971) #9"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17875",
                "name": "Captain America Annual (1971) #10"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/36229",
                "name": "Captain America: Hail Hydra (2010) #1"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/3916",
                "name": "Captain America: Winter Soldier Vol. 1 (Trade Paperback)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/10055",
                "name": "Marvel Comics Presents (1988) #14"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/38066",
                "name": "Onslaught Unleashed (2010) #3"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/41567",
                "name": "ONSLAUGHT UNLEASHED HC (Hardcover)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/22203",
                "name": "Punisher War Journal (1988) #47"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/18331",
                "name": "What If? (1989) #3"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/12148",
                "name": "What If? (1977) #34"
            }
        ],
        "returned": 12
    },
    "series": {
        "available": 11,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009475/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2722",
                "name": "Cap Transport (2005 - 2006)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/832",
                "name": "Captain America (2004 - 2011)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/3629",
                "name": "Captain America Annual (1971 - 1991)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/12115",
                "name": "Captain America: Hail Hydra (2010 - 2011)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1612",
                "name": "Captain America: Winter Soldier Vol. 1 (2006)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2039",
                "name": "Marvel Comics Presents (1988 - 1995)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/13602",
                "name": "Onslaught Unleashed (2010 - 2011)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/15490",
                "name": "ONSLAUGHT UNLEASHED HC (2011)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/5860",
                "name": "Punisher War Journal (1988 - 1995)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2095",
                "name": "What If? (1977 - 1984)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/3648",
                "name": "What If? (1989 - 1998)"
            }
        ],
        "returned": 11
    },
    "stories": {
        "available": 13,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009475/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/4239",
                "name": "Cover: Captain America (2004) 1 of 1 - Nomad",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/4240",
                "name": "1 of 1 - Nomad",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/20763",
                "name": "What if Captain America chose to Remain Nomad?",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/22942",
                "name": "Angel In The Snow",
                "type": ""
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/34019",
                "name": "The Lonesome Death of Jack Monroe",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/38005",
                "name": "Worth Fighting For",
                "type": ""
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/38038",
                "name": "Walking the Line",
                "type": ""
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/39024",
                "name": "What if Steve Rogers had Refused to Give Up Being Captain America",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/49694",
                "name": "Dead Man's Hand Part IX",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/49695",
                "name": "Say Goodbye to Vegas (Dead Man's Hand Part IX)",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/80201",
                "name": "Captain America: Hail Hydra (2010) #1 cover",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/84264",
                "name": "Onslaught Unleashed (2010) #3",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/94039",
                "name": "ONSLAUGHT UNLEASHED HC",
                "type": "cover"
            }
        ],
        "returned": 13
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009475/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1009475/nomad?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Nomad_%28Jack_Monroe%29?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Jack Monroe",
        "aliases": "Bucky, Scourge",
        "identity": "(in 1950's) Secret, (current) publicly known",
        "occupation": "Adventurer, wanderer; former government agent, bagboy",
        "citizenship": "U.S.A.",
        "place_of_birth": "Clutier, Iowa",
        "relatives": "Edward Monroe (father, deceased), Mary Ellen Monroe (mother, deceased), [[Coltrain, Jill|Jill Coltrain]] (sister, deceased), Joanie (aunt, deceased), unnamed uncle (deceased)",
        "groups": "(Formerly) [[Secret Defenders]], the [[Captain's Unnamed Superhero Team]], agent of [[Gyrich, Henry Peter|Henry Gyrich]] and the [[Commission on Superhuman Activities]] former partner to [[Captain America (Steve Rogers)]], partner to [[Captain America (William Burnside)]], associate of [[Invaders]] and the [[V-Battalion]]",
        "education": "High-school dropout",
        "height": "5'11\"",
        "weight": "200 lbs.",
        "eyes": "Brown",
        "hair": "Brown",
        "powers": "By using a variation of the Super-Soldier formula, Monroe's strength, reflexes, and endurance are at peak human levels. He originally possessed superhuman strength prior to his treatment to cure his sanity.",
        "abilities": "Jack Monroe is an accomplished hand-to-hand fighter and martial artist.",
        "weapons": "As Nomad, Monroe wore detachable, six-inch diameter, steel alloy \"Stun Discs\" on his costume, which he could throw as weapons in order to stun opponents. He later took to using a double-barreled shotgun and once found a signature gun-- a portable self-guiding, user-interactive electric chain gun. Other weapons he used in the past included a 6-foot retractable quarterstaff.",
        "paraphernalia": "Nomad once took to using gimmick variations of his stun discs, such as discs containing a diamond-tipped glass cutter, a grappling hook and tether line, and various skeleton keys and lockpicks. During his initial wanderings around the country, Monroe used a pick-up truck equipped with an on-board computer with a DMV computer link, laser-guided gyroscopic navigation system, and a rear-mounted gattling gun. Later, his only method of transportation was by way of hitchhiking.",
        "debut": "Young Men #24 (1953)",
        "origin": "Captain America #155 (1972); Nomad vol. 2 #2 (1990); Nomad vol. 2 #18-19, #23-24 (1993, 1994)",
        "significant_issues": "With William Burnside, revived, fought Captain America (Captain America #153-156, 1972); released by S.H.I.E.L.D., became Captain America's partner as Nomad (Captain America #281-284, 1983); declared war on drug trade, informally adopted Bucky (Nomad vol. 1 #1-4, 1991); returned to suspended animation (Nomad vol. 2 #25, 1994); fought the Thunderbolts as Scourge, helped them against Henry Peter Gyrich (Thunderbolts #48-50, 2001); learned the Super-Soldier Serum was breaking down, was shot by the Winter Soldier (Captain America #7, 2005)",
        "main_image": "nomad.jpg",
        "bio_text": "Jack Monroe was born on December 7, 1941, Pearl Harbor Day. His father was an American stateside Nazi sympathizer who filled his basement with a collection of Nazi paraphernalia. When Monroe brought some of this collection to school, he came to the attention of FBI agents who used Monroe to gather information about his father. When the FBI later arrested Monroe's father, it was discovered the entire town was somehow involved. Jack and his little sister were taken from his hometown and raised in various foster homes across the country, with Jack settling into Naugatuck, Connecticut.",
        "bio": "Jack Monroe was born on December 7, 1941, Pearl Harbor Day. His father was an American stateside Nazi sympathizer who filled his basement with a collection of Nazi paraphernalia. When Monroe brought some of this collection to school, he came to the attention of FBI agents who used Monroe to gather information about his father. When the FBI later arrested Monroe's father, it was discovered the entire town was somehow involved. Jack and his little sister were taken from his hometown and raised in various foster homes across the country, with Jack settling into Naugatuck, Connecticut.\n\nMonroe had long been an admirer of [[Captain America (Steve Rogers)|Captain America]] and his partner [[Captain America (James Barnes)|Bucky]], an admiration that was fostered by the American government who hoped to groom Monroe into becoming a new Bucky for his generation. His foster parents were killed by Communist spies during the height of the Korean War, and after a brief time in the care of his alcoholic aunt, Monroe was placed in McMurtry's Foster Home and enrolled in Lee School for Boys in Connecticut. Monroe's history instructor shared his hero worship, and Monroe, who had since earned the nickname Bucky, became friends with his teacher through their mutual obsession. The government hoped that [[Captain America (William Burnside)|William Burnside]] (who changed his appearance and legal name to \"Steve Rogers\" to match that of the original Captain America), would become the next Captain America. After the Korean War, however, the government lost interest in this project, canceling its plans. So when a new villain calling himself the [[Red Skull (Albert Malik)|Red Skull]] appeared, Steve Rogers took it upon himself to inject himself and Jack with a variation of the Super-Soldier formula, becoming the new Captain America and Bucky. \n\nTogether, the heroes battled the Communist Red Skull and, later, other foes of America such as the U.N.-bombing teen idol [[Blayne, Chuck|Chuck Blayne]] and the mechanical beasts of the [[Cult of the Green Dragon]]. Unfortunately, the Super-Soldier serum was only part of the Super-Soldier program, and without treatment from \"vita-rays,\" Rogers' variation of the serum began to effect the heroes' sanity. They began preying upon those they suspected of being Communists. When the government learned of their indiscretions, FBI agents captured them, placing them in suspended animation in the hopes that someday they could be restored. \n\nThey were released when a disgruntled government employee sympathized with the two's hard-line stance on suspected Communists. The second Captain America and Bucky believed that the original Captain America was a fake, and they fought him and his partner the [[Falcon (Sam Wilson)|Falcon]]. When they were defeated, they were sent back into suspended animation.\n\n[[Doctor Faustus]], a psychologist, managed to gain custody of the two, transferring them to his mental institution which was actually a front for the criminal organization known as the [[Corporation]]. Dr. Faustus wanted to use them as test subjects for his mind-controlling gas. Faustus transformed William Burnside into the Grand Director of the fascist [[National Force]] and, as a test of loyalty, ordered him to shoot his former partner. The Grand Director did so, and although the gun was not loaded, was led to believe he killed Jack. The Grand Director and Faustus were defeated by Captain America and [[Daredevil (Matthew Murdock)|Daredevil]] as they brought down the National Force, and Jack Monroe was placed in the custody of [[S.H.I.E.L.D.]], where he was given special treatments to restore his sanity.\n\nRehabilitated, S.H.I.E.L.D. made Jack into Nomad, an identity once used by the original Captain America when he was briefly divorced from the American government and wanted an identity which did not have patriotic symbolism. They gave him a mission to infiltrate the headquarters of the [[Viper (Madame Hydra)|Viper]], hoping that the Nomad suit would unnerve the Viper since the original Nomad had defeated her once before. Nomad helped Captain America thwart the Viper's scheme, and Monroe decided to keep the identity of Nomad. He joined Captain America as a partner and apprentice, not knowing where else to go, but grateful for the friendship and tutelage in this new society.  \n\nDuring a period of time as a solo adventurer, he brought down the drug empire of the criminal [[Slug]], but he soon returned to join Captain America, at the time calling himself simply the Captain, and [[Captain's Unnamed Superhero Team|his allies]], Falcon and [[Demolition Man]], to oppose the [[Commission on Super-Human Activities]]. \n\nFollowing in Captain America's footsteps left something to be desired for Monroe. He was on a trail of a drug dealer that the law couldn't touch, and he realized the complexities of good and evil. He rescued an infant from a woman who was a prostitute and a drug addict. Determined to find his own style of crimefighting, Jack re-invented his costume and repertoire. He took it upon himself to raise the little girl, whom he named \"Bucky.\" When bringing down the drug dealer, Monroe was confronted by the dealer, Captain America and agents of the Commission, and both the American and Russian militaries. Monroe escaped, forced to kill many of his opponents. He then started wandering across the United States and Canada, fulfilling the name Nomad.\n\nDuring his travels, Monroe joined with a network of con-artists, petty thieves and prostitutes known as the Undergrounders. Monroe settled down for a short time in Los Angeles, confronting a number of adversaries such as [[U.S.Agent]], [[Deadpool]], the [[Punisher (Frank Castle)|Punisher]] and an evil [[Gambit (doppelganger)|doppelganger]] of the thief [[Gambit]], during that period. He and Bucky began wandering once more after surviving an intense city-wide riot. As he traveled, Monroe was forced to confront the realities of the homeless, AIDS, gay rights and hate spawned by ignorance.\n\nOne of Monroe's enemies, the criminal [[Epurer, Giscard|Giscard Epurer]], had located Bucky's mother, molding her into a killing machine in hopes that she would defeat Monroe for the possession of her daughter. When the two finally battled, Monroe reluctantly conceded that she was capable of taking care of both herself and Bucky and left them to start their life together.\n\nAfter an attempt on his life, Monroe tracked down whom he believed the culprit, Epurer. In fact, it was a childhood bully of Monroe, [[Ingrid, Bart|Bart Ingrid]], who had secretly revived the Nazi movement in their hometown and created a an underground militia camp. Epurer sent Monroe to neutralize the camp and rescue his covert operative, Bucky's mother. In the process, Monroe learned the truth about his parents and found his mother still alive. He finally confronted Ingrid's agent, the evil 88, who had killed Bucky's mother. By taking and reprogramming 88's gun, Monroe destroyed the camp and confronted Ingrid in Washington DC, where Ingrid hoped to topple America's government from the inside. Monroe killed Ingrid but set off the bomb Ingrid wanted to use to destroy the U.S. Senate. Monroe was believed to have died, and Bucky was taken in by Epurer, who felt responsible for the death of her mother and her erstwhile adopted father.\n\nIn fact, Monroe did not die, but was once more placed in suspended animation by the U.S. government. Years later, Monroe was awakened by [[Gyrich, Henry Peter|Henry Peter Gyrich]], head of the Commission on Super-Human Activities. Gyrich outfitted Monroe with the costume and identity of Scourge in reminiscence of the agents of the organization [[Scourge of the Underworld]], who would kill superhuman criminals. Monroe, as Scourge, was charged with the task to hunt down and eliminate the members of the team [[Thunderbolts]], former supervillains who once posed as heroes to take over the world but later aimed to become champions. In the course of his task, Monroe killed the Thunderbolts' [[Jolt (Hallie Takahama)|Jolt]], [[Baron Zemo (Helmut Zemo)|Baron Zemo]], and [[Fixer (Paul Norbert Ebersol)|Techno]]. Before he died, Techno resurrected Jolt so that she would confront Monroe, who immediately began to battle the Thunderbolts' [[Atlas (Erik Josten)|Atlas]]. Atlas' body was unstable, and he threatened to destroy the surrounding area. Monroe helped contain Atlas' destruction but in so doing appeared to have killed him as well.\n\nThe Thunderbolts tracked down and defeated Scourge, revealing him to be Monroe. They discovered that Monroe was actually being controlled by nanotech, microscopic probes that controlled his actions but allowed him to be aware of his actions. With the limited amount of free will afforded to him, Monroe tried to hunt down those Thunderbolts that seemed either unredeemable or easily resurrected. Monroe revealed the truth about Gyrich, that he hoped to use the destructive power of the nanoprobes to wipe out all superhumans on Earth. Freed of the nanoprobes with help of the Thunderbolts, Monroe allied with the team to confront Gyrich and his own team of superhumans, the [[Redeemers]]. The Thunderbolts ultimately discovered that Gyrich himself was being controlled by the nanoprobes, and they freed everyone from the thrall of the nanotech. Monroe, using the holographic disguise in his Scourge arsenal, disappeared during the denouement to once again wander the roads.\n\nMore recently, although he tried to continue being a crimefighter, the action left him weaker and weaker. Jack discovered that the Super-Soldier serum was finally and irrevocably breaking down and would eventually kill him. In the last stages of this process, as he grew physically weak, so did he mentally, often experiencing hallucinations and revisiting old memories. He checked up on the young infant he briefly raised, he found her living well and adopted into a family in Philadelphia as Julia Winter. Even so, Jack stumbled across a drug dealer around her school, and he took it upon himself to take down the drug ring, even if it meant it would be his last adventure. He fought what he thought were gangs and drug runners, but in fact, his insanity twisted his perception. His enemies were innocent bystanders, the initial drug pusher really an ice cream vendor. When exiting a bar one night, Jack was shot point-blank in the chest, a victim of the Winter Soldier who was hunting all those ever imbued with the Super-Soldier serum. It was later revealed that Winter Soldier was infact James Barnes the original Bucky who was brainwashed by the Soviet Union and used as an assassin after the World War II.",
        "categories": [
            "Deceased",
            "Golden Age",
            "Heroes"
        ]
    }
}