{
    "id": 1009711,
    "name": "Whiplash (Mark Scarlotti)",
    "description": "Filled with dreams of grandeur, Mark Scarlotti was a brilliant young man with a bright future who graduated with top honors from college and immediately had a promising job at Stark International, but it all went south, however, when he became friends with the wrong people who wanted him to develop weapons, which Scarlotti used to become the first Whiplash.",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/40/image_not_available",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1009711",
    "comics": {
        "available": 12,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009711/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/8496",
                "name": "Deadpool (1997) #40"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/19898",
                "name": "Iron Man (1998) #26"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/19900",
                "name": "Iron Man (1998) #28"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/19911",
                "name": "Iron Man (1998) #38"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/19930",
                "name": "Iron Man (1998) #55"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/9618",
                "name": "Iron Man (1968) #62"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/9533",
                "name": "Iron Man (1968) #285"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/2001",
                "name": "Marvel Masterworks: The Invincible Iron Man Vol. (Hardcover)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/11344",
                "name": "Tales of Suspense (1959) #97"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/11345",
                "name": "Tales of Suspense (1959) #98"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/16437",
                "name": "Tales of Suspsnse Transport (1959) #97"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/16438",
                "name": "Tales of Suspsnse Transport (1959) #98"
            }
        ],
        "returned": 12
    },
    "series": {
        "available": 6,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009711/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2005",
                "name": "Deadpool (1997 - 2002)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2572",
                "name": "Iron Man (1998 - 2004)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2029",
                "name": "Iron Man (1968 - 1996)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1494",
                "name": "Marvel Masterworks: The Invincible Iron Man Vol. (2005)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2079",
                "name": "Tales of Suspense (1959 - 1968)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2725",
                "name": "Tales of Suspsnse Transport (1959 - 1968)"
            }
        ],
        "returned": 6
    },
    "stories": {
        "available": 12,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009711/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/11988",
                "name": "Cover #11988",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/11993",
                "name": "The Warrior and the Whip!",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/19544",
                "name": "Carnage at Stark Enterprises!",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/19545",
                "name": "Ashes to Ashes",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/19717",
                "name": "Whiplash Returns!",
                "type": ""
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/34493",
                "name": "Cover #34493",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/34498",
                "name": "The Warrior and the Whip!",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/42657",
                "name": "The Mask in the Iron Man",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/42661",
                "name": "The Mask in the Iron Man Part Three: His Own Worst Enemy",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/42685",
                "name": "Remote Control [Part 2]",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/42730",
                "name": "Iron Man Gallery",
                "type": "pinup"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/66406",
                "name": "Deadpool (1997) #40",
                "type": "cover"
            }
        ],
        "returned": 12
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009711/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1009711/whiplash_mark_scarlotti?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Whiplash_%28Mark_Scarlotti%29?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Mark Scarlotti",
        "identity": "Known",
        "aliases": "Blacklash, Mark Scott",
        "occupation": "Former agent of Trevor Donohue, Justin Hammer, weapons designer and agent of the Maggia, head of research for Stark International Cincinnati",
        "place_of_birth": "Cleveland, Ohio",
        "groups": "Formerly worked for the [[Maggia]], [[Death Squad]], Justin Hammer’s B-Team",
        "citizenship": "U.S.A.",
        "education": "College degree in engineering",
        "relatives": "Anthony Scarlotti (father), Barbara Scarlotti (mother), Trudi Scarlotti (wife, deceased), unidentified son (in foster care)",
        "height": "6’1”",
        "weight": "215 lbs.",
        "eyes": "Blue",
        "hair": "Blond",
        "powers": "None",
        "abilities": "Mark Scarlotti was a brilliant engineer and weapons designer that had expert fighting skills with a whip and nunchakus. He was also a moderate hand-to-hand combatant.",
        "weapons": "Whiplash designed two cybernetically controlled whips that could be converted into nunchakus or vaulting poles. The whips could be spun so fast that they could even blow Spider-Man’s webbing away from Scarlotti preventing him from being ensnared. As both Whiplash and Blacklash, Scarlotti used a necro-lash which could be electrically charged by his gauntlets, released from its handle to deliver a concussion charge, or he could turn up the electric charge to its maximum which caused anything it hit, including Iron Man’s armor, to become brittle. He also used anti-gravity bolas, heavy gravity bolas, and various other devices also of his own design. When Mark returned to his original alias of Whiplash, he also upgraded his armaments with a kinetic whip, a cat-o-nine-tails, and a whip made of super conductive filament in order to channel lightning as an offensive weapon.",
        "paraphernalia": "Scarlotti wore a costume made of steel mesh that could absorb a bullet’s impact or the force from a punch from Iron Man. Later on in his criminal career, Whiplash used a flying platform and jet discs for both transportation and mid-air combat. He also had a cybernetic flying harness equipped with extra arms enabling him to wield half a dozen whips at one time.",
        "debut": "Tales of Suspense #97 (1968)",
        "origin": "Unrevealed",
        "significant_issues": "Tales of Suspense #97-99, Iron Man and Sub-Mariner #1, Iron Man #1, Iron Man #62, Iron Man #72, Marvel Team-Up #72, Iron Man #123-124, Iron Man #126-127, Iron Man #146-147 (as Blacklash), Marvel Two-In-One #96, Marvel Team-Up #145, Captain America #319, Iron Man #223-224, Iron Man #239-240, Amazing Spider-Man #319, Elektra #5-7, Iron Man #8 (1998, returns to Whiplash), Iron Man #26, Iron Man #28 (killed by sentient Iron Man armor)",
        "main_image": "Whiplash_(Mark_Scarlotti)_org.jpg",
        "bio_text": "",
        "bio": "Mark Scarlotti was a brilliant young man with a bright future. Graduating with top honors from college and a promising job at Stark International, Scarlotti could have had it all. It all went south, however, when he became friends with the wrong people. Filled with dreams of grandeur, he made some bad deals with hopes of a big payoff. Eventually, Mark worked developing weapons, first for the [[Maggia]], then for himself. He took a more active role in their activities and became the costumed criminal known as Whiplash. His first real test put him up against the invincible [[Iron Man (Anthony Stark)|Iron Man]], but Whiplash could not complete the task of eliminating him. Suffering defeat after defeat at the hands of his armored foe, Scarlotti upgraded his weaponry and took a new alias. He remerged on the crime scene with a new attitude and called himself Blacklash. His appearance might have changed, but his track record did not. The defeat, he recalled, as being the most humiliating was when Iron Man brought his body back to the Maggia, and they wrote him off on the spot. Mark Scarlotti went back to his home town with thoughts of giving up his criminal career and making a new life for himself.\n\nAttending an Electronics and Engineering Convention in Cleveland, Ohio, Mark Scarlotti was hoping to make some contacts or land a legitimate job, but his publicly known criminal identity prevented that from happening. Angered that he couldn’t catch a break he went to visit his parents at their bakery, but his father disowned him and his mother had to turn her back on him.  [[Image:Blacklash _(Scarlotti).jpg|left|180px|thumb|Scarlotti as Blacklash]] Even at the local hang out Mark was nothing but a big joke. His only friend was his high school buddy, Rusty, who became a police officer. The locals didn’t want him, his parents were ashamed of him, and his criminal record would never have allowed for a life he would accept. It was no surprise that Mark made a deal with the Maggia again when they were in need of his services. Scarlotti was to assassinate a scientist at the convention, but the timely arrival of [[Rhodes, James|Jim Rhodes]] as Iron Man and [[Spider-Man (Peter Parker)|Spider-Man]] allowed the target to escape. Scarlotti held his own for a while, but was ultimately defeated and carted off to prison. Once again the mob dropped him, his mother refused to have anything to do with him ever again, and Mark had dreams of turning over a new leaf.\n\nUnfortunately for Mark, his lack of patience and bad temper often got the best of him, and soon he was back in his Blacklash costume. This time he was an operative for [[Hammer, Justin|Justin Hammer]], another rival of Tony Stark. Hammer called on Scarlotti for various reasons even if he had to turn him against another Hammer employee. One such situation happened when the [[Scorpion (Mac Gargan)|Scorpion]] double-crossed Hammer. The Scorpion received upgraded weaponry in exchange for abducting an army General. Scorpion changed his mind and wanted to trade the General for one of his enemies, [[J. Jonah Jameson]] instead of delivering the package to his employer. Justin Hammer sent Blacklash and the [[Rhino]] after his rogue agent which led to a confrontation with Spider-Man. In the end, Rhino and Blacklash fulfilled their mission by retrieving the upgraded costume leaving the Scorpion and Spider-Man behind.\n\nWhen an ancient being called the [[Architect (alien)|Architect]] was looking for an assassin to kill him, he called upon Blacklash and many others to converge on New York to compete against one another. Scarlotti, now back in Ohio and married with a son, continued to have a difficult time accepting the life he was forced to live. Still looking for a way to make some real money, he decided to take one last job and traveled to New York. Upon his arrival in a run down hotel, he was ambushed by the assassin called [[Bullet]] and had to be hospitalized. Scarlotti called his wife, Trudi, confessed that he was up to his old ways, and asked her to come to New York so that he could do this one last job and put his life of crime behind them. She did as he said and went to the hospital he was laid up in. Mark asked her to go to his hotel and pick up his Blacklash costume because he didn’t want to be ambushed again. She hesitantly agreed. [[Image:Blacklash _Elektra.jpg|left|150px|thumb|Consoled by Elektra after the death of his wife]]Scarlotti didn’t know it yet, but his life was about to change in the worst way imaginable. Once inside Mark’s hotel room, Trudi was surprised by an assassin called [[Shatter-head]]. He was the last person she ever saw. Scarlotti went back to his hotel worried sick why Trudi hadn’t returned to the hospital yet, and he found her body along with a taunting Bullet who described the torment Shatter-head put her through. Bullet didn’t stand a chance as Scarlotti put him down for the count. Meanwhile, Shatter-head found himself another target in [[Elektra]], but he didn’t get to land one punch. Blacklash had hunted him down and attacked him from behind snapping Shatter-head’s neck with his whip. Now face-to face with Elektra, Scarlotti broke down in tears as he grieved for his wife. Elektra let him live and Scarlotti left New York.\n\n\nTony Stark, now back from another dimension with other absent heroes after the battle with [[Onslaught (entity)|Onslaught]], was tracking a mystery man that had been haunting him since his return, and his search led him to France. This unknown antagonist was one step ahead and hired an old foe of Stark’s. Mark Scarlotti was back with a new costume, new weapons, but with his old moniker. Whiplash had returned, even more ruthless, and determined to bury his past as Blacklash forever. Whiplash clashed with Iron Man briefly, but left after he told Iron Man that he was hired to kill Stark and not his bodyguard. Whiplash returned to help Iron Man bring in the New Year with a little murder and mayhem. During a fireworks display, Whiplash attacked an unsuspecting Iron Man once more. The two fought and Whiplash had the advantage until one of his whips got struck by lightning, and the resulting explosion knocked both of them unconscious. Whiplash returned once more with a cybernetic battle harness that allowed him to wield a half a dozen whips at one time. However, sometime after the last brawl between him and Iron Man, Iron Man’s armor became sentient and was faster and more efficient than before. Whiplash couldn’t even lay a hand on Iron Man this time, and the armor remembered Scarlotti’s last assault on them. Once Iron Man got a hold of Whiplash, the armor proceeded to viciously beat him despite the protests of the man inside it. Whiplash tried to tell his foe that he was only doing this to get his son back since he was taken away from him, and he couldn’t even see him anymore. Whiplash did everything he could to stop the thrashing even to the extent of telling Iron Man who it was that hired him, a man named Trevor Donohue. The armor continued to pound Whiplash until he was no longer moving. Iron Man’s armor inadvertently killed Mark Scarlotti, but didn’t show any remorse once it realized what it had done. The armor left the area dropping Whiplash into the river below.",
        "categories": [
            "Villains",
            "Deceased"
        ]
    }
}