{
    "id": 1009740,
    "name": "Arnim Zola",
    "description": "The frail, dwarfish Arnim Zola was born in 1930s Switzerland where he became the world's leading biochemist and genetic engineer.",
    "modified": "2012-03-20T12:33:28-0400",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/8/b0/4c00393a4cb7c",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1009740",
    "comics": {
        "available": 6,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009740/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/5402",
                "name": "Captain America (2004) #24"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/7589",
                "name": "Captain America (1968) #208"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/7590",
                "name": "Captain America (1968) #209"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/5372",
                "name": "Captain America and the Falcon: The Swine (Trade Paperback)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/13537",
                "name": "Civil War: Captain America (Trade Paperback)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/23500",
                "name": "X-51 (1999) #12"
            }
        ],
        "returned": 6
    },
    "series": {
        "available": 5,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009740/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1996",
                "name": "Captain America (1968 - 1996)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/832",
                "name": "Captain America (2004 - 2011)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1707",
                "name": "Captain America and the Falcon: The Swine (2006)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2256",
                "name": "Civil War: Captain America (2007)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/6688",
                "name": "X-51 (1999 - 2000)"
            }
        ],
        "returned": 5
    },
    "stories": {
        "available": 5,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009740/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/4276",
                "name": "3 of 3 - Civil War",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/7702",
                "name": "2 of 6 - Death of the Dream",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/17672",
                "name": "The River of Death!",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/17674",
                "name": "Arnim Zola--The Bio-Fanatic!!",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/52136",
                "name": "Space Odyssey",
                "type": "interiorStory"
            }
        ],
        "returned": 5
    },
    "events": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009740/events",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/events/238",
                "name": "Civil War"
            }
        ],
        "returned": 1
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1009740/arnim_zola?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Zola,_Arnim?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Arnim Zola",
        "identity": "No dual identity",
        "occupation": "Criminal; scientist",
        "place_of_birth": "Weisshorn Mountain, Switzerland",
        "groups": "Former agent of the [[Nazi Party]] and the [[Red Skull (Johann Shmidt)|Red Skull]]; leader of the [[Corpse Corp]], [[Primus]], [[Doughboy]], personal physician to [[Hate-Monger (Adolf Hitler)|Adolf Hitler]]",
        "citizenship": "Switzerland",
        "education": "Advanced degree in 1930’s sciences",
        "aliases": "Bio-Fanatic",
        "relatives": "Unrevealed",
        "height": "5’10”",
        "weight": "200 lbs",
        "eyes": "Brown",
        "hair": "None",
        "abilities": "Advanced scientific abilities in the fields of genetics, chemistry, biology",
        "weapons": "Various high-tech weapons of his own creation.",
        "paraphernalia": "In place of a head stands his ESP box, capable of controlling his creations, emitting powerful psionic blasts, animating inorganic material, or transferring Zola's consciousness to an available android body. The latter fact makes Zola virtually immortal. Zola also uses androids and other genetically engineered lackeys in his schemes. He can control these lackeys via his ESP box or a special prod.",
        "powers": "All of Arnim Zola's powers are derived from his equipment. Zola houses his consciousness in an android body, complete with a television-like image of this face on his chest.",
        "debut": "Captain America #208",
        "origin": "",
        "significant_issues": "",
        "main_image": "Zola.jpg",
        "bio_text": "The frail, dwarfish Arnim Zola was born in 1930’s Switzerland where he became the world’s leading biochemist. In his ancestral castle, Zola happened upon mysterious papers brought by his ancestors in the Crusades. These documents originated from [[Deviants]] and contained secrets of genetic engineering that far surpassed even today’s level of technology. Zola used the secrets to become the world’s first public genetic engineer, perhaps preceded only by Nathaniel Essex, [[Mister Sinister]].",
        "bio": "The frail, dwarfish Arnim Zola was born in 1930’s Switzerland where he became the world’s leading biochemist. In his ancestral castle, Zola happened upon mysterious papers brought by his ancestors in the Crusades. These documents originated from [[Deviants]] and contained secrets of genetic engineering that far surpassed even today’s level of technology. Zola used the secrets to become the world’s first public genetic engineer, perhaps preceded only by Nathaniel Essex, [[Mister Sinister]].  \n\nNeeding funds to continue his research, Zola presented his first invention, the creation of device that would transfer someone’s essence to a cloned body, to Adolf Hitler, who agreed to become his patron. This device and partnership allowed Hitler to survive World War II as the [[Hate-Monger (Adolf Hitler)|Hate-Monger]]. Zola also used it on himself, not only allowing him to survive into modern times but to also replace his normally frail body with a stronger, android one.   \n\nZola also found a patron in the [[Red Skull (Johann Shmidt)|Red Skull]], but otherwise he kept his existence a secret, performing experiments in a hidden fortress in the jungles of Central America. [[Captain America (Steve Rogers)|Captain America]], on the trail of the Red Skull, managed to find Zola’s hidden laboratories, only to be captured by the first of Zola’s intelligent creations, [[Primus]] and [[Doughboy]]. Captain America escaped, but Zola later used Doughboy and Primus to capture Captain America and the woman Donna Maria Puentes, who he wished to use for genetic experimentation. He was overthrown, however, by Primus, who fell in love with Donna Maria. Captain America used the distraction to battle Zola, a fight that destroyed Zola's castle and forced them all to flee. \n\nZola’s continued partnership with the Red Skull led to a the creation of a [[Cosmic Cube]], although it merely served as a containment vessel and the essence of the Hate-Monger became trapped inside at the same time [[S.H.I.E.L.D.]] stormed the site and destroyed the villain’s lair. At one point, Zola created a cloned body of Captain America for the Red Skull, which the Skull used to rejuvenate himself after his body died of old age. \n\nAt some point, however, Zola severed ties with the Skull to embark on his own agenda of experimentation and villainy. Although he prefers to work alone and in secret, Zola has been known to take on others as assistants, such as he did with Edward Whelan (although Whelan would object to Zola’s use of human test subjects and became a victim himself, becoming [[Vermin]]). \n\nWhen working on his own, it is usually for the pure fascination of genetic research, no matter how cruel or unusual his means. One time, Zola assembled several wolf-related heroes and villains, which included [[Jameson, John|John Jameson]]’s reversion to his Man-Wolf identity. When Captain America tracked Jameson, he was briefly captured by Zola and transformed into a wolfman himself, although he escaped and managed to destroy Zola’s schemes and rescue Jameson and the other victims. Another time, Zola purchased refugees of the city-wide rampage caused by [[Onslaught (entity)|Onslaught]] from the [[Rat Pack]], and he subjected them to hideous experiments. One of his victims, [[Jolt (Hallie Takahama)|Jolt]], escaped to find the [[Thunderbolts]], who returned to defeat Zola.\n\nZola is also not above working with new patrons, such as the [[Secret Empire]]. During that alliance, the Empire used Zola to find individuals with a genetic makeup that could be transformed and made into an army of dissidents with which to take over the world. Such an individual was Charcoal, although the Empire was stumbled onto by the Thunderbolts who managed to bring down the subversive Empire.\n\nMore recently, Captain America and his ally Thor (actually, [[Thunderstrike|Erik Masterson]] in the guise of Thor) tried to infiltrate one of the Red Skull's safehouses, and Zola used Doughboy to try to capture the two. Masterson used his hammer to destroy Doughboy, and Zola escaped. However, Zola re-created Doughboy to be used as his vehicle of transportation when capturing the then-ruler of Madripoor, the [[Viper (Madame Hydra)|Viper]], which brought Zola into conflict with [[Wolverine (James Howlett)|Wolverine]] and [[Cable]]. The heroes battled Primus and others of Zola's creation until they were unceremoniously dropped from Doughboy and Zola, the Viper, and his creations escaped. \n\nZola continued working with Hydra until he was in a position to kill Madame Hydra, and replace most of Hydra with his clones. He went after Stark Industries technology to improve his own, using a computer virus to trap Tony Stark's mind on the internet, and waging war against Stark Industries and S.H.I.E.L.D. Zola's clones, mostly of Happy Hogan, and 8 of Madame Hydra were eventually suppressed shortly after the S.H.I.E.L.D. Strike team destroyed Zola's Facility and his reserve bodies. Zola himself was taken into the upper atmosphere and suffocated at the hands of Iron Man, but digital copies of Zola existed after, and possibly more reserve bodies.",
        "categories": [
            " Villains",
            " Golden Age",
            " International",
            " Thunderbolts"
        ]
    }
}