{
    "id": 1009242,
    "name": "Malcolm Colcord",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/40/image_not_available",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1009242",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009242/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009242/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009242/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009242/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1009242/malcolm_colcord?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Colcord,_Malcolm?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Malcolm Colcord",
        "identity": "No dual identity",
        "occupation": "Government program director; former office worker, soldier",
        "place_of_birth": "Unrevealed",
        "groups": "Formerly [[Weapon X]]",
        "citizenship": "Canada",
        "education": "Military training",
        "aliases": "The Director",
        "relatives": "Kathleen Colcord (ex-wife), Susan \"Suzie\" Colcord (daughter), James \"Jimmy\" Colcord (son)",
        "height": "",
        "weight": "",
        "eyes": "Brown",
        "hair": "Black",
        "powers": "None",
        "abilities": "",
        "weapons": "None",
        "paraphernalia": "None",
        "debut": "(in shadow) Wolverine #160 (2001); (fully) Wolverine #166 (2001)",
        "origin": "Weapon X #1 (2002); Weapon X #23 (2004)",
        "significant_issues": "",
        "main_image": "Director.jpg",
        "bio_text": "Malcolm Colcord was a young soldier whose first assignment was to the Canadian government's [[Weapon X]] research facility. Only two weeks into his duty, the mutant [[Wolverine (James Howlett)|Wolverine]], a captive of the program, broke out, killing most of the people around him. Malcolm found that he survived the attack, although he was severely disfigured with scars across his face.",
        "bio": "Malcolm Colcord was a young soldier whose first assignment was to the Canadian government's [[Weapon X]] research facility. Only two weeks into his duty, the mutant [[Wolverine (James Howlett)|Wolverine]], a captive of the program, broke out, killing most of the people around him. Malcolm found that he survived the attack, although he was severely disfigured with scars across his face.\n\nAssigned to a desk job, Malcolm continued to serve his government, but he believed himself a joke in his government office, ridiculed and forced to work in a back office. Still, he dared to propose the renewal of one of the most controversial military projects ever, the Weapon X program, promising to use mutants for mankind's benefit, even if that meant performing deadly missions and interning mutant captives. As the Director for the new program, he oversaw the recruitment of many villainous mutants, including [[Sauron]], [[Mesmero]], [[Agent Zero]], and [[Marrow]], and eventually, [[Sabretooth]] and [[Aurora]]. Within months, the Director helped create an internment camp for mutants, dubbed [[Neverland]], using mutants as hunters for the victims and in keeping the mutants imprisoned.\n\nAurora had often tried to seduce the Director for her own purposes. However, an encounter with Sabretooth left her disfigured and injured, and it was only with the Director's financial and emotional support that she recovered, albeit scarred like him. Aurora began to have genuine feelings for the Director, although he refused to reciprocate.\n\nWhen the Director's ex-wife was to be remarried, the Director took Sabretooth, conditioned to be under his mental control, with him to confront her. The Director was about to kill his ex-wife, but his children stumbled onto the confrontation. Initially afraid that his scarred complexion would horrify them, the children reached out for their father. The Director allowed his ex-wife to live, forbidding her to ever be with another man, to which she reluctantly conceded. The Director bade Sabretooth to capture her fiancé and return with them to the Weapon X program.\n\nAfterwards, unable to deny another urge, the Director entered Aurora's bedroom, and the two kindled their romantic relationship. Soon, Aurora urged the Director to have surgery, and he had his scars removed. However, agent [[Jackson, Brent|Brent Jackson]], who hoped to stage a coup against the Director, confronted the Director with the idea that he was a \"mutie lover\" due to do his relationship. Too preoccupied with the idea, the Director lashed out at Aurora, beating her unconscious. Afterward, however, he apologized, explaining his conflicting feelings, and Aurora reluctantly accepted.\n\nSoon, the Weapon X program was discovered by the mutant soldier-of-fortune, [[Cable]]. Cable organized a group of mutants, dubbed the [[Underground]], for investigating the program. He was joined by Weapon X agent Brent Jackson, who hoped to stage a coup against the Director and had formed his own resistance group with fellow agents.\n\nThe Underground was able to infiltrate the Weapon X complex, ousting the Director and nearly crippling the program. The Director was nearly killed by turncoat agent Washout, and as he contemplated his escape, Colcord flew into a rage, blaming his loss of control over his recent obsession with his new face and with Aurora. Taking shards of glass, Colcord disfigured himself once more. He was rescued by [[Jeffries, Madison|Madison Jeffries]] and, with Colcord urging Aurora, the three escaped the Weapon X complex using Aurora's superhuman speed. Agent Jackson betrayed the Underground, taking credit for saving the program and was named the new Director of the Weapon X program by its mysterious benefactors.\n\nSoon after, Aurora sought to revenge herself on Colcord but was opposed by Jeffries. Recuperating at the abandoned original Weapon X facility, Colcord tasked Jeffries with creating a Sentinel army for him with which to resume his war on mutantkind.",
        "categories": [
            "People",
            "Villains",
            "International",
            "Canadians"
        ]
    }
}