{
    "id": 1009225,
    "name": "Captain Stacy",
    "description": "NYPD Captain George Stacy was the father of one-time Peter Parker girlfriend Gwen Stacy.",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/2/a0/4c00407752be2",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1009225",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009225/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009225/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009225/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009225/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1009225/captain_stacy?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Stacy%2C_George?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "George Stacy",
        "identity": "Public",
        "occupation": "Retired; former NYPD captain",
        "place_of_birth": "Unrevealed, presumably New York City",
        "groups": "None",
        "citizenship": "U.S.A.",
        "education": "College educated",
        "aliases": "None",
        "relatives": "Helen Stacy (wife, deceased), [[Stacy, Gwen|Gwen Stacy]] (daughter, deceased), Arthur Stacy (brother), Nancy Stacy (sister-in-law), Paul Stacy (nephew), [[Gray Goblin (Gabriel Stacy)|Gabriel]] and Sarah Stacy (grandchildren), Gwen Stacy clones (genetic daughters)",
        "height": "6'1\"",
        "weight": "190 lbs.",
        "eyes": "Blue",
        "hair": "Gray",
        "powers": "None",
        "weapons": "None",
        "paraphernalia": "None",
        "abilities": "Captain Stacy was an excellent policeman who rose to the highest levels",
        "debut": "Amazing Spider-Man #56 (1968)",
        "origin": "Unrevealed",
        "significant_issues": "In younger years as a detective, with brother Arthur, investigated Osborn Industries for disappearance of Nels Van Adder (Proto-Goblin) (Peter Parker: Spider-Man -1, 1997); aided John Jameson to recover the Nullifier (Amazing Spider-Man #56, 1968); interviewed Peter Parker, showed Parker his personal investigation into Spider-Man, mesmerized by Dr. Winkler's camera at the Gloom Room-A-Go-Go (Amazing Spider-Man #60, held captive by the Kingpin, rescued by Spider-Man and Norman Osborn (Amazing Spider-Man #61, 1968); rescued by Spider-Man during jailbreak (Amazing Spider-Man #65, 1968); attacked by Shocker for table (Amazing Spider-Man #72, 1969); present when feverish Peter Parker admitted to being Spider-Man (Amazing Spider-Man #87, 1970); died protecting an innocent child during Spider-Man's battle with Dr. Octopus (Amazing Spider-Man #90, 1970)",
        "main_image": "CaptStacy.jpg",
        "bio_text": "Little did [[Spider-Man (Peter Parker)|Peter Parker]] know, after falling in love with Empire State University classmate Gwen Stacy, that her father was one of the most respected former police officers in the NYPD, Captain George Stacy. But even in retirement, Captain Stacy kept up with the happenings at the department - and had taken a keen interest in Spider-Man.",
        "bio": "Little did [[Spider-Man (Peter Parker)|Peter Parker]] know, after falling in love with Empire State University classmate Gwen Stacy, that her father was one of the most respected former police officers in the NYPD, Captain George Stacy. But even in retirement, Captain Stacy kept up with the happenings at the department - and had taken a keen interest in Spider-Man.\n\nIt wasn't long before [[Jameson, John|John Jameson]] called Captain Stacy out of retirement to assist in the return of a device called the Nullifier - which could render any electrical or mechanical apparatus inoperative - that [[Doctor Octopus (Otto Octavius)|Doctor Octopus]] had tricked an amnesiac [[Spider-Man (Peter Parker)|Spider-Man]] into stealing. \n\nAfter safely securing the weapon, Captain Stacy interviewed Peter Parker, believed to have been held captive with Doctor Octopus and Spider-Man. After the interview, Captain Stacy revealed to Peter that he had spent time studying the career of Spider-Man, and that he was glad to have met Peter, known for photographing the wall-crawler on numerous occasions.\n\nIdentifying himself as a strong supporter of Spider-Man, Captain Stacy wished to see the wall-crawler redeemed in the public eye. He also took an instant liking to Peter, and openly encouraged the growing bond between the youngster and his daughter, [[Stacy, Gwen|Gwen]]. Shortly thereafter at a dance club which employed [[Watson-Parker, Mary Jane|Mary Jane Watson]], Captain Stacy was put under a hypnotic trance through a rigged camera operated by Mary Jane who took photos of him unaware that her actions were aiding the [[Kingpin (Wilson Fisk)|Kingpin of Crime, Wilson Fisk]]. Stacy was compelled into a backroom where he underwent additional brainwashing by the camera's inventor, Dr. Winkler. Despite Spider-Man's efforts, George returned programmed to follow the Kingpin's directions. As such, Captain Stacy later stole police records for the Kingpin while Spider-Man's automatic camera captured the theft. Peter Parker gave the photos to J. Jonah Jameson, hopeful that this apparent betrayal of the Stacy family would actually help expedite a discovery of the captain's innocence. While George and Gwen attempted to flee, they were kidnapped by the Kingpin's men and held captive at one of [[Green Goblin (Norman Osborn)|Norman Osborn]]'s labs where Dr. Winkler worked. The Kingpin intended to eliminate the Stacys once they were used to lure Spider-Man into his crushing hands. While Spider-Man battled the Kingpin, Osborn arrived and tackled on the the Kingpin's henchmen holding the Stacy's at gunpoint. Though the Kingpin fled, and Winkler was apparently killed, the Stacy's were rescued. Osborn's testimony to the police exonerated Captain Stacy. \n\nCaptain Stacy started to suspect the two were one. After a feverish Peter admitted to being Spider-Man before his friends including Captain Stacy, Parker asking the Prowler to imitate Spider-Man so Peter and the web-slinger could be seen together. Captain Stacy could not be fooled. Called into action one night, Captain Stacy watched Spider-Man battle Doctor Octopus on a rooftop high above the city. A crowd had gathered nearby to watch the confrontation. As the two fought fiercely, chunks of concrete began to dislodge from the roof and rain on the spectators below. Spotting a child standing under the falling masonry, Captain Stacy leapt to cover the boy - and paid for his act of heroism with his own life. Abandoning the fight, Spider-Man swung down in time to hear Captain Stacy's final words, \"Be good to her, son! Be good to her. She loves you so very much.\"",
        "categories": [
            "people",
            "Spider-Man"
        ]
    }
}