{
    "id": 1009517,
    "name": "Punisher 2099",
    "description": "",
    "modified": "2014-03-05T13:43:05-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/c/a0/53176fef7fa1c",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1009517",
    "comics": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009517/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/1570",
                "name": "Marvel Knights 2099 (Trade Paperback)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/1401",
                "name": "Punisher 2099 (2004) #1"
            }
        ],
        "returned": 2
    },
    "series": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009517/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1368",
                "name": "Marvel Knights 2099 (2005)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/821",
                "name": "Punisher 2099 (2004)"
            }
        ],
        "returned": 2
    },
    "stories": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009517/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/4180",
                "name": "Interior #4180",
                "type": "interiorStory"
            }
        ],
        "returned": 1
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009517/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1009517/punisher_2099?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Punisher_2099_%28Jake_Gallows%29?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel 2099 (Earth-928)]]",
        "real_name": "Jacob Gallows",
        "aliases": "None",
        "identity": "Public",
        "occupation": "Ex-Public Eye Officer, Ex-Head of Shield",
        "citizenship": "Citizen of the United States of America",
        "place_of_birth": "New York",
        "relatives": "Baldur Gallows (brother, deceased), Astra (brother's fiancée, deceased)",
        "groups": "Public Eye, Shield",
        "education": "Public Eye training",
        "height": "Unrevealed",
        "weight": "Unrevealed",
        "eyes": "Blue",
        "hair": "Black",
        "powers": "None",
        "abilities": "Trained with weapons and martial arts as a Public Eye officer.",
        "weapons": "The Punisher typically uses .54 Magnum Smith and Wesson, 2015 antique, .48 Caliber Stark Fujikawa Street Pacifier, Grenazers, Adjustable Density Power Bat, Mean Mule turbo kick boots, Plasma Gas Cannon, Vibro-Knux Flesh-Shredding Knuckle Dusters, Heat Haze Anti-Personnel Dart Missiles, Plas-steel Armor-Penetrating Wrist Crossbow, Ceramic Telescoping Machete, and Auto targetting Shurikens shaped as skulls.",
        "paraphernalia": "He is also equipped with High Density Heat Sink Plasto-Armor with Energy accumulators which reduce the impact of lasers or physical force on his body, an Exo-muscular Undersuit which allows him to mimic any known martial arts or adapt to the combat of others to the point of increasing his reflexes to metahuman levels, a cybernetic hand to replace the one cut off, a face scrambler that shows any video recordings a digital skull, and finally a Mirage-Effect Hologram Image Inverter that physically disguises his face as anything he chooses, including a metal skull or the face of any of a number of people, as well as duplicating their irises for identification.",
        "debut": "Punisher (2099) #1",
        "origin": "Punisher (2099) #1",
        "significant_issues": "Punisher (2099) #1 (origin/intro), Punisher (2099) #34.",
        "main_image": "Punisher(JakeGallows)_Head.jpg",
        "bio_text": "Jake Gallows was a dedicated Weapons Specialist in the Public Eye police force in the year 2099 when street thugs, with a distaste for happy families, murdered his.  When his family's killer, Kron Stone, got off in court by paying a fine, because his father was the head of Alchemax, Tyler Stone, Jake got fed up with a society that only protected citizens who paid their dues to the police, and where the rich “black carders” could simply buy their way out of justice.  Taking up the challenge of the 20th Century’s [[Punisher (Frank Castle)|Punisher]], as written in the dead vigilante’s diary, Jake Gallows decided to continue his fight against all crime as the 2099’s Punisher.",
        "bio": "Jake Gallows was a dedicated Weapons Specialist in the Public Eye police force in the year 2099 when street thugs, with a distaste for happy families, murdered his.  When his family's killer, Kron Stone, got off in court by paying a fine, because his father was the head of Alchemax, Tyler Stone, Jake got fed up with a society that only protected citizens who paid their dues to the police, and where the rich “black carders” could simply buy their way out of justice.  Taking up the challenge of the 20th Century’s [[Punisher (Frank Castle)|Punisher]], as written in the dead vigilante’s diary, Jake Gallows decided to continue his fight against all crime as the 2099’s Punisher.\n\nHe immediately revenged himself upon Kron using a low-tech knife to stab the killer through his expensive energy shield.  The new Punisher then began his war on crime with the aid of fellow Public Eye employee [[Axel, Matt (2099)|Matt Axel]]; along with a collection of antique and high-tech weapons his fallen brother had collected with him.  With Axel’s help he set up his family’s brownstone with a scanning system which is able to search through police and corporate files, as well as a fully equipped prison system to replace the jails that had gone out of use in the year 2099.  He even included a Molecular Disintegrator to bring back capital punishment.\n\nWhile still working as a Public Eye officer, Jake Gallows fought criminals as night, and pretended to be a well-adjusted police officer during the day.  This act eventually brought him to the attention of the Public Eye’s psych-officer, Kerry Dowenn.  On her first visit to his house she interrupted him in the middle of a jailbreak, but he manipulated her into believing he was distraught only on the inside.  Only later, when she felt obligated to resign for her mistake, did he reveal to her that he was the Punisher, and they began an affair.\n\nAt the same time, a group known as the Cyber Nostra launched an attack on the Decred Barrio, during a parade to honor the 20th Century’s heroes.  Though the leader of the Decreds, dressed as Barrio Man, refused to fight off the Cyber Nostra, the Punisher showed up and defended them by killing most of the Cyber Nostra, except for the cyborg Multi Fractor.  Before the Nostra could come after him, the Punisher tracked them down and killed Multi Fractor in a fight by overloading his cyber driver.  The Punisher soon discovered a link between the Cyber Nostra and Alchemax when he found the criminal group cleaning up Alchemax’s genetic experiments.  He eventually uncovered an experimental facility that used degens as lab subjects, and destroyed it, leading the subjects to a sanctuary that Axel created.\n\nIn response to the threat of the Punisher, the head of the Cyber Nostra, the [[Fearmaster (2099)|Fearmaster]], found and attacked Kerry at her apartment.  He caught her about to erase proof of the Punisher’s identity and threatened to kill her using his powered hand that aliens had gifted to him.  In the end she refused to give up Jake Gallows identity and he used his powers to turn her into solid glass.  \n\nWhen the Punisher found her he lost complete control, treating criminals harsher and executing them in groups.  He murdered a kid named Sky Boy, a member of a group called the [[Young Blades (2099)|Young Blades]], who rode bladed anti-gravity boards and would cut I.D. implants out of innocent drivers in order to pay for name brand fashionable clothes.  Shortly afterwards he ran into Maxine Sanos, called [[Blue Max (2099)|Blue Max]], the head of the Young Blades.  But before he could shoot her she threw herself off a building and seemingly died rather than let him kill her.  Later she appeared alive, competing in a yearly tournament to decide who would ride Blue Dagger, her personal sword blade.  The Punisher competed in the tournament himself, trying to discredit Blue Max, but in the end she beat him by a few feet, and he was forced to give her up when the crowd of innocents surrounded him.\n\nAs Jake Gallows, the Punisher was warned of a hijack plot surrounding a massive flying ship called Skyliner.  When the Punisher responded to the call he found a group called Wire-Heads, literal adrenaline/pain junkies, who drove the ship into a cloud farm operated by the Synthia Food Corporation, which sends out bacteria to grow on radiation and be picked up to make hamburgers.  Before he destroyed the terrorists and saved the Skyliner, the Punisher discovered that the hijackers were hired by Alchemax to discredit Stark-Fujikawa.\n\nWhen a being called [[Avatarr (2099)|Avatarr]] created a floating city called Valhalla, and nano-engineered a group of super heroes in order to fight the city’s vigilante heroes, the Punisher, as Jake Gallows, was assigned to look over the city’s security.  He ran into the man beast known as [[Ravage (2099)|Ravage]], and after a fight that was interrupted by the security forces, he slipped away.  Soon he was invited to join a group consisting of Ravage and 2099’s [[Spider-Man (2099)|Spider-Man]] and [[Doom (2099)|Doctor Doom]].  Together they destroyed the created heroes and the Punisher distracted the engineered Thor when he recognized him as his family’s Thorite priest, and used Thor’s hammer to shutdown the city before it crushed New York.\n\nAfter being nearly destroyed, the cyborg Multi Fractor was rebuilt with one ape arm and one mechanical claw arm, becoming 2099’s [[Jigsaw (2099)|Jigsaw]].  He lured the Punisher into a fight, but the Punisher froze him using a grenade, and locked him up in his prison.  But when the Punisher came back to execute him, the Fearmaster and his Cyber Nostra goons ambushed him.  They put the Punisher in his own Molecular Disintegrator and cut off his hand in order to operate it, but it still backfired, blowing Jigsaw out of the building.  The Fearmaster attacked the Punisher using the newly enhanced strength of his powered hand, but he escaped through the wall rather than continue the fight.  Soon the Punisher hunted down the Fearmaster himself, equipped with a cybernetic hand, and was able to turn the Fearmaster’s own hand against him, turning him into clay, when the Fearmaster's alien lord, [[Kelmizadek (2099)|Kelmizadek]] abandoned him.\n\nWhile the Punisher’s personality began to fracture into two distinct personalities, the violent Punisher, and the rational Jake Gallows, he faced a man named [[Red Dog|Saber Hagen]], a former byproduct of Alchemax’s Red Dog experiments and a friend of Matt Axel.  Saber Hagen went on a spree, killing crowds of innocents, and calling himself Public Enemy.  The Punisher fought him, but let an angry crowd murder him, and returned home to kill Axel, thinking him a traitor.  But Jake Gallow’s personality took over in time and he let Axel live, though Axel quit as the Punisher’s partner in response.\n\nDue to a new law giving androids extensive rights, the Public Eye force gave Jake Gallows a new mechanical partner named [[Goldheart (2099)|Goldheart]] that turned out to be killing gang members in order to rebuild himself in solid gold to feel more human.  After Jake revealed himself as the Punisher, Goldheart tried to commit suicide by throwing himself in front of an attacking police force rather than kill them, but instead Jake took out his CPU and installed it into his Stinger bike.\n\nA new female Punisher showed up later, calling herself [[Punisher 2099 (Vendetta)|Vendetta]] and following the male Punisher’s MO, but with more vicious, tortuous attacks.  She soon came up against the other Punisher at an installation created to upload the minds of rich people into Decred’s bodies.  They worked together to kill one of the customers and shut down the organization, killing a man who used to own Vendetta in the process.  After a fight the police showed up and shot her, and the Punisher took her back to his headquarters.  When she told him that she intended to replace him, he showed her his prisons and his death chair, and she opted out, returning to her own mission against the people that built and used her.\n\nThe Punisher’s next villain was his own estranged son, an ex-Marine who was accidentally transported through a holophone beam and came out of the other end as a semi-solid being able to shoot energy beams from his hands.  When his son tried to break into his house via his holophone, and then into his bank account, the Punisher confronted him.  He recognized him as his son, now calling himself [[Hotwire (2099)|Hotwire]], but too late to stop him or reconcile with him before he made an abrupt escape through the holophone lines.\n\nA strange entity calling himself [[Synchron (2099)|Synchron]], the Strange Attractor, attacked New York by creating quantum coincidences, which caused the deaths of five innocent people through bizarre circumstances.  He soon attacked the Punisher, as well, who came after him.  Though before they faced each other, another being calling himself [[Synchron2 (2099)|Synchron2]], the Synner, an alternate reality version of Synchron, appeared to the Punisher and announced that he would be the one to right the thrown-off balance to the universe.  Before the second Synchron left, the Punisher was given a view of the Punisher Two, his alternate reality version, who headed the Punishment Squad and married the actress, Kerry Dowenn.  Then, using Synchron’s coincidences against him, the Punisher killed him.\n\nSoon a villain named [[Manitou (2099)|Manitou]] showed up, along with a cyborg dog named [[Palug (2099)|Palug]], which he sent out to kill people and attract the media, allowing him to transmit hypnotic messages to the city which caused them to act out their slightest whims.  The Punisher was also affected, and began to kill indiscriminately, before Goldheart, as his bike, brought him to Matt, who had joined back up with him, to fix the Punisher.  The Punisher came back to stop Manitou, finding out that he needed the death energies of all his victims to become a god in the afterlife, and so he dragged Manitou to an Alchemax particle accelerator and shot bullets through him at light speed to destroy all of him, even his soul.\n\nWhen Doom became President of America he dismantled the Public Eye force and set up a new Shield force, making Jake Gallows, whom he knew as the Punisher, the head.  Then, using an elite group known as the Punishment squad, Jake took punishment to extremes, going as far as persecuting people for their very thoughts.  This eventually forced Doom to turn on him, as well as pitting Matt against him again, who then rebuilt Goldheart as a new robot Punisher.\n\nWhile Doom planned to discredit Jake through a woman named Officer Saffron, Jake took a recruit by the name of Cadet Wong and fought his way through Shield troopers and the Punisher robot, at the same time that Doom’s Environmental Maintenance Platforms began to fall from the sky, tearing New York apart.  Then Jake used Wong and his ex-friend Axel to get him shot into space in a rocket.\n\nThe Punisher broke out of his stasis above a cargo ship, and after a fight with the crew he was ejected into space at the same time that an immense ship made into a gun, and piloted by Vendetta, blew up the cargo ship.  Using a plasma turret, the Punisher was able to jet himself to the massive space weapon, and after a confrontation with Vendetta, they decided to join together and use the space-based gun as an effective weapon of global punishment.",
        "categories": [
            "Marvel_2099"
        ]
    }
}