{
    "id": 1009525,
    "name": "Valeria Richards",
    "description": "",
    "modified": "2011-10-27T09:58:06-0400",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/3/60/4d541255f088a",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1009525",
    "comics": {
        "available": 5,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009525/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/39019",
                "name": "Amazing Spider-Man (1999) #658"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/38716",
                "name": "Amazing Spider-Man (1999) #658 (THOR HOLLYWOOD VARIANT)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/39018",
                "name": "Amazing Spider-Man (1999) #659"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/35505",
                "name": "Amazing Spider-Man (1999) #660"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/35509",
                "name": "Amazing Spider-Man (1999) #673"
            }
        ],
        "returned": 5
    },
    "series": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009525/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/454",
                "name": "Amazing Spider-Man (1999 - 2013)"
            }
        ],
        "returned": 1
    },
    "stories": {
        "available": 6,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009525/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/78516",
                "name": "Amazing Spider-Man (1999) #660 - Int",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/85001",
                "name": "Amazing Spider-Man (1999) #658, THOR HOLLYWOOD VARIANT",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/88566",
                "name": "AMAZING SPIDER-MAN (1999) #659",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/88567",
                "name": "AMAZING SPIDER-MAN (1999) #659 - Int",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/88569",
                "name": "AMAZING SPIDER-MAN (1999) #658 - Int",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/95451",
                "name": "Amazing Spider-Man (1999) #673",
                "type": "cover"
            }
        ],
        "returned": 6
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009525/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1009525/valeria_richards?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Richards%2C_Valeria?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Valeria Meghan Richards",
        "identity": "(Marvel Girl) Publicly known, although few on Earth-616 realized her true relationship to the Richards; (infant Valeria) no dual identity",
        "occupation": "None",
        "place_of_birth": "(Marvel Girl) unknown; (infant Valeria) Baxter Building, New York City, NY",
        "groups": "None",
        "citizenship": "U.S.A.",
        "education": "(Marvel Girl) Extensive college level schooling, probably through private tutoring; (infant Valeria) none",
        "aliases": "Valeria von Doom, Marvel Girl",
        "relatives": "Reed Richards ([[Mister Fantastic]], father), Susan Richards ([[Invisible Woman]], mother), [[Richards, Franklin|Franklin Richards]] (brother), [[Richards, Nathaniel|Nathaniel Richards]] (grandfather), [[Storm, Franklin|Franklin Storm]] (grandfather, deceased), Evelyn Richards, Mary Storm (grandmothers, deceased), Major John Richards (great-grandfather), Jonathan Storm ([[Human Torch (Johnny Storm)|Human Torch]], uncle), Tara Richards ([[Huntara]], aunt), unnamed Richards male (uncle), [[Doctor Doom (Kristoff Vernard)|Kristoff Vernard]] (alleged uncle), Marygay Jewel Dinkins (maternal great-aunt); Victor von Doom ([[Doctor Doom (Victor von Doom)|Doom]], alternate future father), Susan von Doom (Baroness von Doom, alternate future mother), Franklin Richards (\"Sparky\", alternate future stepbrother); [[Kang]], his counterparts, and relatives (common ancestry)",
        "height": "(Marvel Girl) 5'4\"; (infant Valeria) 2'2\"",
        "weight": "(Marvel Girl) 105 lbs.; (infant) 16 lbs.",
        "eyes": "Blue",
        "hair": "Blonde",
        "powers": "Marvel Girl could turn invisible, generate force fields, and \"time dance,\" teleporting back in time and through space. She claimed she could block Franklin's reality-manipulating powers. She was able to stun the She-Hulk with a punch and send her flying, but whether this denoted a use of her force field, innate superhuman strength, or a power granted by her armor, was unclear. The infant Valeria has served as magical familiar for Dr.  Doom. A potential future version of Valeria could render herself and others invisible to all forms of electromagnetic detection.",
        "paraphernalia": "Marvel Girl owned a flying board that responded to verbal commands, as well as armor which could be swapped for street clothes at will and which presumably had other, unspecified properties.",
        "abilities": "Valeria possesses an intellect on a par with her father.",
        "debut": "(Marvel Girl) Fantastic Four #15 (1999); (infant Valeria) Fantastic Four #50 (2002)",
        "creators": "this has not been updated yet",
        "main_image": "Valeria 2.jpg",
        "bio_text": "",
        "bio": "Valeria Richards, the second child of [[Mister Fantastic]] and the [[Invisible Woman]], had a difficult and circuitous entry into the world. Conceived in the [[Negative Zone]], when the unborn infant approached term she began to emit bursts of deadly radiation that threatened both mother and child. Despite bringing in fellow scientists and radiation experts [[Hulk (Bruce Banner)|Bruce Banner]], [[Morbius|Michael Morbius]], [[Sasquatch (Walter Langkowski)|Walter Langkowski]], and [[Doctor Octopus (Otto Octavius)|Otto Octavius]], Reed Richards was unable to save his daughter, who appeared to be stillborn. \n\nAppearances can be deceiving. [[Richards, Franklin|Franklin Richards]], the couple's first child, felt a deep loss over the sister he would have had; unconsciously guided by Omniversal Guardian [[Roma]], he secretly used his vast psionic powers to travel back in time and save his sister, taking her from her native reality (Earth-616) and sending her \"someplace else\" - an alternate future where she was raised by another Invisible Woman who had married a heroic Doctor Doom after the death of her first husband. It's unclear whether this timeline's Invisible Woman somehow gave birth to Valeria, or if she was delivered to her new family as a newborn infant; whatever the case, they raised her as their own, and she grew up considering Dr. Doom to be her father. Roma, who had her own plans for the child, apparently kept a watchful eye on Valeria, ensuring her well-being.\n\n[[image:ValeriaRichards02.jpg|thumb|left|180px]]Among Valeria's friends as she grew up were Caledonia, a member of Roma's interdimensional Corps and of this future's Fantastic Four, and [[Lancer]], her father's mutant bodyguard; her stepbrother, whom she nicknamed Sparky, would annoy their mother by using his powers to go \"time-dancing\". As she grew older and her powers and adventurous streak began to emerge, Dr. Doom designed armor for her protection, and she took on the title \"Marvel Girl\". When she was twelve, she was formally invested as Doom's heir in the throne room of the Baxter Building; not long after this, her father and her uncles the Thing (Benjamin Grimm) and Human Torch (Johnny Storm)) died saving the world. Subsequently, while visiting the [[Glossary:B#Blue_Area_of_The_Moon|Blue Area of the Moon]] to see Alicia Masters’ memorial statue for the fallen heroes, both Valeria and Franklin briefly communicated with a temporally displaced echo of Earth-616’s [[Mister Fantastic]], [[Thing (Benjamin Grimm)|Thing]] and [[Human Torch (Johnny Storm)|Human Torch]]. \n\n\nWhen the [[Fantastic Four]] of Earth-616 were in Paris, Valeria \"time-danced\" (apparently accidentally) into the modern-day [[Pier Four]], encountering the younger Franklin and his babysitters Caledonia and Alyssa Moy. When the interdimensional hunter [[Bounty (humanoid)|Bounty]] attacked, seeking to arrest Caledonia, Valeria immediately came to Caledonia's aid; but the battle was interrupted by the arrival of the Bacchäe, warrior women working for the Amazon Hippolyta. Wanting to pay back the Fantastic Four for an earlier encounter, the Bacchäe kidnapped everyone present and took them to face their mistress and her lord, the Olympian god Pluto. Caledonia dueled with the Amazonian queen, while Marvel Girl tried to lead everyone else to safety; when[[Image:V_richards.jpg|left|thumb|220px]]\n\nCaledonia defeated his champion, the vengeful [[Pluto]] sent her to Tartarus. Marvel Girl and the others pursued, using the teleportation abilities of Franklin's pet, Puppy, arriving in the Olympian underworld after a side trip to the Asgardian Hel and an encounter with Hela. They freed Caledonia and together battled past the combined forces of Tartarus, until Marvel Girl confronted Pluto himself and demanded he let them go in peace. Though not initially inclined to do so, the Lord of Hades changed his tune when the Fantastic Four arrived, accompanied by [[Hercules]] and [[Persephone]], Pluto's wife.\n\nAt first Susan Richards found it difficult to accept Valeria; the implication she would one day marry Doom shook her, and Valeria's presence brought back painful memories of the child Sue believed had died. Hearing her \"mother\" reject her, Valeria ran away. She roamed the streets for several hours, eventually stumbling upon the [[Absorbing Man]], [[Titania]], and a mind-controlled [[She-Hulk]] battling the police. Marvel Girl tried to stop them single-handedly, but was outmatched by the combined might of her opponents. When the Thing and Bounty arrived, they too were swiftly placed under mind-control; arriving to see Valeria in peril, the Invisible Woman accepted her daughter and dealt painful retribution to her attackers. Valeria helped Reed identify the microbial nanites which had been used to brainwash their friends, and the search for a cure brought the group into conflict with the [[Mad Thinker]], whose carefully laid plans were disrupted because he had not factored in Marvel Girl's presence. Later, after a magical attack left Alyssa Moy in a coma, Valeria was instrumental in identifying Selene and the [[Hellfire Club]] as being linked to the assault. She, Franklin and Caledonia were next used as hostages by another magical foe, [[Jihad]], to make the Fantastic Four go on a quest to recover four mystic items for him. \n\nAn impending Chaos Wave heralded the return of Dr. Doom from Counter-Earth and led to Valeria confronting this evil, younger version of the man she considered her father; however, when events conspired to trap Reed Richards within Doom's armor while Doom was apparently killed, it began to look like Valeria's future was coming true, but that Richards was her true father. For their own safety, Valeria and Franklin were sent under the care of Caledonia to Haven, a school for gifted children on the other side of the universe; in their absence, Richards was freed from Doom's armor, while Doom himself was found to have survived, once more calling into question Valeria's future timeline.\n\n[[image:ValeriaRichards01.jpg|thumb|right|170px]]The two children returned from Haven shortly before the arrival of [[Abraxas]], a cosmic being who sought the Ultimate Nullifier and dominion over the multiverse; while the Fantastic Four sought the Nullifier in other realities, Abraxas targeted Valeria as a temporal anomaly. Franklin and Roma whisked her away, but Abraxas soon tracked them down, seemingly killing Roma and taking the Nullifier. As Abraxas appeared about to claim victory, Roma's plan came to fruition; Franklin and Valeria combined their powers to resurrect [[Galactus]], the one being who could seize the Nullifier from Abraxas. Galactus gave the device to Mr. Fantastic, who activated it, obliterating Abraxas and resetting reality. This depleted Franklin's cosmic powers, and Valeria reverted to an unborn child within Sue's womb.\n\nSue soon came to term, but her life was again threatened by bursts of radiation from the child within her. With Mr. Fantastic captured by the Hidden Ones, the Human Torch desperately sought the aid of Dr. Doom; Doom successfully used a combination of science and sorcery to safely deliver the infant, and in return was allowed to name her. He chose Valeria, after his childhood love, but even at this juncture, love was far from Doom's mind. Holding the newborn in his arms, he took the opportunity to weave an enchantment, turning Valeria into his familiar, enabling him to see through her eyes and use her as a focus for spell casting. A few months later, after he sacrificed Valeria's namesake in return for greater magical abilities, Doom launched an assault. As Franklin was literally sent to Hell, Valeria spoke her first word: \"Doom\". The villain taunted his foes through the young girl's mouth, and when the FF flew to [[Latveria]] to confront him, he easily overcame them, teleporting Valeria into his arms. With the assistance of [[Doctor Strange (Stephen Strange)|Doctor Strange]], Reed eventually managed to turn the tables and recover his children, leaving Doom trapped in Hell and his link to Valeria hopefully broken. Life returned to normal...as normal as it can be for a child whose parents are superhuman adventurers and whose Inhuman babysitters live on the Moon. Whether anything of the teenage Marvel Girl remains within the infant Valeria, or whether Doom might still hold some sway over her, only time will tell.",
        "categories": [
            "Heroes",
            "Women",
            "Fantastic Four",
            "Magic"
        ]
    }
}