{
    "id": 1009627,
    "name": "Stilt-Man (Wibur Day)",
    "description": "Wilbur Day was a scientist at Kaxton Labs who stole designs for a hydraulic ramming device from his company out of frustration of his position in his job.",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/f0/4c003ac98d3ce",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1009627",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009627/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009627/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009627/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009627/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1009627/stilt-man_wibur_day?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Stilt-Man_(Wilbur_Day)?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Wilbur Day",
        "aliases": "None",
        "identity": "Publicly known",
        "occupation": "Former criminal, scientist, inventor",
        "citizenship": "U.S.A.",
        "place_of_birth": "Unrevealed",
        "relatives": "Zelda DuBois (Princess Python, ex-wife)",
        "groups": "Formerly [[Emissaries of Evil]]; formerly partner of the [[Owl]] and [[Gladiator (Melvin Potter)|Gladiator]], [[Copperhead]]",
        "education": "Ph.D.",
        "height": "5'6\" without suit",
        "weight": "150 lbs.",
        "eyes": "Blue",
        "hair": "Gray",
        "powers": "None",
        "abilities": "Day is a competant, although perhaps not genius, engineer and inventor.",
        "weapons": "Day often uses a gun capable of producing a potent stun gas. He has also used gas grenades, an electrified exterior for his suit, and various conventional weaponry.",
        "paraphernalia": "Stilt-Man's suit increases his strength 10 times more than normal (able to press up to 1500 lbs.), and his telescopic legs are usually used as battering rams, able to stretch up to 250' and to walk up to 30 miles per hour. His legs are also coated with a silicone compound that Spider-Man's webbing won't stick to.",
        "debut": "Daredevil #8 (1965)",
        "origin": "Daredevil #8 (1965)",
        "significant_issues": "",
        "main_image": "Stilt.jpg",
        "bio_text": "Wilbur Day was a scientist at Kaxton Labs who stole designs for a hydraulic ramming device from his company out of frustration of his position in his job. He soon invented a battlesuit and tried his hand at petty villainy-- looting stores and robbing pedestrians. Later on, he tried suing the company, with [[Daredevil (Matthew Murdock)|Matt Murdock]] as his attorney, claiming legal ownership of Kaxton's original design and going so far as to accuse Kaxton of being the Stilt-Man. Eventually, Day was discovered to actually be Stilt-Man. Day, wearing the stilts but not the rest of his armored suit, used an experimental molecular condenser gun, based on another idea of Kaxton's, to attempt to eliminate Daredevil. But in battling Daredevil, Day himself was struck by the molecular condenser's ray and shrank seemingly into nothingness.",
        "bio": "Wilbur Day was a scientist at Kaxton Labs who stole designs for a hydraulic ramming device from his company out of frustration of his position in his job. He soon invented a battlesuit and tried his hand at petty villainy-- looting stores and robbing pedestrians. Later on, he tried suing the company, with [[Daredevil (Matthew Murdock)|Matt Murdock]] as his attorney, claiming legal ownership of Kaxton's original design and going so far as to accuse Kaxton of being the Stilt-Man. Eventually, Day was discovered to actually be Stilt-Man. Day, wearing the stilts but not the rest of his armored suit, used an experimental molecular condenser gun, based on another idea of Kaxton's, to attempt to eliminate Daredevil. But in battling Daredevil, Day himself was struck by the molecular condenser's ray and shrank seemingly into nothingness. \n\nIn fact, when the ray had condensed his matter to a certain point, Day was transported into a limbo-like \"[[Glossary:M#microverse|microverse]]\". Months later, Day and his stilts reappeared on Earth at their full size.\n\nConstantly re-modifying and improving upon his original stilts and the rest of his battlesuit, the Stilt-Man has fought against the likes of Daredevil, [[Spider-Man (Peter Parker)|Spider-Man]], and [[Captain America (Steve Rogers)|Captain America]]. When given a special duplicate of his suit forged from secondary adamantium by [[Blastaar]], the Stilt-Man even dared to challenge the thunder god [[Thor (Thor Odinson)|Thor]]. After Thor defeated the Stilt-Man, Day's Adamantium suit was confiscated and melted down. Day later recovered his own modified Stilt-Man battlesuit.\n\nSubsequently, an incompetent small-time hood named Turk stole Day's Stilt-Man suit. Turk began using the Stilt-Man suit himself, but Day told Daredevil how to defeat Turk by manipulating the gyroscopes that keep the battlesuit balanced. Turk proved inept at manipulating the stilts, bungled an attempt to kidnap Manhattan Assistant District Attorney Maxine Lavender, and was caught by Daredevil.\n\nDay decided that after this humiliating episode, he had to do something dramatic to regain his reputation as a formidable criminal. Day broke into a Cordco factory and used its automated devices to construct an improved battlesuit within a remarkably short time. Spider-Man learned of the break-in and tackled the Stilt-Man. But when Spider-Man saw that a sonic disruptor Day had activated was about to blast Day himself, Spider-Man took the blast himself to save Day's life. Moved by Spider-Man's sacrifice for an enemy, the Stilt-Man gratefully took the unconscious crimefighter to safety, and then left the factory.\n\nThe Stilt-Man has often returned to crime, only to be defeated time and again. He once joined fellow villains [[Owl]] and [[Gladiator (Melvin Potter)|Gladiator]] in an attempt to form a formidable team to take over the operations of the [[Kingpin]], but were defeated by Spider-Man and Daredevil when they were betrayed by their teammate [[Copperhead]] to a demonic entity.\n\nThe Kingpin's wife, [[Fisk, Vanessa|Vanessa Fisk]], offered Day a portion of the criminal empire once owned by the Kingpin, as the crime lord was believed to have died at the time. Day controlled the portion only briefly, as the Owl tried to capture the empire for his own and Day became convinced he should give up his costumed identity and life of crime. He hoped to confess to Matt Murdock, whose secret identity of Daredevil was leaked to the world, but Murdock denied any knowledge of who Day was, and Day left.\n\nMost recently, [[Punisher]] killed Stilt-Man amidst the Civil War Saga.  At the wake, [[Punisher]] poisened all in attendance while disguised as a bartender.",
        "categories": [
            "Villains",
            "Marvel Knights",
            "Spider-Man",
            "Deceased",
            "Civil War"
        ]
    }
}