{
    "id": 1009741,
    "name": "Zombie (Simon_Garth)",
    "description": "War hero Simon Garth was turned into a zombie by his secretary, Layla, who was also a voodoo priestess, after being killed by his gardener, Gyps.",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/6/10/4c003937c9ba4",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1009741",
    "comics": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009741/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/22118",
                "name": "Strange Tales (1998) #1"
            }
        ],
        "returned": 1
    },
    "series": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009741/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/5850",
                "name": "Strange Tales (1998)"
            }
        ],
        "returned": 1
    },
    "stories": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009741/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/49770",
                "name": "",
                "type": "recap"
            }
        ],
        "returned": 1
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009741/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1009741/zombie_simon_garth?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Zombie_(Simon_Garth)?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Simon William Garth",
        "identity": "Most believe Simon Garth to be deceased",
        "occupation": "Former president and founder of Garwood Industries",
        "place_of_birth": "Birmingham, Alabama",
        "groups": "Servant of those who wield the Amulets of [[Dam-Ayido|Damballah]]",
        "citizenship": "U.S.A. (legally dead)",
        "education": "Unrevealed",
        "aliases": "Formerly the Coffee King of New Orleans",
        "relatives": "Donna Garth Mason (daughter), Bruce Mason (son-in-law), Miranda Garth (ex-wife)",
        "height": "6'4\"",
        "weight": "220 lbs.",
        "eyes": "White (formerly brown)",
        "hair": "Black",
        "powers": "As a zombie empowered by loa (voodoo spirit), Garth has enhanced strength and regenerative abilities, feels no physical pain, and does not need to eat or breathe; his yellow coarse, decaying body has a foul odor. The use of a \"voodoo doll\" can cause him severe agony. He cannot smell, taste, or feel; his vision and hearing are magical senses. Perhaps due to Layla's spell, his spirit never fully left his body, so he occasionally acts on his own and even speaks (albeit rarely). There is no evidence that he consumes human flesh to maintain his existence.",
        "paraphernalia": "Garth is usually completely controlled by whoever holds the twin Amulet of Damballah to the one he wears. Only once, when he was asked to threaten his own daughter, did Garth manage to resist direct orders from the Amulet-holder.",
        "debut": "Menace #5 (1953)",
        "creators": "this has not been updated yet",
        "main_image": "zombiedd.jpg",
        "bio_text": "Though magic users on [[Earth]] have reanimated the dead using various means for thousands to millions of years, the Voodoo god [[Sagbata]] (Baron Samedi) and the Elder God [[Chthon]] combined forces in the 17th century to create a potent spell, and most subsequent practitioners have tapped into their magic to create zombies; however, the best known zombie, Simon Garth, is strangely atypical. War hero Simon Garth was senior partner for 25 years to Brian Stockwood in Garwood Industries, maker of leading Garth Manor Coffee. Divorced after assaulting his wife Miranda, Garth raised their daughter, Donna, to adulthood in New Orleans, Louisiana. The controlling Garth violently berated and fired his gardener Gyps for lusting after Donna. Gyps later ambushed Garth, taking him into the bayou where a \"red sect\" of voodoo practitioners planned a human sacrifice. The priestess of the ritual was Layla, Garth's secretary, who had fallen in love with him. Layla pretended to perform the sacrifice, but then allowed Garth to flee into the swamp, but Gyps caught up to Garth and slew him with his gardening shears. Feeling cheated by Garth's quick death, Gyps forced Layla to transform Garth into a zombie. Upon digging out of his fresh grave, Garth went on a rampage until one of the cultists placed an Amulet of Damballah around the Zombie's neck, giving its twin to Gyps, allowing him to control Garth. After failed efforts to use Garth to steal money, Gyps sent Garth to terrify Donna, intending to win her favor by pretending to rescue her. Seeing his daughter, however, Garth somehow threw off Gyps' control and slew his former master before returning to his bayou grave.",
        "bio": "Though magic users on [[Earth]] have reanimated the dead using various means for thousands to millions of years, the Voodoo god [[Sagbata]] (Baron Samedi) and the Elder God [[Chthon]] combined forces in the 17th century to create a potent spell, and most subsequent practitioners have tapped into their magic to create zombies; however, the best known zombie, Simon Garth, is strangely atypical. War hero Simon Garth was senior partner for 25 years to Brian Stockwood in Garwood Industries, maker of leading Garth Manor Coffee. Divorced after assaulting his wife Miranda, Garth raised their daughter, Donna, to adulthood in New Orleans, Louisiana. The controlling Garth violently berated and fired his gardener Gyps for lusting after Donna. Gyps later ambushed Garth, taking him into the bayou where a \"red sect\" of voodoo practitioners planned a human sacrifice. The priestess of the ritual was Layla, Garth's secretary, who had fallen in love with him. Layla pretended to perform the sacrifice, but then allowed Garth to flee into the swamp, but Gyps caught up to Garth and slew him with his gardening shears. Feeling cheated by Garth's quick death, Gyps forced Layla to transform Garth into a zombie. Upon digging out of his fresh grave, Garth went on a rampage until one of the cultists placed an Amulet of Damballah around the Zombie's neck, giving its twin to Gyps, allowing him to control Garth. After failed efforts to use Garth to steal money, Gyps sent Garth to terrify Donna, intending to win her favor by pretending to rescue her. Seeing his daughter, however, Garth somehow threw off Gyps' control and slew his former master before returning to his bayou grave. \n\n\nThe Amulet was found in Gyps' shack a few weeks later by Detective Sam Jagger, who had been investigating Garth's disappearance. Donna Garth confirmed Gyps' identity and, sensing some connection to her father, convinced Jagger to give her the Amulet. Donna's desire to locate her father unearthed the Zombie, but the Amulet was stolen from her by heroin addict Gene Griggs, who lost it just before being confronted and slain by the Zombie. After killing a pair of grave robbers, Garth sensed a connection to Haiti and stowed away on a ship bound for Port-au-Prince, coincidentally also boarded by Donna. Garth sought out old friend Anton Cartier, who hid him in a cave and offered a room to Donna. As she slept, Donna was abducted and brought to mad scientist Professor Richard Ricard, who had been trying to use a serum to create a human spider and found that Haitian women lacked the drug resistance to tolerate the potion, as they had not been exposed to chemicals and preservatives on a daily basis. \n\nRicard injected Donna with his experimental spider-venom, transforming her into a giant spider-thing. Ricard was overjoyed and embraced the creature, which slew him and then escaped. Wandering off as soon as he had been left alone, Garth battled the giant spider-thing. In a passive-aggressive struggle mirroring their real life conflicts, the Zombie virtually ignored it as the creature attacked him savagely. Ultimately the spider-thing exhausted the serum and returned to normal, though the Zombie left before Donna revived. \n\nLater, the Zombie was drawn to a voodoo ceremony where dark voodoo priestess Katanya had condemned and mutilated Moira Mason for filming their ritual. When Moira's filmmaker husband Bruce agreed to become Katanya's zombie in exchange for restoring Moira, Garth intervened to prevent Bruce from sharing his fate. The Zombie slew Moira at her request, but Katanya's cultist then cast him into the ocean. Garth remained on the ocean floor until the Amulet was found by down-on-his-luck Phillip Bliss, who jokingly summoned the Zombie. Realizing his control, Bliss sent Garth to gain vengeance on the lawyers who had ruined Bliss's life. Bliss attempted to grant the Zombie a peaceful grave, but his Amulet was taken by agents of the criminal Mister Six. The Zombie followed the Amulet to Six's master, the legless Papa Shorty who held himself at normal height via levitation. Shorty forced the Zombie to kill Bliss, but then dropped the Amulet, and Garth vengefully slew Shorty. \n\nShortly thereafter, the Amulet was found and sold by one of Shorty's former followers, and it -- and the legend of Simon Garth -- swiftly found its way into the hands of New York occult shop owner Gideon Starr, who used it in a plot with Myrna Lukaikas to kill her ailing husband, Frank. Gideon then had Myrna perform a ritual using a fake Amulet in which he posed as the Zombie, wearing the real Amulet and bursting through the ground, causing Frank to die of an expected heart attack. Unwilling to share her husband's fortune, Myrna poisoned Gideon, but the real Zombie, summoned by Gideon's Amulet, then arrived. As her Amulet was fake, Myrna could not stop the Zombie from killing her. Claiming the real Amulet, the Zombie tried and failed to will his own death, then wandered off. The Amulet was somehow returned to the ruins of Shorty's temple.\n\nHeading back to his bayou grave, Garth was drawn to a ritual conducted by Layla, who controlled him and promised him a final death. Becoming lost in the swamp, they encountered Eric Masterson, who threw Layla to his monstrous, cannibalistic son, Teddy. Garth confronted Eric and was futilely attacked by Teddy, and Layla slew Eric before leading Garth back into the swamp (note: This is not the same Eric Masterson who became [[Thunderstrike]]). Layla knocked herself out on a log while Garth wandered into the mystery of the deceased Brian Collier and his relatives, many of whom fell before a plot of Collier's lawyer, Jerome Ralston. Garth slew Ralston and his partner-in-crime, Collier's grandson, Jason. Layla's father, Papa Doc/Doc Kabel, gave her a gris-gris (magical charm) to end the Zombie's curse, but by then Garth had been called away by fireman Fred Miller, who had found the Amulet and summoned the Zombie as a party gag. Miller and his friends used Garth to torment their antagonists, but the Zombie was horrified after being forced to smash the head of a secretary, who turned out to be Layla. Dazed, Layla tore off Garth's Amulet, freeing him from their control, and he slew Miller and his friends. \n\nThe dying Layla had Papa Doc use the last of her life force to return Garth to life for 24 hours to get his affairs in order - including killing Mister Six, attending Donna's wedding to Bruce Mason, and selling controlling interest in Garwood, using the money as a trust fund for Donna and Miranda - then allowed him to die in peace. The vampire [[Frost, Deacon|Deacon Frost]], working alongside [[Laveau, Marie|Marie Laveau]], once sought to usurp Garwood industries, which Donna eventually owned. Donna hired [[Hannibal King]] to track down the stolen Amulet of Damballah, as well as her father. King joined with [[Blade (Eric Brooks)|Blade]] and [[Brother Voodoo (Jericho Drumm)|Brother Voodoo]] to drive off Frost and Laveau, though Garth apparently remained buried.\n\nCaribbean priestess [[Calypso]] later slew Papa Doc, using his spirit to revive the Zombie, and he again existed at the whim of the Amulet's holder. Garth briefly battled the Daredevil doppelganger [[Hellspawn]] before freeing Papa Doc's spirit from Calypso, who transferred the Amulet (and her own spirit) to [[Daily Bugle]] secretary [[Grant, Glory|Glory Grant]]. Garth sought out Calypso for vengeance and assaulted Grant, leading to battles with [[Spider-Man (Peter Parker)|Spider-Man]] and the mercenary [[Shotgun (J.R. Walker)|Shotgun]]. Calypso's spirit eventually fled back into her own body and Glory gave the Amulet back to the Zombie. \n\nGarth later became a pawn of [[Dracula]]'s daughter, [[Lilith (Daughter Of Dracula)|Lilith]], who used the Amulet to force him to gather fodder for her growing vampire army. Lilith was opposed by Spider-Man and Hannibal King, who tore the Amulet from Lilith and teamed with Garth to drive her off. King returned the Amulet and Garth to Donna, who brought him back to New Orleans to bury him. Donna later had the Zombie slay Papa Nebo and Narcisse after they had killed her old friend Angelina Beliard. Donna allegedly has some ties to the [[Legion of Night]].He has been a Zombie for years the Midnight sons had been reborn.",
        "categories": [
            "Horror",
            "Magic"
        ]
    }
}