{
    "id": 1009545,
    "name": "Robbie Robertson",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/5/a0/4c003c50a94b7",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1009545",
    "comics": {
        "available": 11,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009545/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/37257",
                "name": "Alias (2003) #10"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/37255",
                "name": "Alias Omnibus (Hardcover)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/22863",
                "name": "Amazing Spider-Man (1999) #580"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/40886",
                "name": "Amazing Spider-Man (1999) #655 (2nd Printing Variant)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/16906",
                "name": "Amazing Spider-Man Annual (1964) #5"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/16889",
                "name": "Amazing Spider-Man Annual (1964) #15"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/16890",
                "name": "Amazing Spider-Man Annual (1964) #16"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/1879",
                "name": "Marvel Masterworks: The Amazing Spider-Man Vol. 7 - (Hardcover)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/3348",
                "name": "New Avengers (2004) #15"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/5033",
                "name": "New Avengers Vol. 3: Secrets & Lies (Trade Paperback)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/18864",
                "name": "Soldier X (2002) #1"
            }
        ],
        "returned": 11
    },
    "series": {
        "available": 8,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009545/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/672",
                "name": "Alias (2003)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/13383",
                "name": "Alias Omnibus (2006)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/454",
                "name": "Amazing Spider-Man (1999 - 2013)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2984",
                "name": "Amazing Spider-Man Annual (1964 - Present)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1389",
                "name": "Marvel Masterworks: The Amazing Spider-Man Vol. 7 - (2005)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/753",
                "name": "New Avengers (2004 - 2010)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1446",
                "name": "New Avengers Vol. 3: Secrets & Lies (2006)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/3692",
                "name": "Soldier X (2002 - 2003)"
            }
        ],
        "returned": 8
    },
    "stories": {
        "available": 8,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009545/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/3479",
                "name": "2 of 2 - Spider-Woman",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/35397",
                "name": "Spider-Man: Threat Or Menace?",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/35407",
                "name": "",
                "type": "profile"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/35456",
                "name": "Cover #35456",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/40372",
                "name": "Dear Irene...",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/50775",
                "name": "Amazing Spider-Man (1999) #580 - Int",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/82495",
                "name": "[untitled]",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/92597",
                "name": "Amazing Spider-Man (1999) #655, 2nd Printing Variant - Int",
                "type": "interiorStory"
            }
        ],
        "returned": 8
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009545/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1009545/robbie_robertson?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Robertson%2C_Joseph_%22Robbie%22?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Joseph Robertson",
        "identity": "No dual identity",
        "occupation": "Editor-in-Chief, Daily Bugle; former convict, city editor, reporter",
        "place_of_birth": "Harlem, New York",
        "groups": "Daily Bugle staff, Jameson News Digest staff",
        "citizenship": "U.S.A. with a criminal record (pardoned)",
        "education": "Columbia School of Journalism graduate",
        "aliases": "Robbie",
        "relatives": "Martha (wife), Patrick Henry (son, deceased), Randolph (Randy, son), Samuel Robertson (father, deceased), Alice Robertson (mother, deceased), Amanda (Mandy, ex-daughter-in-law)",
        "height": "6'1\"",
        "weight": "210 lbs.",
        "eyes": "Brown",
        "hair": "White",
        "powers": "",
        "abilities": "Robbie is a veteran editor, manager and reporter, well respected for his wisdom, courage and integrity. He is renowned for his saintly patience, sly wit and relentless work ethic. He has some experience with hand-to-hand combat and firearms, but is unskilled and reluctant in these areas, and seldom has to rely on violence. A lifelong pipe-smoker, Robbie is seldom seen without his trademark pipe.",
        "debut": "Amazing Spider-Man Vol. 1 #51 (1967)",
        "creators": "this has not been updated yet",
        "main_image": "robbie_1.jpg",
        "bio_text": "Joe Robertson was born to be a journalist. As a student at Harlem High School, he worked for the school paper, becoming its editor during his senior year and winning a scholarship to the Columbia School of Journalism. Hardworking and dedicated, \"Robbie\" was a fearless reporter-until he ran afoul of one particular subject, fellow Harlem student Lonnie Thompson Lincoln, nicknamed [[Tombstone]]. A massive albino taunted by his peers because of his appearance, the brutal Lonnie considered Robbie a friend of sorts since Robbie was one of the few who never mocked him; however, when Lonnie began using his considerable strength to extort money from classmates, Robbie prepared a story for the Harlem High paper exposing Lonnie's activities. Ambushing Robbie after school, Tombstone beat him bloody until Robbie agreed to kill the story, which never saw print. Lonnie saw this as a cordial understanding between friends, but Robbie was disgusted with himself and determined never to compromise his ethics again.",
        "bio": "Joe Robertson was born to be a journalist. As a student at Harlem High School, he worked for the school paper, becoming its editor during his senior year and winning a scholarship to the Columbia School of Journalism. Hardworking and dedicated, \"Robbie\" was a fearless reporter-until he ran afoul of one particular subject, fellow Harlem student Lonnie Thompson Lincoln, nicknamed [[Tombstone]]. A massive albino taunted by his peers because of his appearance, the brutal Lonnie considered Robbie a friend of sorts since Robbie was one of the few who never mocked him; however, when Lonnie began using his considerable strength to extort money from classmates, Robbie prepared a story for the Harlem High paper exposing Lonnie's activities. Ambushing Robbie after school, Tombstone beat him bloody until Robbie agreed to kill the story, which never saw print. Lonnie saw this as a cordial understanding between friends, but Robbie was disgusted with himself and determined never to compromise his ethics again. \n\n\nPutting the Tombstone incident behind him, Joe graduated from Harlem, attended Columbia, got his degree, and landed a job several years later as a night-desk catcher with a Philadelphia newspaper. He also married his girlfriend, Martha, but Robbie's old secret would soon come back to haunt his new life. When a telephone tipster told Robbie he knew who had killed local crimelord Ozzy Montana, Robbie set up a secret waterfront meeting; but he found his informant dead in the grip of Tombstone, who had become a mob hitman with a penchant for snapping necks. Robbie fled and kept quiet about the whole incident, fearful of what Tombstone might do to him or his wife if he talked. Joe realized he had never fully recovered from his early encounters with Tombstone, and that the killer had a strange sort of hold over him. \n\n\nTrying to forget his Tombstone failures, Robbie threw himself back into his journalism career. He and Martha moved back to Manhattan, where Joe became a reporter for the [[Daily Bugle (Building)|Daily Bugle]]. Over the next twenty years, Robbie rose through the ranks to become the Bugle's city editor and one of the city's most respected journalists. He formed a close friendship with the Bugle's publisher and editor-in-chief, [[J. Jonah Jameson]], supplying a calming yin to Jameson's raging yang. Though a good newspaperman at heart with a strong social conscience, Jameson has often allowed his personal biases to compromise his journalistic perspective, but Robbie's counterbalancing views have kept the Bugle's news coverage relatively fair (unlike many of Jameson's editorials). Jameson and Robertson have sharply differing views on super heroes in general and [[Spider-Man (Peter Parker)|Spider-Man]] in particular. Jameson tends to regard costumed vigilantes with suspicion and contempt, and is consumed by a jealous loathing of Spider-Man, not knowing the hero is secretly young Bugle photographer Peter Parker. Robbie has a more objective view of New York's super heroes, judging them by their actions, and has aided Spider-Man and other heroes on many occasions. Robbie has also been something of a fatherly mentor to Peter Parker, and has often seemed aware of Peter's dual identity; but he has never voiced, exploited or acted on this knowledge, and has even protected Peter's secret on occasion, such as when he steered Bugle reporter [[Ellis, Ken|Ken Ellis]] away from learning the truth. \n\n\nThey first worked together when Robbie helped Spider-Man capture the criminal [[Chameleon]]. Later, when Robbie exposed corrupt politician Sam Bullitt, Spider-Man and [[Iceman]] teamed up to rescue Robertson from a vengeful Bullitt's thugs. Robbie went on to target another corrupt politician, mayoral candidate Richard Raleigh, and Spider-Man saved Robertson from Raleigh's savage super-agent, the Smasher, who later killed Raleigh himself. \n\n\nRobbie's family life often ran less smoothly than his professional life. His firstborn son, Patrick, died while still an infant. His second son, Randy, grew to adulthood, but often fought bitterly with his father over their differing beliefs. An anti-establishment radical, Randy was a key player in student protest movements at Empire State University, where Robbie sometimes intervened as both father and reporter. Ultimately deciding to pursue social work as a career rather than journalism, Randy transferred to the University of Pittsburgh, where he met and married a white Jewish woman named Amanda, much to Robbie's discomfort. Randy eventually moved back to New York and found employment as a social worker, and Robbie gradually accepted his son's mixed marriage, though Randy and Amanda later broke up. In recent times, Randy has been dating [[Grant, Glory|Glory Grant]], long-time secretary to Jameson and Robertson at the Daily Bugle. \n\n\nJameson's obsessive hatred of Spider-Man drove him to unusual lengths over the years, including the funding of several projects designed to capture, humiliate or destroy the hero. One such project created the mad super-criminal known as the [[Venom (Mac Gargan)|Scorpion]]. Jameson kept his involvement secret for years, but after the [[Hobgoblin (Roderick Kingsley)]] tried to blackmail him using this information, Jameson made a full public confession and stepped down as the Bugle's editor-in-chief, promoting Robertson to replace him. While Jameson has remained a very hands-on presence in the Bugle as its publisher, Robertson has proved very successful and effective in his new role as the paper's chief editor. He has been a friend and mentor to reporters and columnists such as [[Brant, Betty|Betty Brant]], Kate Cushing (his successor as city editor), Kat Farrell, [[Hobgoblin (Ned Leeds)|Ned Leeds]], Joy Mercado, Leila Taylor and [[Urich, Ben|Ben Urich]]. \n\n\nThen, at the height of Robbie's success, Tombstone brought his whole world crashing down. After years of rising through the ranks of organized crime as a Philadelphia mob enforcer, Tombstone began working for New York crime boss Wilson Fisk, the [[Kingpin]]. Consumed by guilt over having helped make Tombstone's many murders possible with his silence, Robbie confronted Tombstone with a gun, intending to take him into custody and tell the police everything. Lonnie overpowered Joe and seriously injured him, seemingly breaking his back. By this time, Robbie had left an audiotape with Peter Parker, confessing his role as an accessory in Tombstone's criminal career. But when Tombstone menaced the crippled Robertson in the hospital, Joe began to have second thoughts about going to the police. Berated by Parker and reporter Ben Urich for his weakness, and supported by Randy, Robbie finally worked up the courage to face his fears. He rapidly regained his mobility through physical therapy, and made a full confession of his Tombstone secrets to his Bugle colleagues and the public. Robbie offered to resign his editorial post, but Jameson refused to accept his resignation. Lonnie, meanwhile, had been captured by Spider-Man, who was baffled by Tombstone's admission that he spared Robertson's life because he still regarded Robbie as his friend. \n\n\nThe public and Robertson's colleagues seemed prepared to forgive his mistakes, but a corrupt Kingpin-connected judge sent Robbie to prison for his indirect role in Tombstone's crimes. To make matters worse, Tombstone fixed it so that he and Robbie ended up in the same federal prison, where Lonnie and his cronies could continue to haunt his old friend. Robertson befriended a massive convict known as [[Bruiser (Lemuel McPhee)|Bruiser]], who acted as his bodyguard for a time, but Bruiser was ultimately taken unawares and beaten to death. Later, Tombstone broke out of prison, taking Robbie with him as a hostage. When Spider-Man intervened, Tombstone had the hero at his mercy and was about to kick him off an airborne helicopter, but Robbie tackled Tombstone first, sending himself and Lonnie hurtling toward Earth. Incredibly, they survived the fall and landed in a riverbed on Amish farmland, where Tombstone forced the Amish folk to treat the seriously injured Robbie, then challenged Robertson to a duel to settle their differences. Robertson was taking a beating until he finally struck back by stabbing Tombstone with a nearby pitchfork. Badly wounded and shocked that his \"friend\" Robbie would do this to him, Tombstone staggered off alone, and Robbie turned himself in to the authorities; however, the late Bruiser's brother, attorney Stuart McPhee, used his connections to secure Robertson a Presidential pardon. Robbie was released from prison and reclaimed his post at the Bugle. \n\n\nTombstone soon resurfaced and Robertson confronted him again, this time shooting Lonnie; as a result of this encounter, Tombstone was accidentally exposed to an experimental gas that made him superhumanly powerful. Pleased with this outcome, even grateful, Lonnie gave up his vendetta against Robertson and told Robbie their debts were settled, though Tombstone remains active as a dangerous super-criminal. Robertson, meanwhile, has remained a mainstay of the Daily Bugle. When Thomas Firehart (alias [[Puma]]) engineered a hostile takeover of the paper as part of a misguided scheme to improve Spider-Man's reputation, Robbie was among the Bugle veterans who joined Jonah in publishing the new Jameson News Digest until Jameson regained control of the Bugle and they all returned to their old positions. Later, when corrupt industrialist [[Green Goblin (Norman Osborn)|Norman Osborn]] seized control of the Bugle, Robbie resigned in protest, but returned after Jameson squeezed Osborn out. More recently, Robbie has finally made some headway in moderating the anti-super-hero views of Jameson, and they have hired retired super hero [[Jones, Jessica|Jessica Jones]] to collaborate with Ben Urich on a superhuman affairs column called [[The Pulse]], but both Urich and Jones subsequently quit the Daily Bugle.",
        "categories": [
            "Spider-Man"
        ]
    }
}