{
    "id": 1009573,
    "name": "Shadow King",
    "description": "One of the oldest and more powerful mutants ever, Amahl Farouk has been a threat to mankind at least for decades. He was the first evil mutant met by Charles Xavier, convincing him of the need of the X-Men.",
    "modified": "2011-04-13T12:11:28-0400",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/9/30/4ce5a16fd4182",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1009573",
    "comics": {
        "available": 14,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009573/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/1587",
                "name": "Marvel Masterworks: The Uncanny X-Men Vol. (Hardcover)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/32595",
                "name": "Uncanny X-Force (2010) #8"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/12433",
                "name": "Uncanny X-Men (1963) #117"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/13796",
                "name": "Uncanny X-Men (1963) #255"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/13798",
                "name": "Uncanny X-Men (1963) #257"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/13800",
                "name": "Uncanny X-Men (1963) #259"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/13810",
                "name": "Uncanny X-Men (1963) #269"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/13816",
                "name": "Uncanny X-Men (1963) #275"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/13818",
                "name": "Uncanny X-Men (1963) #277"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/4100",
                "name": "Uncanny X-Men Omnibus Vol. 1 (Hardcover)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/12289",
                "name": "X-Factor (1986) #69"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/14370",
                "name": "X-Men (1991) #78"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/12361",
                "name": "X-Men Annual (1970) #15"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/1079",
                "name": "X-Men Visionaries: Jim Lee (Trade Paperback)"
            }
        ],
        "returned": 14
    },
    "series": {
        "available": 8,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009573/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1440",
                "name": "Marvel Masterworks: The Uncanny X-Men Vol. (2005)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/9976",
                "name": "Uncanny X-Force (2010 - 2012)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2258",
                "name": "Uncanny X-Men (1963 - 2011)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1723",
                "name": "Uncanny X-Men Omnibus Vol. 1 (2006)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2098",
                "name": "X-Factor (1986 - 1998)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2265",
                "name": "X-Men (1991 - 2001)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2100",
                "name": "X-Men Annual (1970 - 1991)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/139",
                "name": "X-Men Visionaries: Jim Lee (2002)"
            }
        ],
        "returned": 8
    },
    "stories": {
        "available": 11,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009573/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/15416",
                "name": "Cover #15416",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/19865",
                "name": "Kings of Pain Part 3: Queens of Sacrifice",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/22326",
                "name": "The Muir Island Saga Part 2",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/28020",
                "name": "Crash and Burn",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/28024",
                "name": "I Am Lady Mandarin",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/28028",
                "name": "Dream a Little Dream",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/28048",
                "name": "Rogue Redux",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/28060",
                "name": "The Path Not Taken",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/28064",
                "name": "Free Charley",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/29295",
                "name": "Psi-War Part 2: With the World's Fate in Her Hands--Could This Be Psylocke's Last Stand?",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/73587",
                "name": "Uncanny X-Force (2010) #8",
                "type": "cover"
            }
        ],
        "returned": 11
    },
    "events": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009573/events",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/events/116",
                "name": "Acts of Vengeance!"
            }
        ],
        "returned": 1
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1009573/shadow_king?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Shadow_King?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Unrevealed",
        "identity": "Publicly known; his existence on the astral plane is not commonly known",
        "occupation": "Crimelord",
        "place_of_birth": "Cairo, Egypt",
        "relatives": "Unrevealed",
        "groups": "Shadow Mob; former head of the [[Gladiators]] and the Cairo’s Thieves Quarter",
        "citizenship": "Various under many hosts",
        "education": "Unrevealed",
        "aliases": "Professor X, Ananasi, Amahl Farouk, Evil One, Master of the Games; he also impersonated the following mind-controlled subjects (in chronological order): [[Flynn, Alexander|Alexander Flynn]], [[Karma]], [[Cypher (Douglas Ramsey)|Cypher]], [[Reisz, Jacob|Jacob Reisz]], [[Pierce, Donald|Donald Pierce]] and probably others",
        "height": "6'1\"",
        "weight": "330 lbs. / no weight in astral form",
        "eyes": "Brown / Red as Shadow King",
        "hair": "None",
        "powers": "The Shadow King is one of the more powerful mutant telepaths in the world, and has used mental bolts and probes, as well as a powerful psi-screen. He also manipulated the astral plane, being an expert fighter while in astral form. Since his physical death, he existed entirely as an astral creature but he could also possess or subliminally control a physical body, even using the host's psionic powers if any. He could also use his powers to cure physical injuries on his host body. He is said to be immortal and feed on hatred and violence.",
        "weapons": "None. In the astral plane, the Shadow King fancies gladiator fights and uses psionic weapons from Roman gladiators of old.",
        "paraphernalia": "As Farouk, he used a cane, sunglasses and a fez.",
        "abilities": "Farouk was an expert in Egyptian law and was fluent in different Arabic languages.",
        "debut": "X-Men  #117 (1979)",
        "origin": "Uncanny X-Men #279 (1991)",
        "significant_issues": "X-Treme X-Men Annual 2001 (birth); X-Men #117 (first encounter with Xavier); New Mutants #34 (defeated by New Mutants); Uncanny X-Men #253 (return and first appearance as Reisz); Uncanny X-Men #280 (broke Xavier's legs and spine); X-Men vol. 2 #78 (captured in Psylocke's body)",
        "main_image": "Shdwkng.jpg",
        "bio_text": "",
        "bio": "One of the oldest and more powerful mutants ever, Amahl Farouk has been a threat to mankind at least for decades. He was the first evil mutant met by Charles Xavier, convincing him of the need of the X-Men. He has since been tried to recover and take over the world, always confronted by the X-Men, but never utterly defeated.\n\n==The original Shadow King==\n\nRecent discoveries suggest that the \"Shadow King\" was born \"when the first dreams came in night, in the first [[Nightmare|nightmare]]\". The Shadow King might have been a being of telepathic energy existing only through the astral plane, but taking human hosts for a time to have a link to the physical world. Alternatively, the \"Shadow King\" might have been a shared identity used by different people through the years, or the remains of an original telepathic mutant who have been possessing people since his first body's death.\n\nAnyhow, the Shadow King (using the name of Farouk) worked in 1936 with [[Baron Strucker|Wolfgang von Strucker]] and Geist, agents of Hitler wanting to dethrone King Edward of England in favor of a fascist relative. To do so, the Shadow King performed a mystic ceremony which accidentally pulled back in time [[Marvel Girl (Rachel Summers)|Rachel Summers]], the host of the [[Phoenix Force]], alongside with Summers' friend [[Pryde, Kitty|Shadowcat]]. Due to the failure, von Strucker began to doubt of the Shadow King's power. The Shadow King captured and tranced Summers but Shadowcat escaped and found an ally in Alasdhair Kinross. Farouk captured then heir to the throne Lilibet and, taking control of the Phoenix, escaped to Edinburgh.\n\nShadowcat tried to reach Summers telepathically, but she found Farouk controlling him. Shadowcat only escaped by surprising Farouk using his secret name, Shadow King, with which she was familiar due to their previous encounter with Farouk in her past - his future. Farouk tried to make Kinross crash, but Shadowcat used her phase powers to save both of them, and also to disrupt Kinross's nervous system, which knocked him down.\n\nShadowcat tried to rescue Summers again, but Farouk found her and forced her to run away. Farouk then tried to sacrifice Kinross to some demons in exchange of a spell to annihilatte the monarch bloodline of England (as Kinross was related to that bloodline), using a sacred crystal knife. Shadowcat rescued him using her powers and the blade shattered.\n\nThe demoniac forces entered then in Farouk's body, but they were too powerful to be contained. Farouk then tried to disperse the spell's power before it consumed himself: He destroyed the Nazi soldiers and then tried to kill the Nazi-supported heir, incinerating her to close the gate. Von Strucker, considering that Farouk had committed treason, tried to shoot him. Farouk them metamorphed into a monstruous \"Shadow King\" form and promised to use his power to favor the Führer's plan.\n\nThe Shadow King then tried to use his psychic powers against Shadowcat and Kinross, to make them fight each other, but they were eventually rescued by a young [[Wolverine (James Howlett)|Logan]]. At the same time, Rachel Summers unleashed all of her power against the Shadow King, but he managed to retain her control over her. However, Geist and von Strucker still retained doubts about their alliance with that non-Arian monster. Lilibet escaped and fled to Holyrood House, but the Shadow King sent Phoenix after her and telepathically took control of all of the servant in the House, who would them pusue Lilibet.\n\nLogan ambushed Farouk, von Strucker and Geist, but he only captured Geist. Farouk then sent the servants and Phoenix against Logan, Shadowcat and Kinross. He took control of Lilibet and Shadowcat, and then relaxed his control to taunt them. Shadowcat then talked about the future, explaining the defeat of Hitler, and then Lilibet attacked Farouk causing him a minor injury. This was enough to stun him, and Shadowcat used this chance to disrupt Farouk's nervous system. She herself was stunned too because of the psychic backlash, but Farouk's temporary defeat allowed Rachel Summers to free herself.\n\nFarouk recovered in time and tried to re-captured his prisoners, but Summers fought and defeated him in the astral plane. She would have killed him but Shadowcat used the [[Sword of Scones]] to strike them both, returning them to their respective bodies. Farouk's body, however, was being consumed by his powers and was destroyed by an energy blast from the sword.\n\nSomeone, the Shadow King survived and duplicated Farouk's body. In 1971, Farouk met with a [[Citizen V (John Watkins Jr)|John Watkins, Jr.]], leader of the [[V-Battalion]]. Watkins offered Farouk the help of the Battalion in exchange of information about the [[Everlasting]]. A simple telepathic scan provided Farouk with the name of Marduk. Farouk gave this name to Watkins.\n \n==Amahl Farouk vs. the New Mutants==\n\nAs a young man, the mutant telepath [[Professor X|Charles Xavier]] visited Cairo, Egypt. There, his wallet was stolen by the child Ororo, who would later join Xavier's [[X-Men]] team as [[Storm]]. Xavier used his psionic powers to stop Ororo and took his wallet back. Suddenly, Xavier himself was struck by a bolt of psionic energy. Recovering, he realized that the source of the psychic attack lay within a nearby tavern.\n\nWithin the bar Xavier met '''Amahl Farouk''', the crimelord of Cairo, who was himself a mutant with vast telepathic powers. Farouk had sensed the presence of another powerful telepath and had struck him with a psionic bolt as a warning to leave the area of his domain, the so-called Thieves' Quarter of Cairo. Xavier and Farouk sat at different tables in the bar and communicated solely through telepathy. Farouk asked Xavier to join him in his criminal activities. Xavier sensing Farouk's evil and depravity, refused. Contending that mutants like themselves had a responsibility to use their superhuman abilities for the benefit of others, Xavier vowed to bring Farouk to justice for his crimes. Xavier's and Farouk's astral forms then began a battle which ended when the former defeated his foe with a powerful bolt of psychic force. Xavier's astral form rejoined his body, and he left the bar.\n\nFarouk was the first evil mutant Xavier had ever met and the experience taught him how dangerous people could be if they used their powers for evil. Hence, Xavier's encounter with Farouk was one of the factors that led to his later founding of the X-Men.\n\nWhen Farouk's physical body died, however, he shifted his astral form to another plane. Weakened by the intensity of his duel with the crimelord, Xavier did not notice that Farouk's consciousness had thus escaped. Farouk wanted vengeance on Xavier, but believed him too powerful to challenge safely.\n\nYears later, however, Farouk became aware of Xi'an Coy Minh, alias [[Karma]], a member of Xavier's new team of young superpowered heroes, the [[New Mutants]], who had the psionic ability to take psychic possession of another person. Karme disappeared on a mission with the New Mutants after the explosion of a hideout belonging to their foe [[Viper (Madame Hydra)|Viper]]. The other New Mutants believed Karme to be dead. However, Farouk had turned Karma's own power against her and taken psychic possession of her body. Inhabiting Karma's physical form, Farouk resumed his criminal career on a worldwide scale. Now that he once more had a corporal body, Farouk was able to indulge his physical appetites. In his original body, Farouk had been an overweight man, but over the months that he possessed Karma's body, as if to compensate for the years he spent as a disembodied spirit, Farouk became so gluttonous that Karma's body grew grotesquely obese.\n\nFarouk came to control the [[Gladiators]], a large group of superhuman mutants who illegally engaged in blood sports for the entertainment of paying customers. Farouk used holographic images of the Gladiators' former leader, [[Flynn, Alexander|Alexander Flynn]], to convince all but his inner circle in the operation that Flynn was still in control of their activities. This false Flynn claimed to be the soon of [[Doctor Doom (Victor von Doom)|Doctor Doom]], but this was proved to be a lie of Farouk.\n\nFarouk had to of the New Mutants, [[Magma (Amara Aquilla)|Magma]] and [[Sunspot]], abducted and forced them to fight at his secret arena. A team of heroes, which included their teammates [[Cannonball (Sam Guthrie)|Cannonball]], Shadowcat and [[Magik (Illyana Rasputin)|Magik]], tried to rescue them. Farouk captured Shadowcat, one of the heroes who had recognized Karma, and put her under his control. When she broke free, the group caused such an uproar that the police invaded the scret complex and shut it down. The New Mutants and their allies caught Farouk and recognized Karma but, still in Karma's body, Farouk got away.\n\nUnaware that Karma was possessed by Farouk, the entire New Mutants team tracked her to [[Madripoor]]. There Farouk took control of Cannonball, [[Cypher (Douglas Ramsey)|Cypher]], Magma, Sunspot and Wolfsbane. Magik, [[Moonstar|Mirage]] and the alien [[Warlock (Technarchy)|Warlock]] (who was immune to Karma/Farouk's possession power) went to Cairo, where Farouk had taken his new conquests. There, Magik, Mirage and Warlock joined forces with Storm, though Farouk also took control of Mirage and Storm, and Magik learned that Karma was being possessed by Farouk.\n\nFarouk planned to use his control of Storm to force her to kill Xavier, and planned to leave Karma's body eventually and take over someone else, leaving her to pay for his crimes.\n\nFinally, while Warlock distracted Farouk, Magik freed Storm and the other New Mutants from his mental control. The heroes attacked Farouk, who fled Karma's body only to take over that of Cypher's instead. Karma was now once more herself and wanted vengeance on Farouk. Her astral form battled his and forced him to flee to another plane, freeing Cypher.\n\n==[[Psi War]]: The Return of the Shadow King==\n\nAlthough Karma would be scared of Farouk for a long time, many years would pass before he was heard of. Farouk was still alive, although his lack of a body avoided any interaction with the physical world. He eventually found Inspector [[Reisz, Jacob|Jacob Reisz]], an FBI division chief who had died recently. Farouk possessed his corpse and impersonated him.\n\nFarouk re-appeared in a time where most of the X-Men had disappared in the [[Siege Perilous]]. Due to supervillain [[Nanny (cyborg)|Nanny]], Storm returned to her teenage form and awoke, amnesiac, in Cairo, Illinois. Farouk found Storm (he would maintain that she had been his fiancée once) and sent her to Cairo Memorial Hospital.\n\nStorm's friend [[Forge]] accessed the astral plane by meditation. There he found Storm in a cage, flanked by Farouk and a silent Reisz. Farouk told Forge that Reisz had tried to save Storm, but failed. He then challenged Forge to an astral arm-wrestle. Forge punched Farouk with an astral version of his cybernetic arm, disrupting Farouk's control over him. This allowed Forge to return, although his real cybernetic arm was destroyed due to the feedback. Forge understood that Storm was alive (he had previously believed to have killed her) and tried to find help in the [[Freedom Force]].\n\n\"Reisz\" then met with Dr. [[Shen, Lian|Lian Shen]] from the Hospital. He accepted to take care of the child personally. Shen was scared of Reisz, believing he had some personal vendetta against the child. She talked about that with [[Hayden, Stuart|Stuart Hayden]]. Farouk, to avoid detection, killed Hayden in front of Shen's eyes, and then mind-controlled Shen. He however framed the child Storm for the murder, sending the police after her.\n\nMeanwhile, in [[Muir Island]], telepath [[Legion (David Haller)|Legion]] tried to use [[Glossary:C#Cerebra.2FCerebro|Cerebro]] to search Storm and other missing X-Men. When he connected to the astral plane, Farouk attacked and possessed Legion, with only Forge seeing him briefly. Farouk then mind-controlled other useful minions such as [[MacTaggert, Moira|Moira MacTaggert]], [[Magik (Amanda Sefton)|Amanda Sefton]] and specially [[Cooper, Valerie|Valerie Cooper]], who provided Farouk with access to files on super-humans.\n\nFarouk discovered then that mutant precognitive [[Destiny (Irene Adler)|Destiny]] had died. Thus, Destiny could not warn her ally [[Mystique]] of any threat. Farouk said he had \"manipulated the development\" of those two mutants, among others. He then sent Valerie Cooper to murder Mystique.\n\nThe child Storm had successfully avoided any police and turned to art stealing: She stole artworks that had been previously stolen, and returned them to their rightful owners. Discovering that, Farouk decided to control a professional art thief (plus family and services) as a bait to Storm. They became Farouk's \"hounds\".\n\nStorm was captured by the hounds. Due to her age, she had no access to her powers, although she struggled with the hounds. Farouk tried his mind control on her; this unleashed such psi-pressure on her mind that she sent a lightning bolt to Farouk. Stunned, Farouk retired his hounds while he healed Reisz's body. He soon tried to search her, but a psyonic disturbance prevented this. He then sent the hounds.\n\nStorm found another thief, [[Gambit]], and they joined forces against a common foe. Farouk found them both and tried to mind-blast Gambit, but then Storm attracted his attention. They both fought together with each of them distracting Farouk whenever he tried to attack the other. Storm eventually scattered soot from the chimney, giving them both a chance to escape in the remains of a ''Douglas DC-6'' she moved with her powers. Farouk sent Lian Chen with the hounds after them both, specifying that she was not to be hurt.\n\nMeanwhile, Valerie Cooper confronted Mystique. However, years before that moment, Destiny had warned Mystique that, on that date, Cooper would go to murder her. Mystique defeated Cooper and used her metamorphic powers to impersonate her. \"Cooper\" (really Mystique) then appeared in the news talking about Mystique's murder, and introducing the Federal agent in charge of the investigation: Jacob Reisz.\n\nDuring [[Rogue]]'s stay in the Siege Perilous, a portion of [[Ms. Marvel (Carol Danvers)|Carol Danvers]] separated from her. As an independent being, \"Carol\" went to Muir Island. She was then attacked by Legion, MacTaggert and Sefton. Carol defeated all of them, but Farouk then projected through Legion and mind-controlled Carol. Farouk found Rogue in the [[Savage Land]] and send Carol there, ordering her to steal Rogue's life force. However, when she reached the Savage Land, she was destroyed by [[Magneto (Magnus)|Magneto]].\n\n[[Polaris]] and [[Siryn]] went to Muir Island soon afterwards, and both of them were captured and mind-controlled. Farouk had ambitious schemes and was afraid of other telepaths identifying him too soon. He needed a nexus between the astral and the psyonic planes, to generate a disturbance affecting other telepaths. Polaris's powers had been recently altered by [[Zaladane]], attracting Farouk's interest. Thus, Farouk chose Polaris to become that nexus.\n\nHe then mind-controlled MacTaggert to make her a fierce opponent to [[Genosha|Genoshan]] [[Genengineer]] [[David Moreau]] in a TV debate, and to make her lecherous when talking to her boyfriend [[Banshee|Sean Cassidy (Banshee)]].\n\n[[Phoenix (Jean Grey)|Jean Grey]] then tried to access the astral plane with Cerebro. Farouk easily overrid Cerebro's defenses and then noticed that Grey had lost her telepathic powers; only a telekinetic, Grey was helpless. [[Psylocke]] entered the astral plane to help her and threatened Farouk with her psiblade. Farouk mocked of Psylocke; her blade would hardly hurt him. Psylocke then used the blade on Grey, returning her to the physical world. However, both of them were so shocked that they could not remember the details of the encounter. Farouk's identity was not compromised.\n\nMutant teams [[X-Force]] and [[New Warriors]], both of them allies to MacTaggert, were having a problem with supervillain [[Proteus]]. They went to Muir Island to discuss a plan, but they were captured and mind-controlled. Farouk sent them against Proteus, but he had to relax her control on some of his other slaves. Proteus was eventually defeated, and afterwards Farouk again took full control of their slaves.\n\nFarouk found [[Colossus (Piotr Rasputin)|Colossus]], who was amnesiac believing to be an artist called Peter Nicholas. He mind-controlled Colossus and used him to threaten X-Men dance teacher [[Hunter, Stevie|Stevie Hunter]]. He was intimidated to allow Farouk access to [[Xavier Institute For Higher Learning|Xavier's School]].\n\nXavier, meanwhile, probed Storm's mind and discovered that the Shadow King was back.\n\nIn the astral plane, Farouk explained Lian his scheme: He wanted to cause extreme hatred and violence in the world to feed his power and then reign supreme. Lian remained him that the X-Men had always defeated him. However, Farouk considered that killing them was too merciful and wanted to subjugate them. He also mind-controlled newcomers Rogue and [[Strong Guy|Guido Carosella]].\n\nThe X-Men discovered Farouk's control over the Muir Island and sent a task force including Storm, Forge, Gambit, Banshee, Wolverine and [[Jubilee]]. Farouk sent his slaves to defend the Island, and they defeated the invaders.\n\nStevie Hunter drove her car near Xavier's School and crashed it near Xavier. Xavier ran to the car and took Hunter from the ravage. Farouk then projected himself to Xavier, using Hunter's mind, and offered a glimpse of the defeat of his X-Men. He then sent Colossus to kill Hunter and Xavier. Xavier stunned Colossus with his powers, and then tried to share thoughts with Hunter. Farouk tried to psi-blast Xavier, taking advantage of his distraction, and sent Colossus again. Xavier fought him and eventually restored Colossus's mind.\n\nFarouk returned to Reisz's body. Lian noticed that the body was quickly degenerating and suggested that Farouk could look for a living body instead of possessing corpses. Farouk tried to decide a good candidate, and considered Xavier's body, keeping one thought alive as a torture. He also increased the range of his scheme: He wanted to feed on the shadows of the human sould to expand and control all the universe.\n\nMeanwhile, Gambit, Jubilee and Wolverine fought other mutants in a gladiatorial fight. Wolverine tried to fight the mind control. He was ambushed by Forge, who attacked him with a [[neurosynaptic buffer]] to block Farouk's telepathic wavelengths. After testing his new device, Forge also freed Rogue and Banshee.\n\nFarouk was distracted causing riots in Salem's Center, Westchster, and sending a telepathic signal to Xavier. Xavier then decided to ask his students of [[X-Factor]] for help.\n\nX-Factor and Val Cooper (still Mystique in disguise) were fighting other Farouk-caused mobs in Washington D.C. They met with Xavier and decided to work with them. Reisz was among Cooper's teammates, but Xavier could not recognize him because of Farouk's nexus.\n\nXavier, X-Factor, Cooper and Reisz entered a [[S.H.I.E.L.D.]] submarine alongside with Colonel [[Vazhin, Alexi|Alexi Vazhin]], and went to Muir Island. During the trip, Xavier understood that Farouk needed both a human host and a nexus, and planned to cut both of the links. Reisz met with Cooper and told her that, no matter the telepathic dampeners, he wanted Xavier to see his X-Men die.\n\nThey reached Muir Island and were attacked by Farouk's slaves, including new acquisitions [[Multiple Man]] and Psylocke. X-Factor defeated them, but were then attacked by Legion. Reisz then ambushed Xavier and revealed that Cooper had been his pawn for a long time. However, Cooper revealed Reisz that she was really Mystique. She then shot Reisz in the head, destroying his brain. Due to the sudden cut of Farouk's control, Legion became unstable.\n\nX-Factor discovered that Farouk's nexus was Polaris, but in that time, Farouk possessed Legion. He ordered the slaves to cover themselves underground because he was going to use Legion's power to destroy the surface of Muir Island. However, Jean Grey's telekinesis protected X-Factor and X-Men.\n\nXavier sent two SHIELD agents, [[DeMarco]] and [[Heacock]], against Legion. DeMarco shot Legion with a plasm cannon. Legion's telekinesis deflected the attack and killed both DeMarco and Heacock. Vazhin, who was surveying the operation from a distance, ordered a tactic nuclear attack.\n\nXavier tried to sacrifice himself with a psychic mind-burst which would kill both him and Legion, and probably Farouk too. Farouk, however, managed to stun him before could send that. Storm then attacked Legion with a lightning bolt. Farouk went to the undergrounds to heal, and send his remaining slaves to kill his enemies. However, the X-Men had the neurosynaptic buffer and freed each of them.\n\nXavier recovered and used Jean Grey as a psi-anchor to fight Farouk in the astral plane. However, he was defeated. In revenge, Farouk shattered Xavier's bones in the legs and the spine. [[Archangel]], Colossus, Cyclops and Storm joined Grey in the astral plane to help Xavier, unaware of Legion's body hiding near their motionless bodies. They provided Xavier with more willpower and energy, but Legion was in a good position to destroy their bodies.\n\nForge use then Psylocke's psi-blade in Polaris, breaking Farouk's nexus. Farouk's energy dissipated, overcoming the X-Men. Xavier and Grey tried to absorb whatever they could and shield the others. Xavier also offered Farouk a chance to redeem, but he opted for the void. Legion's mind also switched off.\n\nAlthough defeated, the Shadow King could live feeding only on one dark thought in one man's heart. He only needed time and a chance...\n\n==The Eternity of the Shadow King: Surviving the Onslaught==\n\nAfter the [[Onslaught (event)]], Charles Xavier disappaared. The psyonic plane had suddenly lost its guardian. Farouk had found his chance.\n\nFarouk found [[Ainet]], who was both a dirt witch and Storm's stepmother. He mind-controlled her and adopted the identity of [[Ananasi]], the African spider-god. He used his powers to control Ainet and his tribes, preparing their minds. He then ordered Ainet to search Storm and bring him old X-Men to torture, new X-Men to taint, and a stupid telepath to control.\n\nAinet sent a package to Storm, with a dirt sculpture of herself. The sculpture asked Storm to help her against a \"great evil\". Storm decided to travel to Kenya alongside fellow X-Men Cannonball, [[Maggott]], [[Marrow]], Psylocke, [[Reyes, Cecilia|Cecilia Reyes]] and Wolverine, using Psylocke's shadow-melting power.\n\nThey found an enslaved Ainet and \"Ananasi\" made each fight their own inner nightmares. Storm stunned Ananasi with a bolt and went to Ainet. Ananasi recovered but Psylocke stabbed him with the psiblade, disrupting his mind. She recognized him as a telepath, but could not identify him.\n\nAnanasi pretended to be scared. Psylocke then took Storm to the astral plane to fight Ananasi. Ainet warned them of the treacherous nature of Ananasi, so Psylocke donned a mental armor.\n\nPsylocke injured Ananasi with the blade. The damage was sent to a tribesman's mind, and then passed to the next tribesman at thought's speed. This caused a chain reaction magnifying the assault a trillion times, which destroyed Psylocke's astral being. The psi charge was so intense and pure that it broke the psi-plane itself, assault the subconscious of every being on Earth. Most humans felt things such as déjà vu, nightmares, migraines or nosebleed. However, telepaths were overloaded and, in a sense, maimed. Jean Grey, [[X-Man|Nate Grey]], [[Cable]], [[Emma Frost]], [[Chamber]] and [[LaNiege, Bianca|Bianca LaNiege]] were devastated. [[Pryor, Madelyne|\"Maddie\" Pryor]], a psyonic construct who was in the psi-dimension when it exploded, was utterly destroyed.\n\nThe Shadow King then revealed and mocked on Storm's, Wolverine's and Cannoball's tortures. He tempted Maggott, Marrow and Reyes with their desires in exchange of loyalties. Meanwhile, chaos manifested in the world with the Shadow King controlling the astral plane.\n\nPsylocke was re-constructed as a creature of shadows due to her exposure to the [[Crimson Dawn]]. Nevertheless, she freed Ainet from the mind control, and together they freed Storm. Psylocke pretended to be tempted by Farouk's offer of becoming the Shadow Queen; however, she only wanted to distract him while Storm was freeing the other X-Men. Farouk saw through the trick and Psylocke sent the X-Men to the body plane. She herself remained behind, weakened.\n\nFarouk then extended his influence to all the population on Earth. This stretched his power too thin, leaving his astral form vulnerable. Psylocke then stabbed his own nexus, the psyonic equivalent of a soul, and decided to hold it inside herself. His power, separated from its source, dissipated into nothing. She had to keep a full focus to control Farouk, and never ever use telepathy again or he would be freed. She accepted the sacrifice, resisting even when Farouk tried to tempt her from the inside.\n\n==The Destiny of the Shadow King: Freedom from the nexus==\n\nHowever, Psylocke was eventually murdered in a fight with [[Vargas]]. This event fred Farouk.\n\nLooking for a host, Farouk decided to use [[Pierce, Donald|Donald Pierce]], leader of the [[Reavers]].\n\nHe then turned his aim to Rogue, because she imitated powers. If he could have her, he could access to all the people she ever absorbed, specially the X-Men and Xavier. He began by tormenting Rogue with his telepathy, telling her that he had manipulated the events that shaped her, Xavier and other mutants such as Destiny and Mystique (who had raised Rogue).\n\n\"Pierce\" then sent the Reavers to attack the X-Men in Sydney, Australia, and he himself assaulted Rogue. He disturbed her powers trying to control her. She eventually felt scared and ran away.\n\nHowever, Rogue managed to resist, using her past and her weakness to become a stronger person. She decided to use light to defeat Shadow and absorbed the King in her own body, becoming the new host. Pierce and the Reavers were defeated and turned to the authorities.\n\nAfterwards, the [[Shadow King (Earth-6141)|Shadow King]] from [[Earth-6141]] tried to invade Earth, but the original Shadow King from Earth-616 has been restrained in Rogue's body since then.",
        "categories": [
            "Mutants",
            "People who used to be dead but aren't anymore",
            "Villains",
            "X-Men"
        ]
    }
}