{
    "id": 1009435,
    "name": "Alicia Masters",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/40/4c003d40ac7ae",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1009435",
    "comics": {
        "available": 9,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009435/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17460",
                "name": "Fantastic Four 1 2 3 4 (2001)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/16082",
                "name": "Fantastic Four: 1234 (2001) #2"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/16083",
                "name": "Fantastic Four: 1234 (2001) #3"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/16084",
                "name": "Fantastic Four: 1234 (2001) #4"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/38977",
                "name": "Fear Itself: FF (2011) #1"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/19501",
                "name": "Marvel Two-in-One (1974) #32"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/19506",
                "name": "Marvel Two-in-One (1974) #37"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/18751",
                "name": "The Thing (1983) #8"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/18752",
                "name": "The Thing (1983) #9"
            }
        ],
        "returned": 9
    },
    "series": {
        "available": 5,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009435/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/3292",
                "name": "Fantastic Four 1 2 3 4 (2001)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2579",
                "name": "Fantastic Four: 1234 (2001 - 2002)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/14102",
                "name": "Fear Itself: FF (2011)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/3715",
                "name": "Marvel Two-in-One (1974 - 1983)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/3667",
                "name": "The Thing (1983 - 1986)"
            }
        ],
        "returned": 5
    },
    "stories": {
        "available": 8,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009435/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/32850",
                "name": "\"2: Staring at the Fish Tank\"",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/32855",
                "name": "\"3: Darkness and the Mole Man\"",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/32860",
                "name": "\"4: Prime Mover\"",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/40123",
                "name": "Cover #40123",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/40125",
                "name": "Cover #40125",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/41360",
                "name": "Only The Invisible Girl Can Save Us Now!",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/41370",
                "name": "Game Point!",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/85537",
                "name": "Interior #85537",
                "type": "interiorStory"
            }
        ],
        "returned": 8
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009435/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1009435/alicia_masters?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Masters%2C_Alicia?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "blurb": "",
        "real_name": "Alicia Reiss Masters",
        "aliases": "Alicia Reiss (birth name); the name Alicia Masters-Storm was used by Skrull impostor Lyja, but was popularly believed to have been used by Alicia",
        "identity": "Publicly known",
        "occupation": "Sculptress",
        "citizenship": "Citizen of the United States of America",
        "place_of_birth": "New York City, New York",
        "relatives": "[[Puppet Master|Phillip Masters]] (stepfather), Marcia Reiss Masters (mother, deceased), Jacob Reiss (father, deceased)",
        "groups": "Associate of [[Fantastic Four]]",
        "education": "B.A. in Fine Arts",
        "height": "5' 4\"",
        "weight": "110 lbs.",
        "eyes": "Pale brown",
        "hair": "Reddish blonde",
        "powers": "She has no super powers, though she has temporarily possessed superhuman capabilities in the past. As a spider-creature, she had eight spider-legs, could project webbing from her mouth, and was immensely strong and durable. As the Bride of Nephrus, Alicia could project energy bolts through her crown. Alicia’s interstellar body-suit gave her quantum sight, the ability to see the universe’s energy patterns. She could manipulate those patterns to fly, an activate pre-existing dimensional gates. The suit offered protection against cosmic strength forces, but numbed Alicia’s emotions.",
        "abilities": "Alicia is an accomplished, world-renowned, neo-realist sculptress. Due to being blind, she is capable of sensing things other people can't, such as another's heartbeat or general presence.",
        "weapons": "",
        "paraphernalia": "",
        "debut": "Fantastic Four #8 (1962)",
        "origin": "Marvel Team-Up #6 (1973)",
        "significant_issues": "[[OHOTMU:Bibliography-AZ7#Masters, Alicia|See Complete Handbook Bibliography]]",
        "main_image": "Aliciamstrs.jpg",
        "bio_text": "The laboratory explosion which blinded young Alicia Masters for life also killed her father. Her mother married her father's partner, the man who would eventually become the [[Puppet Master]]. After her mother died, Phillip Masters raised Alicia alone.",
        "bio": "The laboratory explosion which blinded young Alicia Masters for life also killed her father. Her mother married her father's partner, the man who would eventually become the [[Puppet Master]]. After her mother died, Phillip Masters raised Alicia alone.\n\n\nWhen her stepfather used his abilities to control the [[Fantastic Four|Fantastic Four's]] [[Thing (Benjamin Grimm)|Thing]] and bring him to his apartment for revenge, Alicia sensed the presence of the [[Invisible Woman|Invisible Girl]], allowing the Puppet Master to trap her by flooding the room with ether. With the Invisible Girl captured, her stepfather dressed Alicia up to look like her and sent her with the Thing to the Baxter Building. But when the Thing attacked his teammates, the rest of the Fantastic Four lured him into a serum that [[Mister Fantastic]] had designed to return him to his human self, which broke the Puppet Master’s control. Alicia ran to Ben, and felt his face, but though it radiated the same strength and kindness he did as the Thing, she was relieved when he quickly transformed back into his, tragic and sensitive, rocky self.\n\n\nAlicia was left alone in their apartment after the Fantastic Four defeated her stepfather; afraid that he would return and force her to do things she didn’t want to. He did return, and revealed to her a puppet of himself in a king’s crown and robe. He announced that he would control the world with his puppets. But she resisted him, and in a struggle she tipped over his puppet, pushing him out of a window, seemingly to his death. Her stepfather’s apparent death was short-lived, however, and soon he returned to plague the Fantastic Four, and Alicia, for many years. Alicia quickly befriended the Thing, and they soon began a romantic relationship that also lasted many years.\n\n\nWhen the [[Silver Surfer]] first led [[Galactus]] to Earth, the Surfer was struck temporarily unconscious by blow from the Thing. Alicia took care of the Surfer, who was touched by her compassion. This meeting with Alicia led the Surfer to realize the worth of the human race, and to betray Galactus in their defense. He later returned to her but their friendship didn't last long, as the Thing grew jealous and fought with him, believing the Surfer would win Alicia away from him.\n\n\nAlicia was later kidnapped by the [[Enclave]] in order to use her blindness and skills as a sculptress to sculpt a bust of their creation, [[Warlock, Adam|Him]], as he initially gave off too much light for a sighted person to withstand. Alicia followed Dr. Hamilton into Warlock's cell, but Warlock sensed her goodness and allowed her in while he imprisoned Hamilton in living vines. She was the first person to see Warlock emerge from the cocoon which his body had surrounded him in, and was forced to stand by while he killed Hamilton and tore apart the Beehive. But the Fantastic Four soon saved her and teleported her out with them before Warlock could transport himself, as well, destroying the Beehive and killing his creators.\n\n\nOver time, Alicia and Ben's relationship grew stronger, and the two considered marriage several times. However, Ben's membership in the Fantastic Four continued to put Alicia at risk and she was occasionally kidnapped or used against Ben, most notably when she mutated into a spider-monster at the hands of [[Hydra]] and she was transformed into the Egyptian bride of [[Nephrus]]. When Alicia was hospitalized after a brutal attack by [[Annihilus]], their relationship grew troubled. Each came to the conclusion that their courtship should end, but before they could act on it, Ben was taken to the [[Beyonder]]'s [[Battleworld]] and Alicia was kidnapped by [[Skrulls]]. One of the Skulls, [[Lyja]] the Lazerfirst, took Alicia's place and masqueraded as her for a long period time, starting a romance with and eventually marrying the [[Human Torch (Johnny Storm)|Human Torch]]. When the Fantastic Four eventually rescued the real Alicia, she and Ben officially and amicably ended their romance, though they remain good friends. Her father has twice tried to manipulate their minds to reunite the pair, in [[Liddleville]] and [[Sunshine City]], but both efforts failed.\n\n\n[[image:Alicia in Cy-Phyrr Armor.jpg|thumb| Alicia in Cy-Phyrr Armor |left]]\nRecently, Alicia traveled into space with the Silver Surfer, and was given an interstellar body-suit by the alien robot [[Cy-phyrr 4]]. The suit gave her quantum sight, and the ability to see the universe’s energy patterns. She could manipulate those patterns to fly, an activate pre-existing dimensional gates. During this time along with the Surfer, she was intertwined in an elaborate plan to absorb the life essence from the Earth. The plan was set in place by the alien race known as the [[Mergence]]. Alicia was manipulated and harassed by [[Coroner]] and [[Tenebrae]] agents of the Mergence. She was eventually rescued by the Silver Surfer. She later permanently sacrificed her armor to save the lives of [[Mantis]] and several bystanders when Galactus attempted to devour the [[Shi'ar]] homeworld. During this time, Alicia and the Surfer conducted a romantic relationship, which ended when Alicia decided to remain on Earth while Surfer wanted to return to the stars. Alicia has since returned to her career as a successful sculptor.",
        "categories": [
            "Heroes",
            "Women",
            "Fantastic Four"
        ]
    }
}