{
    "id": 1009348,
    "name": "Happy Hogan",
    "description": "",
    "modified": "2010-11-03T10:00:46-0400",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/8/50/4ce5a00362b2c",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1009348",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009348/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009348/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009348/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009348/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1009348/happy_hogan?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Hogan,_Happy?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "blurb": "One of Tony Stark's closest confidantes!",
        "real_name": "Harold Joseph “Happy” Hogan",
        "aliases": "The Living Cobalt Time-Bomb, the Walking Bomb, Iron Man, the Freak, “Hap”",
        "identity": "Secret (as Iron Man and the Freak)",
        "occupation": "Former Tony Stark chauffeur, aide, assistant; former boxer and personal trainer; former head of Stark Foundation",
        "citizenship": "U.S.A.",
        "place_of_birth": "Brooklyn, New York",
        "relatives": "[[Potts Hogan, Pepper|Virginia \"Pepper\" Hogan]] (wife), unidentified father, Clay Hogan (brother), unidentified grandfather, unidentified foster daughter, unidentified foster son",
        "groups": "None; formerly: [[Iron Legion]]",
        "education": "Vocational school graduate, EMS training",
        "height": "5'11\" (as Freak, 7'9\")",
        "weight": "221 lbs. (as Freak, 789 lbs.)",
        "eyes": "Brown (as Freak, black or red)",
        "hair": "Brown (as Freak, none)",
        "powers": "As the Freak, Hogan could lift at least 10 tons and was impervious to gunfire, although the impact of bullets could cause him pain. During his third transformation, these powers were sufficiently magnified that he could lift from 20 to 50 tons; he also emitted cobalt radiation from his skin and could directly discharge it as energy blasts.",
        "abilities": "Under ordinary circumstances, Happy Hogan was an accomplished boxer and brawler, retaining his skills even after a decade or so out of the ring.",
        "weapons": "When he wore the Iron Man armor it contained a variety of weapons including repulsor rays, pulse beams, missile launchers, lasers, tasers, and flamethrowers. The unibeam in the center of armors chest can emit various types of light energy.",
        "paraphernalia": "When he acted as Iron Man he used Stark's armor. That was equipped with jet boots that able him to fly and a helmet that contained communication devices, scanning equipment and recording devices.",
        "debut": "Tales of Suspense #45 (1963); (Freak) Tales of Suspense #74 (1966); (Iron Man) Tales of Suspense #84 (1966)",
        "origin": "",
        "significant_issues": "discovered Tony Stark is Iron Man (Tales of Suspense #70, 1965); first became the Freak (Tales of Suspense #74, 1966); first donned Iron Man armor (Tales of Suspense #84, 1966); married Pepper Potts (Tales of Suspense #91, 1967); became Freak again (Iron Man #3, 1968); targeted by the Collector (Iron Man #26, 1970); became Freak yet again (Iron Man #84, 1976); fought Spymaster (Iron Man #210, 1986); joined Iron Legion against Ultimo (Iron Man #300, 1994); apparently dies after battle with Spymaster (Iron Man #14, 2007)",
        "main_image": "MikeFichera--Happy-Hogan-Main.jpg",
        "bio_text": "Harold \"Happy\" Hogan received his ironic nickname during his boxing days for his constant refusal to smile. Hogan rescued the playboy millionaire [[Iron Man (Anthony Stark)|Tony Stark]] (secretly the super hero Iron Man) when Tony’s car was involved in a brutal collision during a stock-car race. As a token of his gratitude, Stark hired the boxer as his personal chauffeur and bodyguard. Though Happy assumed he had landed a “nice quiet safe job” he became entangled in Tony’s dangerous world, coming face-to-face with villains such as Jack Frost (Gregor Shapanka), [[Scarecrow (Ebenezer Laughton)]], [[Unicorn|Unicorn (Milos Masaryk)]] and taken hostage by the [[Black Knight (Nathaniel Garrett)]]. While working, Hogan soon fell in love with Stark's secretary [[Potts, Pepper|Virginia \"Pepper\" Potts]] and romantically pursued her. Tony Stark’s deceptions, necessary to maintain his secret identity, alienated him from both Happy and Pepper, who grew closer together and began dating.",
        "bio": "Harold \"Happy\" Hogan received his ironic nickname during his boxing days for his constant refusal to smile. Hogan rescued the playboy millionaire [[Iron Man (Anthony Stark)|Tony Stark]] (secretly the super hero Iron Man) when Tony’s car was involved in a brutal collision during a stock-car race. As a token of his gratitude, Stark hired the boxer as his personal chauffeur and bodyguard. Though Happy assumed he had landed a “nice quiet safe job” he became entangled in Tony’s dangerous world, coming face-to-face with villains such as Jack Frost (Gregor Shapanka), [[Scarecrow (Ebenezer Laughton)]], [[Unicorn|Unicorn (Milos Masaryk)]] and taken hostage by the [[Black Knight (Nathaniel Garrett)]]. While working, Hogan soon fell in love with Stark's secretary [[Potts, Pepper|Virginia \"Pepper\" Potts]] and romantically pursued her. Tony Stark’s deceptions, necessary to maintain his secret identity, alienated him from both Happy and Pepper, who grew closer together and began dating.\n\n[[image:MikeFichera--Happy-love-triangle.jpg|thumb|left|250px]]When Happy heroically risked his life to help Iron Man combat the [[Titanium Man (Boris Bullski)]], he was struck by Titanium Man’s energy rays and left barely alive. Hogan was given an experimental cobalt ray treatment from Stark’s Enervator device and was initially healed but inadvertently transformed into the near-mindless monster called the Freak. Iron Man was able to reverse the transformation and during this incident, Happy revealed to Tony that he had deduced his secret identity. Meanwhile, seeing Happy come close to death made Pepper realize that she truly loved him.  While the couple’s romance blossomed, Happy still placed himself in danger, appearing in public as Iron Man to divert public suspicion about Tony’s alter-ego. Happy and Pepper eventually eloped and left Tony’s employ. \n\n\n[[image:MikeFichera--Happy-as-Freak.jpg|thumb|left|150px|as the Freak]]Happy experienced a second rampage as the Freak, triggered accidentally while he volunteered to help Tony construct new armor, and was again restored by Iron Man. Meanwhile, Happy and Pepper’s relationship began to suffer from the trials of day to day living. When Tony relocated from New York to Detroit for a time, Pepper separated from Happy to follow Tony and reclaim her old job. Happy caught Pepper and Tony sharing a kiss, causing additional tension, but the couple was able to move past it and reconcile. \n\nWhile hired as security chief for Stark International, Happy continued to pose as Iron Man at times to protect Tony’s identity. During this time Happy suffered his third and most monstrous transformation into the Freak, but was again depowered and told he was completely cured. The Hogans moved to Colorado, where they tried ranching, before settling in Cleveland, Ohio. Happy found work as a fight manager and he and Pepper became foster parents to a young boy and girl.\n\n[[image:MikeFichera--Happy-as-IM-with-Tony.jpg|right|thumb|150px|Happy (left) as Iron Man]]Later on, Hogan, along with other men who had experience using the Iron Man armor, was recruited by War Machine (James Rhodes) to don reserve armor suits as “the Iron Legion” to fight the gigantic robot Ultimo. Ultimately Tony Stark arrived and defeated it. \n\nHappy and Pepper faced financial difficulties and unemployment, and once again, the couple struggled with their relationship. Happy turned inward and began to drink excessively. Mistakenly believing Happy was cheating on her, Pepper had an affair with a high school friend, severely damaging the marriage. The two divorced. \n\nHappy experienced an awkward reunion with his ex-wife working under Tony's new business Stark Solution, where Pepper was also employed. Over time, Happy and Pepper were able to put their past behind them. They remarried and tried to start a family. The Hogans remained with Tony at Stark Industries following the failure of Stark Solutions. Pepper became pregnant, but was assaulted by Iron Man's armored enemy Ayisha and suffered a miscarriage. Pepper never told Happy about her pregnancy, and the absent communications resulted in a new strain on their relationship. Happy began drinking heavily again, and became angered when Tony accidentally revealed the pregnancy to him. Storming away from Tony, Happy was accidentally struck by snipers firing on Stark, but survived the attack.\n\nAs Tony became the primary proponent of the controversial Superhuman Registration Act, he was targeted by a new incarnation of the assassin Spymaster (Sinclair Abbot). Happy protected Tony from an attack by Spymaster, but sustained a massive head trauma during the fight. Happy was placed on life-support with severe brain injuries. Pepper begged Tony to use his ability to discretely interface with the life-support machines to “pull the plug” and end her husband’s suffering. After much hesitation and soul-searching, Stark complied, and Happy passed away.",
        "categories": [
            "Deceased",
            "Iron Man"
        ]
    }
}