{
    "id": 1009371,
    "name": "Iron Monger",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/40/image_not_available",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1009371",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009371/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009371/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009371/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009371/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1009371/iron_monger?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Iron_Monger?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "blurb": "",
        "real_name": "Obadiah Stane",
        "aliases": "None (Iron Monger battlesuit officially codenamed \"I-M Mark One\")",
        "identity": "Secret",
        "occupation": "(Stane) President and CEO Stane International, munitions dealer; former chess champion",
        "citizenship": "U.S.A.",
        "place_of_birth": "Unrevealed",
        "relatives": "Zebediah Stane(father, deceased), unidentified mother (deceased), [[Ezekiel Stane]] (son)",
        "groups": "Stane International",
        "education": "M.B.A.",
        "height": "(as Stane) 6’ 5”; (as Iron Monger): Unrevealed",
        "weight": "(as Stane) 230 lbs; (as Iron Monger): 4230 lbs.",
        "eyes": "Blue",
        "hair": "Bald",
        "powers": "None",
        "abilities": "Stane has a genius-level of intelligence and a fair hand-to-hand combatant with no known training.",
        "weapons": "The Iron Monger armor is made of [[Glossary:O#omnium|omnium]] steel, containing various offensive weapons including a powered exoskeleton that amplified Stane’s strength, repulsor ray fired from the gauntlets, and an intense laser beam housed in the armor’s chest unit. The armor also possesses the ability  to fly using magnetically powered turbine boot jets.",
        "paraphernalia": "",
        "debut": "(hand only) Iron Man #163 (1982); (fully shown) Iron Man #166 (1982); (as Iron Monger) Iron Man #200 (1985)",
        "origin": "Iron Man #198 (1985)",
        "significant_issues": "Became the Iron Monger, defeated, committed suicide (Iron Man #200, 1985)",
        "main_image": "IronMonger.jpg",
        "bio_text": "Obadiah Stane was the son of Zebediah Stane, a drunkard who was a failure in making a career for himself. One night, when Obadiah was only a child, his father returned to the hotel room where they were staying, having just won a great deal of money gambling. Apparently overjoyed, the elder Stane told Obadiah that his luck had changed, and to prove it, Zebediah played Russian roulette with himself, loading a single bullet into a gun, spinning the chamber, and then firing the gun at his head. The elder Stane thus killed himself with his first shot, traumatizing young Obadiah. Later, Obadiah decided that his father had realized that the world was his opponent against which he could not succeed, and had therefore intentionally committed suicide. Now orphaned, Stane was raised in a succession of foster homes.",
        "bio": "Obadiah Stane was the son of Zebediah Stane, a drunkard who was a failure in making a career for himself. One night, when Obadiah was only a child, his father returned to the hotel room where they were staying, having just won a great deal of money gambling. Apparently overjoyed, the elder Stane told Obadiah that his luck had changed, and to prove it, Zebediah played Russian roulette with himself, loading a single bullet into a gun, spinning the chamber, and then firing the gun at his head. The elder Stane thus killed himself with his first shot, traumatizing young Obadiah. Later, Obadiah decided that his father had realized that the world was his opponent against which he could not succeed, and had therefore intentionally committed suicide. Now orphaned, Stane was raised in a succession of foster homes. \n\nBy his eighth birthday, Obadiah Stane was completely bald as a result of the shock of witnessing his father's death. Ridiculed by his classmates for his baldness, Obadiah became introverted. He became fascinated by games of chance, especially chess. Obadiah believed that life was itself a game at which his father had lost, Obadiah determined that he himself would never lose at anything.\n\nOne of Stane's fellow students at his school, Bernie Devlin, was a better chess player than he. Devlin bested Stane in the penultimate match of a school chess tournament. The winner of the next game would win the tournament. Stane secretly slit the throat of Devlin's beloved dog, Ruffer, and hid the dog's corpse in Devlin's school locker. After finding Ruffer's body on the day of the final game. Devlin was so distraught that Stane easily won the tournament. This episode was the first major example of Stane's use of psychological warfare in order to get what he wished: Stane would discover his opponent's weakness and then exploit it. Stane became an international chess champion while in his teens.\n\nIn his early twenties Stane worked for an industrialist whom he came to regard as an incompetent. Perceiving that the industrialist's primary weakness was his love for his young wife Stane faked photographs showing the wife apparently engaged in an affair with the industrialist's best friend. The industrialist's morale was thereby destroyed, and Stane soon took control of the company himself. This was the beginning of Stane's accumulation of a massive fortune: he made his first million dollars by the age of twenty five. \n\nStane began selling munitions made by his company to whatever buyers offered the best prices for them, often to repressive dictatorships. Eventually, Stane built his company into a multinational corporation producing munitions that was based in Salt Lake City, Utah, with offices in various locations in the United States and abroad.\n\nStane decided to create a team of special bodyguards for himself, the [[Chessmen]], whose costumes and identities derived from Stane's love of chess.\n\nStane attempted to form an organization of European and Oriental industrialists, led by himself, that would act in defiance of antitrust laws, and even attempt to usurp power from the leaders of certain nations. [[Iron Man (Anthony Stark)|Anthony Stark]], the president and chairman of the board of Stark International, a leading American-based electronics and manufacturing corporation, opposed Stane's efforts to form such an organization. Stane had been seeking a worthy opponent against whom to compete in a new \"game\" of business maneuvers, and decided that Stark was the man he sought. Stane also knew Stark's principal weakness: Stark was a reformed alcoholic. At this point Stane had not yet realized that Anthony Stark was secretly the costumed champion Iron Man.\n\nFirst, Stane employed an agent codenamed Tattoo to bring about widespread sabotage at Stark International's Long Island headquarters. Iron Man thwarted Tattoo,but the latter died, having secretly been poisoned by Stane. Another of Stane's secret agents, a woman named Indries Moomji, encountered Stark and encouraged him to fall in love with her over the following weeks.\n\nDuring this time, Iron Man battled various members of the Chessmen. One of the latter, a Rook, held Stark's best friend, [[Rhodes, James|James Rhodes]], captured and poisoned by venomous spiders. Iron Man defeated the various Chessmen and rescued Rhodes, but Rhodes had to be hospitalized. Iron Man learned that Stane was behind these various actions against him and his company, and confronted Stane, but with no success. By now Stane's alliance of foreign corporations had succeeded in outbidding Stark International for certain major foreign contracts. Then men working for Stane attempted to abduct or kill Rhodes from his hospital bed; Rhodes escaped, but Stark did not know what had happened to him. Stark met with Stane, who arrogantly defied him. Terribly depressed and near despair, Stark met with Indries Moomji, who coldly and cruelly rejected him and his love for her, just as she and Stane had intended. For Stark this was the final blow: he began drinking alcohol heavily again, and quickly began his downward slide psychologically as a result.\n\nDue to various recent financial setbacks, Stark international had a number of large debts. Stane bought up all the company's debts and also initiated a number of civil suits of an unrevealed nature against the company. Stark himself no longer even tried to fight against Stane's obvious takeover attempt and instead sought solace in drunkenness. As a result, Stane succeeded in taking control of Stark international and becoming its new president and chairman of the board, displacing Stark in both roles. Stane renamed the corporation Stane International and banned Stark from the premises.\n\nA number of Stark International employees who were loyal to Stark and opposed Stane's takeover soon resigned, including Rhodes, Yvette Avril, and executive secretary Bambi Arbogast. Rhodes had already taken over the role of Iron Man from the now continually drunken Stark, and saw to it that Stark's other Iron Man armored suits were destroyed so that neither Stane nor the international law enforcement agency [[S.H.I.E.L.D.|SHIELD]] could make use of them. Stark had previously manufactured munitions for SHIELD, but had finally ended munitions production altogether. Stane had quickly resumed weapons contracts with SHIELD upon his takeover, and it has been speculated that Stane had had SHIELD's support all along in his effort to seize control of Stark International.\n\nStane arranged for a court order freezing Stark's financial assets, effectively rendering him penniless. Eventually, Stane formed an alliance with Stark's enemy and former lover Madame Masque, who had resumed control of her \"family\" in the criminal Maggia.\n\nAfter spending many months as a drunken derelict, Anthony Stark finally resolved to stop drinking after he delivered the baby of his friend, a fellow derelict named Gretl Anders during a snowstorm. Gretl died in giving birth, and in trying to keep the infant alive amidst the bitter cold, Stark was reawakened to the importance of life. Stark and the baby were both taken to a hospital. Rhodes went there as Iron Man to see Stark, who told him of his desire to rebuild his life. Shortly afterward, Stark, once again having overcome his alcoholism, joined Rhodes and the siblings Morley and Clytemnestra Erwin in founding Circuits Maximus, a new California-based electronics firm. Soon afterwards Stark brought about the defeat of the Termite, a superhuman criminal who had been hired by Stane to sabotage Fetison Electronics.\n\nStane was still convinced that Stark was a hopeless drunkard and was unaware of Stark's return to constructive activity, or even of his defeat of the Termite. Then, however, Stane learned that Stark was being sought by the latter's former lover Bethany Cabe. Intrigued as to why she was looking for him, Stane had Cabe captured.\n\nBy now Stane and Madame Masque were on the verge of becoming lovers. Moreover, Stane had correctly guessed by now that Anthony Stark had been the original Iron Man. Stane speculated that the Iron Man who had been active since Stark had become a derelict was either Rhodes or one of the Erwin siblings. Stane was not aware that recently Stark had reluctantly gone into action as Iron Man on a few occasions himself. Madame Masque warned Stane that her informants had told her that Stark had given up drinking and was active again.\n\nSeeking to destroy the new Iron Man, Stane dispatched the Circuits Breaker, a device with which he intended to kill Rhodes and the Erwins. Both garbed in Iron Man armor, Stark and Rhodes went into action against it, and Rhodes destroyed the weapon. Stane then realized that one of the two Iron Men who had attacked the Circuits Breaker must have been Stark.\n\nFor reasons that remain unclear, Stane had his employee, Dr. Theron Atlanta, exchange the consciousnesses of Cabe and Madame Masque. Then, as part of his new plot to destroy Stark, Stane had Stark's friends [[Potts, Pepper|Virginia \"Pepper\" Potts Hogan]] and Bambi Arbogast abducted, and even had Gretl's infant son Timothy Anders kidnapped. Rhodes, as Iron Man, thwarted the first attempt to abduct another of Stark's friends, Harold \"Happy\" Hogan. In retaliation, Stane tried to destroy Iron Man by sending a bomb to Circuits Maximus headquarters. It exploded, killing Morley Erwin and injuring Rhodes, and Stane's men succeeded in their second attempt to abduct \"Happy\" Hogan.\n\nStark blamed himself for not having stopped Stane before the latter had killed Erwin and had the others kidnapped. Determined to stop Stane now, Stark decided to return to his life as Iron Man, wearing a new, improved suit of armor he had recently designed. \n\nAfter Stane had taken over Stark International, a notebook of Stark's had been found there with cryptic notes about the workings and construction of Iron Man's armor. Stane set a team of scientists to work to build a battlesuit called the Iron Monger based on these notes. Stane intended to mass produce the suits, perhaps to outfit his own army and take over one or more nations.\n\nOn learning that Iron Man had invaded Stane International's Long Island headquarters, Stane realized this Iron Man was indeed Stark, and dispatched a Circuits Breaker and a team of Chessmen against him. After Iron Man easily overcame these threats, Stane donned the Iron Monger armor and went into battle against Iron Man himself. As Iron Monger, Stane failed to defeat Iron Man, so he finally resorted to the ploy of seizing the Anders infant and threatening to kill him unless Iron Man surrendered. Realizing that the Iron Monger armor was controlled by a computer in a nearby building, Iron Man destroyed the unoccupied building, causing the Iron Monger suit to become immobile. Stane dropped the baby, whom Iron Man caught and brought to safety. Stane gained some control over the armor, but not enough to avoid a crash landing.\n\nDefeated, Stane committed suicide by removing his helmet and firing a repulsor ray blast from his armor at his own head. Stark, as Iron Man, was the only person to witness Stane's death, and Stane's security personnel quickly removed the body from the scene.\n\nStark, as Iron Man, had already freed the Hogans and Mrs. Arbogast before Stane's death. Shortly after Stane's death Cabe and Madame Masque regained their rightful bodies. Stark regained control of his personal fortune, and decided to make no attempt to regain the presidency and chairmanship of the board of Stane International. Instead, Stark founded a new firm, Stark Enterprises, based in California. The Iron Monger armor somehow fell into the possession of industrialist Simon Steele, who sent an employee of his wearing the armor to kill the former adventurer [[Fortune, Dominic|Dominic Fortune]]. Stark, as Iron Man, defeated the Iron Monger, and the current whereabouts of the Iron Monger armor have not been revealed.\n\nStane's death was never reported in the news media. Only Stark, a few of Stark's associates, Stane's security personnel, and top-ranking SHIELD officials are aware of it. Following his death, Stane was replaced with a lifelike [[Glossary:L#LMD|LMD]] by the Deltite, a rogue android which had been manipulating SHIELD. Through the LMD of Stane, the Deltite was able to maintain SHIELD's interest in Stane International. The LMD was presumably destroyed. Stane International was later acquired by another of Stark's business rivals, Justin Hammer, but the property was eventually reacquired by Stark himself. Most of the corporation's assets were either absorbed into Stark's then-company Stark Enterprises or closed down.",
        "categories": [
            "Deceased",
            "Iron Man",
            "Iron Man",
            "Villains"
        ]
    }
}