{
    "id": 1009520,
    "name": "Purple Man",
    "description": "",
    "modified": "2011-06-14T17:29:03-0400",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/2/60/4c003c7030b39",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1009520",
    "comics": {
        "available": 4,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009520/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/8134",
                "name": "Daredevil (1963) #154"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/37193",
                "name": "Heroes for Hire (2010) #11"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/2222",
                "name": "New Thunderbolts (2004) #10"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/3030",
                "name": "New Thunderbolts Vol. 2: Modern Marvels (Trade Paperback)"
            }
        ],
        "returned": 4
    },
    "series": {
        "available": 4,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009520/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2002",
                "name": "Daredevil (1963 - 1998)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/13330",
                "name": "Heroes for Hire (2010 - 2011)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/788",
                "name": "New Thunderbolts (2004 - 2006)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1514",
                "name": "New Thunderbolts Vol. 2: Modern Marvels (2005)"
            }
        ],
        "returned": 4
    },
    "stories": {
        "available": 3,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009520/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/3886",
                "name": "4 of 6 - Reflections",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/15833",
                "name": "Arena of No Return!",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/94633",
                "name": "Heroes for Hire (2010) #11",
                "type": "cover"
            }
        ],
        "returned": 3
    },
    "events": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009520/events",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/events/302",
                "name": "Fear Itself"
            }
        ],
        "returned": 1
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1009520/purple_man?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Purple_Man?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Zebediah Killgrave",
        "aliases": "Killgrave the Purple Man, Killy",
        "identity": "Publicly known",
        "occupation": "Professional criminal, former spy",
        "citizenship": "Resident alien living in the United States with an international criminal record",
        "place_of_birth": "Rijeka, Yugoslavia",
        "relatives": "Melanie Killgrave (ex-wife); Kara Killgrave ([[Persuasion]], daughter)",
        "groups": "Formerly led a band of criminals, former partner of [[Electro (Maxwell Dillon)|Electro]]",
        "education": "Unrevealed",
        "height": "5'11\"",
        "weight": "165 lbs",
        "eyes": "Purple",
        "hair": "Purple",
        "powers": "Killgrave emits pheromones from his skin which render exposed people susceptible to his verbal control, an effect similar to hypnosis. He is capable of commanding several people at once, as long as they remain in proximity to him. Once removed from his presence, affected people eventually regain their sense of self. Only people with exceptionally strong willpower or radically different physiologies have been known to resist this effect. Killgrave’s mutated body also has an enhanced ability to heal itself.",
        "abilities": "Killgrave is experienced in espionage.",
        "weapons": "None",
        "paraphernalia": "Killgrave’s agents have employed a purple will-deadening gas to overcome victims in their employer’s absence. This gas is derivative of the same chemicals which gave Killgrave his power.",
        "debut": "Daredevil #4 (1964)",
        "origin": "Daredevil #4 (1964)",
        "significant_issues": "Fathered Persuasion (Alpha Flight #41, 1986); attempted kidnap of Karen Page (Daredevil #4, 1964); captured Daredevil in San Francisco, allied with Electro (Daredevil #88-89, 1972); battled Hawkeye and Two-Gun Kid in American Midwest (Marvel Tales #100, 1979); revealed as manipulator of Maxwell Glenn (Daredevil #147, 1977); manipulated Cobra, Gladiator, Jester, and Mr. Hyde into battling Daredevil (Daredevil #153-154, 1978); subjugated Jessica Jones (Alias #25-26, 2003);  sent to kill Daredevil by Kingpin, defeated by Daredevil, Iron Fist, Moon Knight, Power Man, and Spider-Man (Marvel Team-Up Annual #4, 1981); captured and used by Dr. Doom to become Emperor of the World (Avengers: Emperor Doom, 1987); manipulated by Dream Queen to attack ex-wife and daughter (Alpha Flight #62, 1988); attempted to conquer the world by manipulating X-Man (X-Man #34-36, 1998); confronted Jessica Jones (Alias #27-28, 2003-2004); manipulated Luke Cage (New Avengers #1-3, 2005); fought the Thunderbolts (Thunderbolts #91-93; 2005)",
        "main_image": "Purpleman.jpg",
        "bio_text": "Yugoslavian native Zebediah Killgrave was operating as a spy for the Communists when he was assigned a mission to steal an experimental nerve gas from the U.S. Army. Escaping from an Army base with a canister of the gas, Killgrave was fired upon by a soldier. A bullet punctured the canister, engulfing Killgrave with the released nerve gas. His hair and skin reacted to the nerve agent, permanently turning purple. Surrendering to the soldier, he was quickly released after offering a feeble excuse. Through this experience and similar subsequent events, Killgrave discovered that the nerve gas had given him the ability to command and control other people.",
        "bio": "Yugoslavian native Zebediah Killgrave was operating as a spy for the Communists when he was assigned a mission to steal an experimental nerve gas from the U.S. Army. Escaping from an Army base with a canister of the gas, Killgrave was fired upon by a soldier. A bullet punctured the canister, engulfing Killgrave with the released nerve gas. His hair and skin reacted to the nerve agent, permanently turning purple. Surrendering to the soldier, he was quickly released after offering a feeble excuse. Through this experience and similar subsequent events, Killgrave discovered that the nerve gas had given him the ability to command and control other people.\n\nTesting his newfound abilities at a bar in Buffalo, New York, Killgrave forced a young girl named Melanie to marry him. Eventually, Killgrave fell in love with the girl. Relinquishing his control over her, he hoped that she would still love him. Instead, when the manipulation was revealed, she left him. Relocating to Toronto, she secretly gave birth to their daughter, [[Persuasion|Kara]].\n\nIn subsequent years, Killgrave turned to a life of crime. Allowing himself to be arrested after a bank heist in New York City, he was to have [[Daredevil (Matthew Murdock)|Matt Murdock]] as his lawyer. Rather than go on trial, however, he manipulated the guard into letting him go. Attracted to Murdock’s legal secretary [[Page, Karen|Karen Page]], he kidnapped her, and thus incurred the attention of Murdock’s alter ego, Daredevil. Daredevil possessed significant willpower and was able to resist the Purple Man’s commands. Wrapping Killgrave in a plastic sheet to dampen his powers, Daredevil returned him to prison.\n\nKept in check by a special gas piped into his cell, the Purple Man again escaped when the apparatus malfunctioned. Killgrave relocated to San Francisco resumed his criminal activities. Here he was again confronted by Daredevil, who had also moved to the city. Killgrave armed his henchmen with a nerve gas similar to his own pheromones, but Daredevil was still able to resist the effect. Trying a new ploy, the Purple Man commanded the local citizenry to attack him. Enlisting the aid of [[Petrovich, Ivan|Ivan Petrovich]], an ally of the [[Black Widow (Natasha Romanova)|Black Widow]], Daredevil managed to escape. Killgrave also sought aid, allying himself with [[Electro (Maxwell Dillon)|Electro]]. Ultimately, however, the villainous pair suffered defeat.\n\nPersistently eluding capture, the Purple Man reemerged in the American Midwest, where he established an underground base. His plans were foiled when [[Hawkeye (Clint Barton)|Hawkeye]] and the [[Two-Gun Kid]] stumbled in on his operation and destroyed the compound.\n\nKillgrave moved back to New York City, where he decided to try his hand at corporate crime. Through the use of his powers, he took over Glenn Industries and its head, Maxwell Glenn. Killgrave forced the executive into committing multiple felonies. This eventually gained the notice of Daredevil who captured Glenn and turned him in. Although Glenn confessed, Daredevil was suspicious, and on a hunch discovered the Purple Man’s involvement in the plot. Still unable to manipulate Daredevil, Killgrave fled. This was too late for Maxwell Glenn, however, who committed suicide.\n\nUnbeknownst to Daredevil, Killgrave had discovered his secret identity. The Purple Man recruited [[Mister Hyde]] and [[King Cobra (Klaus Voorhees)|Cobra]] to kidnap the hero and take him to the Ryker’s Island prison. Succeeding, the pair were joined there by the [[Jester]] and [[Gladiator (Melvin Potter)|Gladiator]]. These odds were evened out when the [[Paladin]] came to Daredevil’s defense. Overmatched, Killgrave fell into the ocean and appeared to have drowned.\n\nHowever, Killgrave survived and recuperated. While using his powers to provoke a riot, he encountered the hero [[Jones, Jessica|Jewel (Jessica Jones)]]. Controlling her through his pheromones, he forced Jones to be his personal servant, subjecting her to daily humiliation as revenge for his repeated defeats. After several months, an irate Purple Man sent her to the [[Avengers Mansion]] to kill Daredevil. She attacked the [[Scarlet Witch (Wanda Maximoff)|Scarlet Witch]], the first hero she saw, but snapped out of Killgrave’s control. Fleeing, she was ultimately felled by a blow from the [[Vision]]. The [[Avengers]] discovered that she had been under the control of the Purple Man and Daredevil dispatched him yet again.\n\nNever imprisoned for long, Killgrave again escaped, but decided to retire from crime. This changed, however, when he was involved in a car accident with two of the [[Kingpin]]’s goons. Enraged that they had damaged his purple Rolls Royce, Killgrave forced the two men to fight each other. Hearing of this, the Kingpin sent out one of his agents to test the Purple Man’s power. The agent led Killgrave to the Kingpin and he attempted to control the crime boss. However, the Kingpin’s willpower was too strong. Instead, the Kingpin used Killgrave to do his own bidding. He sent Killgrave out on a mission to kill Daredevil. Due to an increase in Killgrave's power over time, Daredevil was no longer able to resist him. But, the hero was assisted by the combination of [[Luke Cage]], [[Iron Fist (Danny Rand)|Iron Fist]], [[Spider-Man (Peter Parker)|Spider-Man]], and [[Moon Knight]]. Wearing earplugs so that he could not hear the Purple Man's voice, Moon Knight punched him out and Killgrave was taken into police custody.\n\nLater relocating to French Polynesia, Killgrave determined to use his powers merely for his own hedonistic pleasure, rather than futilely confronting costumed heroes. Once again, though, his powers proved too attractive a lure to power-hungry villains. The [[Latveria]]n despot [[Doctor Doom (Victor von Doom)|Doctor Doom]] tracked down and captured Killgrave, taking him to [[Doom Island]], a Caribbean island owned by the dictator. Doom amplified the Purple Man’s powers using his [[Psycho-Prism]], planning to subjugate the entire world. But, Doom discovered that the absolute power he wielded proved unsatisfying, and when [[Wonder Man (Simon Williams)|Wonder Man]] resisted the Purple Man’s control, Doom decided not to stop the ensuing revolt. [[Sub-Mariner|Namor the Sub-Mariner]] destroyed Doom’s Psycho-Prism and the Purple Man was seemingly killed.\n\nIn fact, Killgrave was still alive, albeit buried and comatose. His body repaired itself slowly, though his mind, prodded by the demonic [[Dreamqueen]], gave way to delusions. Believing himself to be a living corpse, the Dreamqueen manipulated him into attacking his ex-wife Melanie and their daughter Kara. The latter had by this time become known as the super-heroine Purple Girl and affiliated with the Canadian team [[Alpha Flight]]. Manipulating his family’s minds as well, the Dreamqueen made it appear as though the Purple Man perished in an explosion.\n\nThe Purple Man recovered fully, however, and decided to attempt world domination for himself. Using his pheromones, Killgrave dominated the powerful [[Glossary:M#mutant|mutant]] Nate Grey ([[X-Man]]). This backfired when he bragged to Grey about his powers and the mutant adjusted his psychic shields to block Killgrave’s control.\n\nDefeated by the [[Defenders]], Killgrave was imprisoned at the [[Raft]], a jail designed for super-powered criminals located near Ryker’s Island. There, he again met Jessica Jones, who was now working as a private investigator in the employ of a group people whose family members had met their demise while in the control of the Purple Man. Instead of confessing his guilt, Killgrave ridiculed Jones. Later, when [[Carnage (Cletus Kasady)|Carnage]] broke out of the prison, he also escaped and confronted Jones at her house. However, [[Phoenix (Jean Grey)|Jean Grey]] had given Jones a psychic switch to prevent the Purple Man from controlling her again. This time, she was able to resist him and knocked him out.\n\nWhen Electro created a riot at the prison, the Purple Man was again freed from his cell. When the Avengers responded to the riot, Killgrave turned his attention to Luke Cage, ordering him to attack his teammates, including Jessica Jones and the unborn child she was carrying. But, the Purple Man’s power were not at full potency due to drugs which  had been planted into his food during his imprisonment. After finding out the Purple Man's plan, Cage shook off his control and nearly beat Killgrave to death.\n\nLater, the Purple Man attempted to manipulate the [[Thunderbolts]], unaware that he himself was being controlled by [[Baron Zemo (Helmut Zemo)|Baron Zemo]]. After turning the team against each other, he was defeated by the Thunderbolts member [[Photon (Genis-Vell)|Genis-Vell]]. Zemo teleported the Purple Man back to him and tortured him for his failure before sending him back to the Raft.",
        "categories": [
            "Villains",
            "International",
            "Marvel Knights"
        ]
    }
}