{
    "id": 1009619,
    "name": "Gwen Stacy",
    "description": "Peter Parker's first true love, Gwen Stacy was killed during a rescue attempt by Spider-Man, the guilt from which Peter has never overcome.",
    "modified": "2011-08-02T17:58:29-0400",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/8/40/4c003ad20ab78",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1009619",
    "comics": {
        "available": 12,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009619/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/37902",
                "name": "Amazing Spider-Man (1999) #7"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/35517",
                "name": "Amazing Spider-Man (1999) #655"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/40886",
                "name": "Amazing Spider-Man (1999) #655 (2nd Printing Variant)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/16906",
                "name": "Amazing Spider-Man Annual (1964) #5"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/16890",
                "name": "Amazing Spider-Man Annual (1964) #16"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/8464",
                "name": "Deadpool (1997) #11"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/1879",
                "name": "Marvel Masterworks: The Amazing Spider-Man Vol. 7 - (Hardcover)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/37584",
                "name": "Spider-Man: The Original Clone Saga (Trade Paperback)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/37641",
                "name": "Spider-Man: With Great Power Comes Great Responsibility (2010) #1"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/28949",
                "name": "Ultimate Comics Spider-Man Vol. 2 (Trade Paperback)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/4768",
                "name": "X-Statix Presents: Dead Girl (Trade Paperback)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/3433",
                "name": "X-Statix Presents: Dead Girl (2006) #1"
            }
        ],
        "returned": 12
    },
    "series": {
        "available": 10,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009619/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/454",
                "name": "Amazing Spider-Man (1999 - 2013)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2984",
                "name": "Amazing Spider-Man Annual (1964 - Present)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2005",
                "name": "Deadpool (1997 - 2002)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1389",
                "name": "Marvel Masterworks: The Amazing Spider-Man Vol. 7 - (2005)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/6684",
                "name": "Spider-Man: Death & Destiny (2000 - 2010)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/13511",
                "name": "Spider-Man: The Original Clone Saga (2010 - Present)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/13532",
                "name": "Spider-Man: With Great Power Comes Great Responsibility (2010 - 2011)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/10534",
                "name": "Ultimate Comics Spider-Man Vol. 2 (2010)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1017",
                "name": "X-Statix Presents: Dead Girl (2006)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1670",
                "name": "X-Statix Presents: Dead Girl (2006)"
            }
        ],
        "returned": 10
    },
    "stories": {
        "available": 11,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009619/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/5688",
                "name": "1 of 5 - A Long Time Dead",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/24527",
                "name": "Deadpool (1997) #11",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/35406",
                "name": "",
                "type": "profile"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/35456",
                "name": "Cover #35456",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/52185",
                "name": "Part One: Focus",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/63093",
                "name": "Cover #63093",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/78542",
                "name": "Amazing Spider-Man (1999) #655 - Int",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/83096",
                "name": "Spider-Man: The Original Clone Saga TPB",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/83206",
                "name": "SPIDER-MAN: WITH GREAT POWER COMES GREAT RESPONSIBILITY 1",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/92597",
                "name": "Amazing Spider-Man (1999) #655, 2nd Printing Variant - Int",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/94907",
                "name": "Amazing Spider-Man (1999) #7",
                "type": "cover"
            }
        ],
        "returned": 11
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009619/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1009619/gwen_stacy?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Stacy%2C_Gwen?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Gwendolyne \"Gwen\" Stacy",
        "identity": "No dual identity",
        "occupation": "College student",
        "place_of_birth": "Unrevealed, presumably New York City",
        "groups": "None",
        "citizenship": "U.S.A.",
        "education": "College educated (science major, incomplete)",
        "aliases": "\"Gwendy\"",
        "relatives": "[[Stacy, George|George Stacy]] (father, deceased), Helen Stacy (mother, deceased), [[Gray Goblin (Gabriel Stacy)|Gabriel Stacy]] (son), Sarah Stacy (daughter), Arthur Stacy (uncle), Nancy Stacy (aunt), Paul Stacy (cousin), [[Stacy, Jill|Jill Stacy]] (cousin), Gwen Miles and other Gwen Stacy clones (genetic identicals, some deceased)Richard Parker (son)",
        "height": "5'7\"",
        "weight": "130 lbs.",
        "eyes": "Blue",
        "hair": "Blonde",
        "powers": "None",
        "abilities": "Gwen Stacy was a gifted scholar in the field of biochemistry",
        "debut": "Amazing Spider-Man #31 (1965)",
        "origin": "none",
        "significant_issues": "At ESU, first met Peter Parker (Amazing Spider-Man #31); witnessed Peter Parker declare he's Spider-Man, disbelieved(Amazing Spider-Man #87, 1970); father, Capt. George Stacy, killed (Amazing Spider-Man #90, 1970); in London with Uncle Arthur (Amazing Spider-Man #95, 1971); in Savage Land, kidnapped by Kraven (Amazing Spider-Man #103, 1971); killed by the Green Goblin (Amazing Spider-Man #121, truth of relationship and children with Norman Osborn revealed to Peter Parker (Amazing Spider-Man #512, 2004)",
        "main_image": "GwenStacy442.jpg",
        "bio_text": "Gwen Stacy was [[Spider-Man (Peter Parker)|Peter Parker]]'s first true love. Next to the death of his [[Parker, Ben (Uncle Ben)|Uncle Ben]], no death has weighed as heavily upon Spider-Man's shoulders as her passing.",
        "bio": "Gwen Stacy was [[Spider-Man (Peter Parker)|Peter Parker]]'s first true love. Next to the death of his [[Parker, Ben (Uncle Ben)|Uncle Ben]], no death has weighed as heavily upon Spider-Man's shoulders as her passing.\n\nGwen came to Empire State University from Standard High School, where she had been the resident \"beauty queen\". Arriving at ESU, she and fellow science major [[Green Goblin (Harry Osborn)|Harry Osborn]] befriended jock [[Thompson, Flash|Flash Thompson]]. Flash attempted to introduce Harry and Gwen to Peter, his high school classmate, during their first chemistry lab. When a preoccupied Peter unintentionally ignored Flash and his new friends, popular Gwen and wealthy Harry did not take kindly to the perceived snub. Spitefully, Harry sabotaged Peter's lab experiment - setting the stage for a rocky start to their eventual friendship.\n\n[[image:Gwen-miniheadshot.jpg|thumb|left]]Peter had too much on his plate to worry about building friendships at school. His aunt, [[Parker, May (Aunt May)|May Parker]], was recovering from radiation poisoning; he was still licking his wounds from his recent battles as Spider-Man against [[Kraven (Sergei Kravinoff)|Kraven the Hunter]], the [[Molten Man]], the [[Looter]], [[Stromm, Mendel|Mendel Stromm]], and the [[Green Goblin (Norman Osborn)|Green Goblin]]; and he had just broken up with girlfriend [[Brant, Betty|Betty Brant]].\n\nOver time, Peter reconciled with Gwen, Harry, and Flash - transcending his reputation as a standoffish scholarship student. Despite her friends' misgivings about the bookish Peter, Gwen's intuition to her there was more to him than met the eye.\n\nGwen's emotional breakthrough occurred after Peter turned up at ESU one day on his new motorcycle - a move that greatly surprised her and the rest of the gang. Having just defeated the Green Goblin, Peter was riding high - and for once, free of his many problems. Re-examining her previously held opinion, Gwen found in her heart a true romantic attraction - one Peter clearly returned.\n\nTheir budding relationship was immediately tested by the arrival of [[Watson-Parker, Mary Jane|Mary Jane Watson]] - the spunky glamorous niece of Aunt May's friend, Anna Watson. An aspiring model, Mary Jane quickly fell in with Peter's crowd and showed an interest in the young man she had been watching for some time - causing tension between her and Gwen. But Mary Jane was far too wild and free to settle her heart on any one man, and Gwen knew right away Peter was the one for her. The pair soon surrendered to their irresistible love.\n\n[[image:DancinGwen.jpg|thumb|left]]But because of Peter's hidden life as Spider-Man, it was clear their love affair would never run smoothly. Missed dates, unexplained absences, secrets he could never tell - all these things conspired to cast his relationship with Gwen as a roller coaster of confusion, tears, and reconciliation. But Gwen's wise father, retired police captain George Stacy, warmly approved of Peter and did what he could to keep the two young lovers together.\n\nThe [[Kingpin]] of crime brainwashed Capt. Stacy into stealing police records. After Peter published pictures exposing Stacy, the Kingpin kidnapped George and Gwen. Spider-Man and Norman Osborn (then an amnesiac to his escapades as the Green Goblin) rescued the two, though the Kingpin escaped. Subsequently, Gwen visited Norman to thank him for saving her and her father's lives. She found Norman despondent, yet powerfully alluring and charismatic. Feeling both sympathetic and attracted to Osborn, a spontaneous affair between the two ensued, leaving Gwen pregnant with twins. \n\nTragically, Gwen's father was killed protecting an innocent child during a battle between Spider-Man and [[Doctor Octopus (Otto Octavius)|Doctor Octopus]]. In his dying breath, George revealed that he knew who Spider-Man was beneath the mask, asking him to watch over Gwen. A bereaved Gwen held the hero responsible for her father's death. Peter withdrew while Gwen raged against his alter-ego. With her relationship with Peter in turbulence, and lacking parents at home, Gwen accepted the invitation of her Uncle Arthur and Aunt Nancy to live with them in London. Unable to reconcile how to convince Gwen to stay knowing she would ultimately find out he was secretly the person she hated, Peter let Gwen leave, while she silently hoped Peter would propose marriage to her. However, before long, Peter was unable to bear being without her, and flew to London on assignment with the [[Daily Bugle (Building)|Daily Bugle]], to convince Gwen to return. But an appearance of Spider-Man made the local papers, and Peter returned home fearing an obvious connection would be made. Despite his failed attempt to see Gwen, his heroic deeds convinced Arthur that Spider-Man couldn't be responsible for his brother's death. Listening to her uncle, and realizing she may have expected too much of Peter, Gwen returned home again, certain she could salvage her relationship. She was met by Peter's welcoming arms. During her absence, Norman became the Green Goblin again, Harry turned to L.S.D. while Mary Jane, his supposed girlfriend, blatantly flirted with Peter. \n\n[[image:GwenStacy01.jpg|220px|thumb|left]]Peter hinted at marriage to Gwen despite the constant trouble of leading a double-life - including secretly growing four extra arms for a time. Their love proved true and strong. Peter took Gwen with him on an expedition and photo shoot of the Savage Land in Antarctica, where Gwen acted as a model. The pair had an exciting adventure, encountering the colossal beast, [[Gog]], which took Gwen back to its master, Kraven the Hunter, to be his queen. Kraven and Gog were defeated by Spider-Man and [[Ka-Zar (Kevin Plunder)|Ka-Zar]].\n\nOnce Norman Osborn again recovered his memory of Peter's secret identity, he burned with a desire for revenge against Spider-Man. Gwen, now aware of her pregnancy, fled to Europe where she secretly carried the twins to full term after only a seven month gestation, giving birth to [[Gray Goblin (Gabriel Stacy)|Gabriel]] and Sarah. Osborn arranged to provide for the twins in Paris while Gwen returned home and reunited with Peter. Gwen argued with Norman that she should raise the children, assuming that Peter's love would enable him to overlook her infidelity and they would marry. Gwen confided only in Mary Jane, who had overheard the argument and promised to keep her secret. Osborn planned to raise the children to be heirs to the Goblin legacy. Hitting the wall-crawler where it would hurt most, and to rid himself of a young nuisance, the Goblin kidnapped Gwen and carried her to the top of the Brooklyn Bridge. Spider-Man arrived and was horrified to find the woman he loved in the hands of his nemesis. Spider-Man blazed into battle, but his ferocity was not enough to prevent the Goblin from pushing Gwen off the bridge. In his last desperate act to save his beloved, Spider-Man fired a slender web-line that caught Gwen by her ankle, stopping her fall before she hit the water. Her neck snapped. Raising her up, Spider-Man discovered she was already dead. The Goblin taunted him, saying that Gwen had been killed by the shock of the fall before he caught her.\n\n[[image:Death-of-Gwen-framed.jpg|right|200px|thumb]]\nEven though after Gwen's murder, Spider-Man's subsequent confrontation with the Green Goblin ended in Norman's apparent death at the hands of his own remote-controlled Goblin Glider, Peter's anguish did not die so readily. Several years have passes since her death yet Peter is still tormented by nightmares, and has agonized over how he might have saved Gwen's life if he had done something differently. Peter's love for Gwen lives on in his memory, and deep within his heart, even though his love for Mary Jane has long since become the guiding force in his life. Peter recently used money he was paid to protect a corrupt mob boss named Forelli from [[Digger (The Vegas Thirteen)|Digger]], a monstrous undead gamma-spawned creature, to establish a memorial library in Gwen Stacy's name. When the Scarlet Witch's powers transformed the entire world into an alternate reality set under the rule of [[Magneto (House of M)|Magneto]] (the [[House of M]]), Peter and Gwen were married and had a child, Richard. That reality terminated, and life was returned back to the current reality ([[Marvel Universe|Earth 616]]) with the majority of the world unaware of what had transpired.\n\nA genetically stable clone of Gwen, engineered by her college professor, Dr. Miles Warren (the [[Jackal]]), later appeared, but opted to have nothing to do with Peter Parker's life. Married to a clone of Miles Warren, the clone of Gwen (named Gwen Miles) attempted to live a peaceful life in suburban New Jersey until her husband was killed in a car accident after recklessly fleeing from Peter's clone, [[Reilly, Ben|Ben Reilly]]. The Jackal, now a genetically mutated creature, had resurfaced, and created several other clones of Gwen, but they lacked Gwen Miles stability, decomposing after a short time. During a conflict upon the Daily Bugle's roof, Gwen had an opportunity to kill the Jackal, but she lacked the resolve. The Jackal and [[Spidercide]] both fell from the rooftop and were apparently killed. Gwen Miles slipped away; her current whereabouts are unknown.",
        "categories": [
            "people",
            "Spider-Man",
            "women",
            "deceased"
        ]
    }
}