{
    "id": 1009478,
    "name": "Cassandra Nova",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/8/60/4c003d0f3c80c",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1009478",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009478/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009478/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009478/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009478/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1009478/cassandra_nova?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Nova%2C_Cassandra?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Cassandra Xavier",
        "identity": "No dual identity",
        "occupation": "Terrorist, former student",
        "place_of_birth": "New York City, New York",
        "groups": "Hellfire Club (Inner Circle)",
        "citizenship": "U.S.A. (legally deceased)",
        "education": "Various courses at [[Xavier Institute For Higher Learning|Xavier Institute]]",
        "aliases": "Cassandra Nova, Mummudrai, Anti-Self, Immensity",
        "relatives": "Brian Xavier (father, deceased), Sharon Xavier (mother, deceased), Charles Francis Xavier ([[Professor X]], brother), Cain Marko ([[Juggernaut (Cain Marko)|Juggernaut]], step-brother)",
        "height": "(True form) Variable; (human form) 5’4”",
        "weight": "(True form) Inapplicable; (human form) 115 lbs.",
        "eyes": "(True form) Inapplicable); (human form) Blue",
        "hair": "(True form) Inapplicable); (human form) None",
        "powers": "The mummudrai are able to copy the DNA of sentient beings and use it to construct physical bodies for themselves. The mummudrai can also manipulate the DNA it copies to act as a rapid healing factor or to phase through solid matter. Further, they can manipulate the DNA of others, breaking it down at the molecular level. After copying the DNA of Charles Xavier, the mummudrai Cassandra Nova accessed the full spectrum of latent mutant functions in his genome, granting itself vast psionic powers.",
        "abilities": "",
        "weapons": "",
        "paraphernalia": "",
        "debut": "New X-Men #114 (2001)",
        "origin": "New X-Men #121 (2002); New X-Men #126 (2002)",
        "significant_issues": "Copied Charles Xavier’s DNA, created physical form in-utero, attacked by unborn infant Xavier (New X-Men #121, 2002); revealed to have been stillborn, survived as cellular matter, rebuilt physical form (New X-Men #126, 2002); used Donald Trask to usurp control of “wild” Sentinels, telepathically confronted Charles (New X-Men #114, 2001); sent Sentinels to decimate Genosha, allowed herself to be captured by X-Men (New X-Men #115, 2001); escaped, vs X-Men, switched minds with Charles, publicly outed him as a mutant (New X-Men #116, 2001); secret discovered by Beast, telepathically coerced Beak to bludgeon him, left Earth with Shi’ar (New X-Men #117, 2001); mentally enslaved Lilandra, coerced her into sending Imperial Guard to attack X-Men (New X-Men #122-124, 2002); returned to Earth, vs Imperial Guard & X-Men, forced out of Charles’ body, tricked into possessing synthetic form pre-programmed to re-educate it (New X-Men #125-126, 2002); seemingly returned as member of Hellfire Club (Astonishing X-Men #12-13, 2005-2006)",
        "main_image": "Cassandra Novatf.jpg",
        "bio_text": "A member of a species of bodiless parasites composed of living emotional energy known as the Mummudrai, legendary for appearing to every being in-utero shortly before birth as their ultimate opposite, the creature that would become known as Cassandra Nova appeared to the unborn Charles Xavier, copying his DNA to create its own body, in effect becoming his twin sister. Sensing its monstrous thoughts, Charles attempted to kill the creature resulting in its physical body being stillborn; however, the mummudrai survived as chaotic cellular matter and clung to a sewer wall for decades, rebuilding its physical form and perfecting its effort to mimic human traits. Perceiving the womb it became aware was the entirety of the universe, Cassandra believed that only she and Charles were real, and that killing him meant mastery of the universe as she saw it. To that end, Cassandra lured dentist Donald Trask, nephew of [[Sentinels|Sentinel]] creator [[Trask, Bolivar|Bolivar]], and with his unwitting help she took control of a group of “wild” Sentinels, designed to adapt to their environment. Cassandra then sent the Sentinels to slaughter the population of the island nation of [[Genosha]] in the hope of weakening Charles, and subsequently confronted Charles and his mutant students, the [[X-Men]]. She was seemingly defeated after the X-Man [[Frost, Emma|Emma Frost]] broke her neck. Unbeknownst to the X-Men, Cassandra had actually switched minds with her brother. Trapped in Cassandra’s broken body, Charles attempted to warn the X-Men; however, Cassandra – in Charles’ body – used a gun to end the faux threat while at the same time infecting the X-Men with bacterial Nano-Sentinels she had secreted in her bloodstream. These microscopic machines began systematically dismantling the X-Men’s white cell immune structures, slowly weakening them.",
        "bio": "A member of a species of bodiless parasites composed of living emotional energy known as the Mummudrai, legendary for appearing to every being in-utero shortly before birth as their ultimate opposite, the creature that would become known as Cassandra Nova appeared to the unborn Charles Xavier, copying his DNA to create its own body, in effect becoming his twin sister. Sensing its monstrous thoughts, Charles attempted to kill the creature resulting in its physical body being stillborn; however, the mummudrai survived as chaotic cellular matter and clung to a sewer wall for decades, rebuilding its physical form and perfecting its effort to mimic human traits. Perceiving the womb it became aware was the entirety of the universe, Cassandra believed that only she and Charles were real, and that killing him meant mastery of the universe as she saw it. To that end, Cassandra lured dentist Donald Trask, nephew of [[Sentinels|Sentinel]] creator [[Trask, Bolivar|Bolivar]], and with his unwitting help she took control of a group of “wild” Sentinels, designed to adapt to their environment. Cassandra then sent the Sentinels to slaughter the population of the island nation of [[Genosha]] in the hope of weakening Charles, and subsequently confronted Charles and his mutant students, the [[X-Men]]. She was seemingly defeated after the X-Man [[Frost, Emma|Emma Frost]] broke her neck. Unbeknownst to the X-Men, Cassandra had actually switched minds with her brother. Trapped in Cassandra’s broken body, Charles attempted to warn the X-Men; however, Cassandra – in Charles’ body – used a gun to end the faux threat while at the same time infecting the X-Men with bacterial Nano-Sentinels she had secreted in her bloodstream. These microscopic machines began systematically dismantling the X-Men’s white cell immune structures, slowly weakening them.\n\n\nIn Charles’ body, Cassandra publicly outed him as a mutant. After the [[Beast (Henry McCoy)|Beast]] discovered her secret, Cassandra telepathically coerced the young student [[Beak]] to bludgeon him into a coma, and then left Earth with the alien [[Shi’ar]]. Cassandra mentally coerced the Shi’ar Empress [[Neramani, Lilandra|Lilandra]] into ordering the Imperial Guard to Earth to destroy all mutants under the premise they were infected with a mental plague. After the truth was revealed, the Imperial Guard joined with the X-Men in an attempt to stop Cassandra after she returned to Earth. As they all fell before her power, [[Phoenix (Jean Grey)|Jean Grey]] used the Cerebra computer to place a piece of Charles’ consciousness into the mind of every living mutant on Earth. When Cassandra used Cerebra in an attempt to kill all mutants, Charles’ consciousness was re-connected and he forced Cassandra out of his body. Now fleshless, the mummudrai desperately sought another body. Emma Frost presented it with what appeared to be its old body; however, it was a trap laid by Emma and her students, the [[Stepford Cuckoos]], who forced the Imperial Guardsman [[Stuff]] to transform its alien bio-computer body into a synthetic copy of Cassandra’s body. On entering the body, the mummudrai found itself trapped in a child-like state and forced to undertake pre-programmed tutelage.\n\nFor a time, it was suspected that the mutant student [[Ernst]] was the re-programmed Cassandra (and in at least one alternate future, that of Earth-15104, this was proven to be the case). Following the destruction of the school by the insane mutant [[Xorn]], [[Cyclops (Scott Summers)|Cyclops]] and the Beast searched the ruins for Cassandra’s body but found nothing. Cassandra has seemingly returned in adult form as a member of a new incarnation of the [[Hellfire Club]] who are working with Emma Frost to destroy the X-Men.\n\nRecently, The Hellfire Club plotted to steal a device that was in the mansion. While at first the members seemed real, it was later discovered that Cassandra had played a guilt trip on Emma Frost. Cassandra used Emma's guilt over the death of her students to get Emma to create a mental Hellfire Club, which she used to defeat all of Cyclop's X-Men with. She then used Kitty Pryde in order to get her body, stuff, out of the holding device it had been put it. Once she was freed, she attempted to take over Emma's body, but it is still unkown on whether or not she succeded.",
        "categories": [
            "Women",
            "Villains",
            "X-Men",
            "Mutants"
        ]
    }
}