{
    "id": 1009387,
    "name": "Quentin Quire",
    "description": "",
    "modified": "2014-02-07T13:41:04-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/6/40/4c003d7fc6294",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1009387",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009387/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009387/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009387/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1009387/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1009387/quentin_quire?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Kid_Omega?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Quentin Quire",
        "identity": "Secret",
        "occupation": "Adventurer, former student",
        "place_of_birth": "Unrevealed",
        "groups": "None, formerly [[Omega Gang]] (leader), Xavier Institute Student Body",
        "citizenship": "U.S.",
        "education": "Various courses undertaken at Xavier Institute for Higher Learning",
        "aliases": "None",
        "relatives": "Unidentified foster parents",
        "height": "5'8\"",
        "weight": "129 lbs.",
        "eyes": "Brown",
        "hair": "Brown, dyed purple",
        "powers": "Quentin Quire is an Omega-level telepath who is able to form and organize thoughts at the rate of ten million per second. Among his array of mental talents, Quentin is able to communicate telepathically over long distances, read the minds of others, manipulate the thoughts and bodily functions of others, and shield his mind against telepathic probes.",
        "paraphernalia": "Quentin has used his vast intellect to create a variety of devices, including anti-gravity floats and a helmet that inhibited telepathic powers.",
        "weapons": "As a member of the Omega Gang, Quentin wielded a bullwhip.",
        "debut": "(Unidentified) New X-Men #122 (2002); (as Quentin) New X-Men #134 (2003); (as Kid Omega) New X-Men #135 (2003)",
        "creators": "Grant Morrison",
        "origin": "Unrevealed",
        "significant_issues": "Learned of adoption, formed Omega Gang, attacked humans (New X-Men #134-135, 2003); captured Xavier, incited riot (New X-Men #136, 2003); defeated by Cuckoos, Sophie killed (New X-Men #137, 2003); experienced secondary mutation, physical form discorporated (New X-Men #138, 2003); encountered Phoenix Force, reformed, sought to resurrect Sophie, rejected, returned to disembodied state (X-Men: Phoenix – Endsong #1-5, 2005)",
        "title_graphic": "generic_headshot.gif",
        "main_image": "kid_o.jpg",
        "bio_text": "Young Quentin Quire was one of the top students at the [[Xavier Institute for Higher Learning]], having been inspired by [[Professor X|Professor Charles Xavier's]] dream of human/mutant brotherhood when he was 13 years old. Among his achievements, Quentin created a set of anti-gravity floats to grant mobility to the disembodied brain of his fellow student Martha Johansson. Devastated after learning that he was adopted, Quentin was pushed over the edge following the death of renowned mutant fashion designer Jumbo Carnation, supposedly at the hands of humans. He began to doubt Xavier's teachings, and developed a more negative and hostile view of the world and of humankind.",
        "bio": "Young Quentin Quire was one of the top students at the [[Xavier Institute for Higher Learning]], having been inspired by [[Professor X|Professor Charles Xavier's]] dream of human/mutant brotherhood when he was 13 years old. Among his achievements, Quentin created a set of anti-gravity floats to grant mobility to the disembodied brain of his fellow student Martha Johansson. Devastated after learning that he was adopted, Quentin was pushed over the edge following the death of renowned mutant fashion designer Jumbo Carnation, supposedly at the hands of humans. He began to doubt Xavier's teachings, and developed a more negative and hostile view of the world and of humankind.\n\nQuentin became addicted to the new designer drug \"Kick,\" which increased superhuman mutant powers but also altered the brain's metabolism. Quentin assembled a group of others that shared his beliefs about humans, calling them the [[Omega Gang]], and set about attacking both innocent humans and members of the mutant-harvesting U-Men group alike. Creating a helmet patterned after that worn by Magneto which prevented the use of telepathic powers, Quentin and the Omega Gang captured Xavier during an Open Day at the Institute and fomented a student riot. While the X-Men easily defeated the Omega Gang, the identical telepathic quintet named the Stepford Cuckoos sought to oppose Quentin. One of the Cuckoos, Sophie, whom Quentin was besotted with (much to her chagrin), empowered her sisters by taking a dose of \"Kick\" and utilizing the X-Men's mutant-locating device [[Cerebra]] to magnify their telepathic powers to a level higher than Quentin's. Defeating him, the strain seemingly proved too much for Sophie and she died.\n\nDue to his abuse of \"Kick,\" Quentin underwent a secondary mutation that caused his physical form to discorporate, leaving him a disembodied mind trapped in a containment unit. Later, when the cosmic avatar known as the [[Phoenix Force]] returned to Earth, its presence influenced Quentin to reconstitute himself. Creating a new physical form, he sought out his beloved Sophie. Remembering her death, Quentin exhumed her corpse and sought out the Phoenix Force to help resurrect her. The X-Men were able to trap the Force, but Quentin sought to free it and opposed the X-Men. During the clash, the Force was freed and it granted Quentin's wish, resurrecting Sophie. However, upon seeing Quentin, a disgusted Sophie chose instead to return to death. The Force ultimately merged with Jean and left, after which the heartbroken Quentin returned to his disembodied state.",
        "categories": [
            "X-Men",
            "Villains",
            "Mutants"
        ]
    }
}