{
    "id": 1010325,
    "name": "Betty Brant",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/9/a0/4c7c644f453fb",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010325",
    "comics": {
        "available": 16,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010325/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/37257",
                "name": "Alias (2003) #10"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/37255",
                "name": "Alias Omnibus (Hardcover)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/24421",
                "name": "Amazing Spider-Man (1999) #614"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/28227",
                "name": "Amazing Spider-Man (1999) #622"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/37071",
                "name": "Amazing Spider-Man (1999) #647 (MCNIVEN VARIANT)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/39291",
                "name": "Amazing Spider-Man (1999) #654.1"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/35517",
                "name": "Amazing Spider-Man (1999) #655"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/40886",
                "name": "Amazing Spider-Man (1999) #655 (2nd Printing Variant)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/35503",
                "name": "Amazing Spider-Man (1999) #665"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/40025",
                "name": "Amazing Spider-Man (1999) #665 (AMAZING SPIDER-MAN 665 I AM CAPTAIN AMERICA VARIANT)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/35513",
                "name": "Amazing Spider-Man (1999) #666"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/16906",
                "name": "Amazing Spider-Man Annual (1964) #5"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/16890",
                "name": "Amazing Spider-Man Annual (1964) #16"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/16543",
                "name": "Avengers: The Initiative (2007) #7"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/1879",
                "name": "Marvel Masterworks: The Amazing Spider-Man Vol. 7 - (Hardcover)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/41760",
                "name": "Venom (2011) #5 (2nd Printing Variant)"
            }
        ],
        "returned": 16
    },
    "series": {
        "available": 7,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010325/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/672",
                "name": "Alias (2003)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/13383",
                "name": "Alias Omnibus (2006)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/454",
                "name": "Amazing Spider-Man (1999 - 2013)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2984",
                "name": "Amazing Spider-Man Annual (1964 - Present)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1945",
                "name": "Avengers: The Initiative (2007 - 2010)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1389",
                "name": "Marvel Masterworks: The Amazing Spider-Man Vol. 7 - (2005)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/13911",
                "name": "Venom (2011 - Present)"
            }
        ],
        "returned": 7
    },
    "stories": {
        "available": 14,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010325/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/33364",
                "name": "Avengers: The Initiative (2007) #7 - Int",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/35407",
                "name": "",
                "type": "profile"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/35456",
                "name": "Cover #35456",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/54200",
                "name": "Amazing Spider-Man (1999) #614 - Int",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/61677",
                "name": "Amazing Spider-Man (1999) #622 - Int",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/78514",
                "name": "Amazing Spider-Man (1999) #665 - Int",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/78534",
                "name": "Amazing Spider-Man (1999) #666 - Int",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/78542",
                "name": "Amazing Spider-Man (1999) #655 - Int",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/82495",
                "name": "[untitled]",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/89209",
                "name": "Amazing Spider-Man (1999) #654.1 - Int",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/90821",
                "name": "Amazing Spider-Man (1999) #665, I Am Captain America Variant - Int",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/92597",
                "name": "Amazing Spider-Man (1999) #655, 2nd Printing Variant - Int",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/94453",
                "name": "Interior #94453",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/94768",
                "name": "Amazing Spider-Man (1999) #647, MCNIVEN VARIANT",
                "type": "cover"
            }
        ],
        "returned": 14
    },
    "events": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010325/events",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/events/305",
                "name": "Spider-Island"
            }
        ],
        "returned": 1
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010325/betty_brant?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Brant,_Betty?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Betty Brant",
        "identity": "No dual identity",
        "occupation": "Investigative journalist; former secretary/assistant, cultist",
        "place_of_birth": "Philadelphia, Pennsylvania",
        "groups": "[[Daily Bugle]] staff, Jameson News Digest staff, Students of Love",
        "citizenship": "U.S.A.",
        "education": "High school dropout",
        "aliases": "Betty Brant-Leeds",
        "relatives": "Eleonore Brant (mother, deceased), [[Brant, Bennett|Bennett]] (brother, deceased), [[Hobgoblin (Ned Leeds)|Ned Leeds]] (Hobgoblin, husband, deceased)",
        "height": "5'7\"",
        "weight": "125 lbs.",
        "eyes": "Brown",
        "hair": "Brown",
        "powers": "none",
        "abilities": "Betty is a highly capable investigative reporter. She has become proficient in martial arts and marksmanship, and is well versed in a variety of firearms.",
        "debut": "Amazing Spider-Man #4 (1963)",
        "main_image": "BettyBrant-Headshot.jpg",
        "bio_text": "Raised by a single mother and often disappointed by her weak-willed brother [[Brant, Bennett|Bennett]], young Betty Brant found herself drawn to strong men. While still in high school, she dated university student Gordon Savinski, a fast-living friend of her older brother. Gordon and the Brant siblings were a chummy trio for some time, but Savinski's wild and reckless ways gradually estranged Betty and endangered Bennett. When Gordon and Bennett incurred a huge gambling debt to mobster Blackie Gaxton, Savinski callously abandoned Bennett, leaving the Brants to face the consequences. Gaxton's thugs came to the Brant home, and Betty's mother, Eleonore, suffered permanent brain damage in the resultant scuffle.",
        "bio": "Raised by a single mother and often disappointed by her weak-willed brother [[Brant, Bennett|Bennett]], young Betty Brant found herself drawn to strong men. While still in high school, she dated university student Gordon Savinski, a fast-living friend of her older brother. Gordon and the Brant siblings were a chummy trio for some time, but Savinski's wild and reckless ways gradually estranged Betty and endangered Bennett. When Gordon and Bennett incurred a huge gambling debt to mobster Blackie Gaxton, Savinski callously abandoned Bennett, leaving the Brants to face the consequences. Gaxton's thugs came to the Brant home, and Betty's mother, Eleonore, suffered permanent brain damage in the resultant scuffle. \n\nForced to grow up fast, Betty dropped out of school so she could work to pay off her mother's medical bills and her brother's gambling debts. Betty's mother had been the personal secretary to [[Jameson, J. Jonah|J. Jonah Jameson]], the tyrannical publisher of the [[Daily Bugle]] newspaper. Perhaps out of sympathy for Betty or out of loyalty to Eleonore, Jameson offered Betty her mother's job at the Bugle, and Betty accepted. Patient, hardworking and capable, Betty proved to be one of the very few secretaries who ever managed to meet Jameson's demanding standards while tolerating the publisher's prickly personality. \n\nOver time, a mutual attraction developed between Betty and young Bugle photographer Peter Parker, secretly the costumed hero [[Spider-Man (Peter Parker)|Spider-Man]]. Peter bore a striking resemblance to Gordon Savinski; but unlike Gordon, Parker was quiet, serious, moral, responsible-in short, he seemed safe. Peter first noticed Betty when she stuck up for Peter's alter ego during one of Jameson's anti-Spider-Man tirades. Later, Peter and Betty grew closer when they shared an intimate chat in the wrecked Bugle offices after an attack by the [[Vulture (Adrian Toomes)|Vulture]]. Before long, they were a couple, and Betty became Peter's first real girlfriend. \n\nIntensely danger-shy after Gordon, Betty worried incessantly about the hazards of Peter's job, which often required him to photograph criminals and super-villains in action. When the criminal [[Enforcers]] came after Betty to collect on the Brant family's remaining debts, Betty tried to protect Peter by leaving town, then tried to wipe out the last of her brother's debts by recruiting [[Doctor Octopus (Otto Octavius)|Doctor Octopus]] to break Blackie Gaxton out of prison. When Spider-Man intervened, Gaxton was recaptured, but not before Bennett sacrificed himself to shield Betty from a stray bullet. A devastated Betty blamed Spider-Man for the tragedy at first, and Peter decided he could never share the secret of his double identity with her. Betty returned to her job at the Bugle, but found little peace there; she was soon menaced in turn by Doctor Octopus, the [[Sinister Six]] and her old boyfriend Gordon, who had become the superhuman mob enforcer [[Terrier]]. Spider-Man defeated all these foes, but his role in her brother's death still made her wary of him. \n\nDeeply insecure, Betty was often jealous of Peter's female friends, and she sometimes assumed that the oft-absent Peter was two-timing her, or had simply grown tired of her. Betty responded by dating [[Hobgoblin (Ned Leeds)|Ned Leeds]], a new reporter at the Bugle who only had eyes for her. For a time, Betty was romantically linked to both Peter and Ned while she tried to sort out her feelings. Eventually, a smitten Ned proposed marriage. Betty was still in love with Peter, but she craved the stability she thought Ned represented. While Betty stalled for time to make up her mind, Peter decided Betty would be better off without Spider-Man in her life and acted boorishly in an effort to drive her away altogether. Finally, seeing Peter injured after an encounter with Doctor Octopus, Betty realized she couldn't bear to love another man who lived dangerously. She left town again to think things through, and by the time she returned, she and Peter came to the mutual realization that the romantic spark between them was gone. Happily reunited with Leeds, Betty accepted Ned's proposal. \n\nEngaged for years, Ned and Betty finally got married despite the interference of the costumed criminal [[Mirage]], who tried to rob the wedding guests until he was subdued by Spider-Man. Jameson sent the couple to Paris on a \"working honeymoon\" to establish Ned as a European foreign correspondent; however, with Ned constantly off on assignment, Betty grew lonely and bitter. Separating from Ned and returning to New York, she sought comfort with Peter, who was tempted to rekindle their old romance; but when an angry Ned arrived to fight for Betty, Peter pretended he wasn't really interested in her and declared he never wanted to see either of them again, hoping this might bring the couple back together. Stung, Betty and Ned went away together to rebuild their marriage. \n\nNed continued to throw himself into his work as a Bugle reporter, a situation made much worse when the criminal [[Hobgoblin (Roderick Kingsley)]] secretly brainwashed Ned into acting as his accomplice and occasional stand-in. Ned became increasingly angry, violent and unstable. Betty began cheating on him with old friend [[Thompson, Flash|Flash Thompson]], prompting Ned to frame Flash for Hobgoblin's crimes. When Flash broke out of jail and sought refuge with Betty, Ned-as-Hobgoblin attacked Flash, and Betty saw Ned unmasked during the struggle. By this time, Kingsley had come to regard Leeds as a liability, and leaked word of Ned's double identity to the underworld. Hobgoblin's criminal rival [[Hobgoblin_%28Jason_Macendale%29|Jack O' Lantern (Jason Macendale)]] hired the Foreigner to kill Ned, who was murdered by the Foreigner's agents. Macendale would adopt Ned's gear to become the new Hobgoblin, though he would eventually be murdered by Kingsley. Betty, already reeling from the revelation of Ned's double life, had a complete breakdown after Ned's death. She became delusional and prone to hallucinations. \n\nThe broken Betty was easy prey for the Students of Love, a cult of brainwashed pawns led by the charismatic Teacher, a charlatan and supposed faith healer who stripped his followers of all their possessions. Spider-Man, Flash and Reverend Tolliver joined forces to free Betty, and the cult was destroyed in a fire. Deprogrammed and restored to relative mental health by Tolliver, but having lost all her belongings to the cult, Betty moved in with Flash. She reached a turning point during the demonic invasion of New York known as [[Inferno (event)| Inferno]], when demons posing as Spider-Man and the late Ned attacked Flash's home; Betty found new inner strength and used it to save herself and Thompson from the demons, though Thompson's home was destroyed in the process. Later, when the emotion-controlling villain [[Mister Fear (Alan Fagan)]] tried to manipulate Betty into killing Spider-Man, she resisted and helped defeat Fagan; in the process, she began to understand and overcome the fear of loneliness at the root of her desperate attachments to the men in her life. \n\nBetty and Flash drifted apart, and Betty began a long process of radically reinventing herself. Easing out of secretarial work and into reporting, Brant became an investigative journalist for the Bugle, eventually tracking the killers of her husband. Studying martial arts and marksmanship, a heavily-armed Betty even managed to hold her own against the [[Foreigner]]'s forces alongside Spider-Man, uncovering more details regarding the circumstances of Ned's death in the process. Less successful was her investigation of the Façade affair, during which the high-tech F.A.C.A.D.E. battle armor was stolen and used to murder Betty's colleague, Bugle photographer Lance Bannon. Working together, Spider-Man and Betty managed to defeat F.A.C.A.D.E., wrecking the armor, but its wearer escaped and was never identified (though one of the suspects, industrialist Archer Bryce, managed to arouse a romantic as well as professional interest in Betty). Nothing ever came of the Brant-Bryce attraction, though, nor did Flash succeed in his attempts to rekindle their romance at that time. Betty had a brief romantic interest in [[Scarlet Spider (Ben Reilly)|Ben Reilly]], who was murdered by the [[Green Goblin (Norman Osborn)|Green Goblin]]. \n\nBetty continues to work at the Bugle under the direction of her longtime bosses, Jameson and editor-in-chief [[Robertson, Joseph \"Robbie\"|Joe \"Robbie\" Robertson]]. Her notable friends and colleagues there have included secretary [[Grant, Glory|Glory Grant]] (who took over Betty's old job), city editor Kathyrn \"Kate\" Cushing and fellow reporters such as [[Urich, Ben|Ben Urich]], Joy Mercado, [[Jones, Jessica|Jessica Jones]] and young Kat Farrell, whom Betty has mentored to some extent. Brant's investigative reporting has helped crack a number of important criminal cases over the years. Her greatest and most personal triumph was exposing businessman Roderick Kingsley as the true Hobgoblin, finally clearing Ned's name in the process.\n\nIn the aftermath of Peter Parker publicly revealing his secret identity as Spider-Man, Betty proved herself to be a faithful, understanding and supportive friend to Peter. Betty  came to Spider-Man's aid in battle against his supernatural counter-point, Evo. Betty and Flash have renewed their romantic interest in each other.",
        "categories": [
            "Women",
            "Spider-Man"
        ]
    }
}