{
    "id": 1010346,
    "name": "Controller",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/3/60/4c003923719ff",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010346",
    "comics": {
        "available": 7,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010346/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/37772",
                "name": "Iron Man (1998) #12"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/9361",
                "name": "Iron Man (1968) #13"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/37773",
                "name": "Iron Man (1998) #13"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/9527",
                "name": "Iron Man (1968) #28"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/19930",
                "name": "Iron Man (1998) #55"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/22617",
                "name": "Marvel Masterworks: The Invincible Iron Man Vol. 5 (Hardcover)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/22618",
                "name": "Marvel Masterworks: The Invincible Iron Man Vol. 5 (Hardcover)"
            }
        ],
        "returned": 7
    },
    "series": {
        "available": 4,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010346/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2572",
                "name": "Iron Man (1998 - 2004)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2029",
                "name": "Iron Man (1968 - 1996)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/6250",
                "name": "Marvel Masterworks: The Invincible Iron Man Vol. 5 (2008 - Present)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/6249",
                "name": "Marvel Masterworks: The Invincible Iron Man Vol. 5 (2008 - Present)"
            }
        ],
        "returned": 4
    },
    "stories": {
        "available": 6,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010346/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/19198",
                "name": "Captives of the Controller",
                "type": ""
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/19537",
                "name": "The Controller Lives",
                "type": ""
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/42729",
                "name": "Iron Man Gallery",
                "type": "pinup"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/83385",
                "name": "Spoils of War",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/83386",
                "name": "Total Control",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/83388",
                "name": "A Question of Control",
                "type": "interiorStory"
            }
        ],
        "returned": 6
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010346/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010346/controller?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Controller?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Basil Sandhurst",
        "identity": "Secret",
        "occupation": "Criminal, former research scientist",
        "place_of_birth": "Kittery Point, Maine",
        "groups": "[[Crossfire's Mind Control Gang]]; (Formerly) agent of [[Thanos]], agent of the [[Master of the World]], agent of the [[Red Skull (Johann Shmidt)|Red Skull]]",
        "citizenship": "U.S.A.",
        "education": "Advanced degree in science, engineering",
        "aliases": "Alexander Basel",
        "relatives": "Vincent Sandhurst (brother, deceased)",
        "height": "(in exoskeleton) 6’2”",
        "weight": "(in exoskeleton) 565 lbs.",
        "eyes": "White",
        "hair": "Black",
        "powers": "Originally, the Controller had no superhuman powers, relying solely on his exoskeleton. Eventually, however, he developed the ability to first mentally control others and, later, to read their minds as well. His telepathic abilities have increased over time and from the absorption/use of the mental energies of his victims. When he utilized the mental energies of the psychic Sarah Jessup, the Controller could mentally dominate any of his victims without the need of slave discs or cybernetic systems.",
        "abilities": "Sandhurst is a capable scientist and inventor.",
        "weapons": "The Controller once used a Molecular Negatizer, a powerful beam capable of slicing through virtually any material by making molecules break apart.",
        "paraphernalia": "The Controller possesses a stainless steel exoskeleton body armor that has been micro-surgically attached to his body. The armor is covered with micro-circuited power converters designed to receive cerebral energies and convert it into physical strength, up to superhuman levels. At the full limits of his absorption, the Controller has even exhibited powers of levitation and the abilty to project bolts of pure force from his mind.",
        "debut": "Iron Man # 12",
        "origin": "Iron Man #12-13",
        "significant_issues": "Fought Iron Man in Armor Wars (Iron Man 226, 1987)",
        "main_image": "cont.jpg",
        "bio_text": "As a child, Basil Sandhurst grew up plagued with sickness and often lay bed-ridden for months. He grew up to become a scientist as a result of this childhood-- one where he often felt life was never under his control. However, his unorthodox practices and theories, all about harnessing the power of the human mind, only served to bar him from working with any legitimate research center. Instead, his brother Vincent managed to use his influence as a lawyer for Cord Industries to get Basil a job there. Vincent, himself less than scrupulous, hoped Basil would help him take over the company, but when Basil went on a rampage in the lab, Vincent accidentally pushed him into some experimental chemicals. The resultant explosion scarred and crippled Basil, leaving him once more bed-ridden and weak.",
        "bio": "As a child, Basil Sandhurst grew up plagued with sickness and often lay bed-ridden for months. He grew up to become a scientist as a result of this childhood-- one where he often felt life was never under his control. However, his unorthodox practices and theories, all about harnessing the power of the human mind, only served to bar him from working with any legitimate research center. Instead, his brother Vincent managed to use his influence as a lawyer for Cord Industries to get Basil a job there. Vincent, himself less than scrupulous, hoped Basil would help him take over the company, but when Basil went on a rampage in the lab, Vincent accidentally pushed him into some experimental chemicals. The resultant explosion scarred and crippled Basil, leaving him once more bed-ridden and weak.\n \nOut of guilt, Vincent set his brother up in an automated house and laboratory using money embezzled from Cord Industries. Basil eventually used the equipment to fashion a exoskeleton that would finally allow himself freedom of movement and control over his own destiny. In fact, he became determined to control the world. Using a Mental-Wave Absorbatron, Basil could tap into the mental energy of his victims and beam it to his exoskeleton, and the “slave discs” would help by remotely adding to the Absorbatron’s range of broadcast. In this manner, Basil, now calling himself the Controller, took over his entire town, starting with Vincent, who dared to confront his brother. \n\n[[Iron Man (Anthony Stark)|Tony Stark]] and Janice Cord happened to investigate Cord Industries and Basil took the opportunity to battle Iron Man, who he saw as a product of Stark’s “inferior” genius. Although the Controller seemed to have the upper hand, Iron Man was able to lead him out of range of the Absorbatron and defeat him.  \n\nWhile in prison, Basil found that the mental energies he had previously absorbed left him with enough power to take control over others’ minds. Thus, he arranged for his own transfer to a sanitarium and systematically took control over the staff and patients. After using his pawns to create a new Absorbatron for him, he also wanted to upgrade his helmet to avoid his previous defeat. He lured Tony Stark to the santitarium, forcing him to invent a helmet that no longer would allow him to travel out of range but could also fire destructive bolts of mental energy. Tony Stark battled the Controller as Iron Man until the circuits in the Controller’s helmet fried, a design Stark intentionally put in to foil the Controller.  \n \nLater, somehow he was contacted by [[Thanos]], who provided Sandhurst with alien technology to update and enhance his equipment. Now, Basil no longer needed the Absorbatron as he could absorb his victims’ mental energies directly from their slave discs. He was defeated, however, by [[Captain Marvel (Mar-Vell)|Captain Marvel]]. \n\nSandhurst continued to enslave others by moving to southern California and setting himself up as a New Age guru and attaching slave discs to visitors to his temple. At the time, Iron Man was seeking out any illegal use of technology stole from Stark Industries, which included the Controller, and Iron Man defeated him, destroying the Controller’s technology and leaving him wholly dependant on his life-support machines. \n\nEven still, the Controller continued his criminal activities. The [[Red Skull (Johann Shmidt)|Red Skull]] partnered with him to manipulate the [[Sub-Mariner]] into fighting [[Captain America (Steve Rogers)|Captain America]], but the Captain destroyed the slave disc that was controlling his friend and the two turned the tables on him. Briefly, the Controller set up a self-help clinic. By placing his “patients” in a device similar to a tanning salon booth, he would profess to cure their minds. In fact, he created the booths to mimic his slave disc technology. Thus, he would “cure” his victims, but not before using his powers to extort money for himself and boost the strength of his armor. He was again defeated by Iron Man who, as Tony Stark, tried to visit the clinic.\n\nAnother time, the Controller managed to place Sarah Jessup, a powerful psychic, under his control, feeding him more power than ever before and allowing him to control others without the need of his slave discs. He sought out Tony Stark for revenge, but as the two battled, they released a being called [[Mindstorm]], a psychic entity that manifested from Sarah Jessup’s mind.  They both had to contend with Mindstorm that resulted in the two enemies sharing each other’s minds for a brief time. Stark was able to destroy the Controller’s machines, but the process left Sarah dead and Basil in a vegetative state with only his machines keeping him alive. \n\nThe Controller next appeared hoping to capture the alien [[Photon (Genis-Vell)|Legacy (Genis-Vell)]]. He placed Captain Marvel ([[Rambeau, Monica|Monica Rambeau]]) under his control and sent her to fight Genis. The two were able to combine forces to defeat the Controller. As it happened, the Controller was trying to capture Genis as a test of his technology on behalf of the [[Master of the World]], who had revived him from his coma and appropriated his technology for himself.\n\nThe Master gave his other agents, the [[U-Foes]], a slave disc to attach to the [[Hulk]]. With the Hulk under their control, the U-Foes attacked the United Nations in order to use other discs to drain the knowledge of the scientists that were assembled there. The U-Foes were opposed by [[Iron Fist (Daniel Thomas Rand-K'ai)|Iron Fist]] and a new [[Heroes for Hire]] team, and they managed to free the Hulk and force the U-Foes to escape, but not before they had got what they came for.  The Master then ordered the Controller and the U-Foes to attack the Heroes for Hire, and when the Controller seemed about to be defeated, the U-Foes prepared to teleport away, leaving the Controller to take the fall for the Master’s plan. Instead, the Master double-crossed the villains, and the U-Foes were captured as well. \n\nWith the Master’s abandonment, the Controller was free to pursue his own agenda. He used his mental dominion to once again escape prison, setting himself up as a doctor, Alexander Basel, of a stress-management clinic. He managed to draw in high-profile clients, including businessmen and senators, and he would use his mind-control technology on them while they slept. Tony Stark attended the clinic, and the Controller saw an opportunity for revenge. He ordered Stark to fire Iron Man, not knowing that the two were one and the same. The conflict Stark felt led him to uncover the Controller’s influence, and he defeated the Controller as Iron Man. \n\nMore recently, the Controller was among those villains incarcerated in the [[Raft]] and escaped during a massive breakout.  He tried to set himself up as a crime boss in New York City, competing with many other villains, but he was ultimately captured by the new [[Avengers]].",
        "categories": [
            "People",
            "Villains",
            "Avengers"
        ]
    }
}