{
    "id": 1010990,
    "name": "Vulture (Blackie Drago)",
    "description": "Adrian Toomes, the Vulture, told his cellmate, Blackie Drago, the location of his Vulture costume.",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/5/50/4c00329c0dc23",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010990",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010990/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010990/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010990/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010990/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010990/vulture_blackie_drago?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Vulture_%28Blackie_Drago%29?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Blackie Drago",
        "aliases": "None",
        "identity": "Publicly known",
        "occupation": "Criminal",
        "citizenship": "U.S.A with a criminal record",
        "Place_of_birth": "Unrevealed",
        "relatives": "Unrevealed",
        "education": "Unrevealed",
        "height": "6'",
        "weight": "210 lbs.",
        "eyes": "Brown",
        "hair": "Black",
        "powers": "Possesses the same abilities as his predecessor. Superhuman strength and vitality while wearing a harness that enables him to have the ability to fly due to the Electromagnetic anti-graviton generator built into it. Can fly at speeds of up to 95 MPH for up to 6 hours & can attain maximum altitude of 11,000 feet. He doesn't have the same experience level as the original Vulture. He did add a protective helmet with a built-in shortwave receiver.",
        "abilities": "",
        "weapons": "",
        "paraphernalia": "",
        "debut": "Amazing Spider-Man #48 (May, 1967)",
        "origin": "",
        "significant_issues": "Defeated by Spider-Man and Kraven (Amazing Spider-Man #49, 1967); defeated by the original Vulture (Amazing Spider-Man #63,1968)",
        "main_image": "VultDrago.jpg",
        "bio_text": "",
        "bio": "After an alleged accident Adrian Toomes, the [[Vulture (Adrian Toomes)|Vulture]], told his cellmate, Blackie Drago, the location of his Vulture costume. As Toomes lay on his death-bed and wanting revenge on [[Spider-Man (Peter Parker)|Spider-Man]] , he easily gave the information to Drago. Drago lied as he promised Toomes he would use the costume to defeat Spider-Man once and for all.\n\nLater, Drago hijacked a prison car and drove through the prison gates. He found the vulture wings exactly where Toomes said they would be. Drago practiced his flying skills over Manhattan. Drago found that he was stronger than Toomes ever was and more inventive and thus designed a helmet with a short wave receiver. Blackie wasted no time starting a one-man crime wave adopting the mantle of the Vulture. The Vulture became the hot news topic in a matter of days.  His only goal was to make money by performing acts of air-piracy. Due to Spider-Man's cold and apparent weakness, Blackie attacked a helicopter and stole its shipment of uncut diamonds without difficulty. His infamy as New York's greatest villain attracted the attention of not only Spider-Man, but also one of Spider-Man's greatest enemies, [[Kraven (Sergei Kravinoff)|Kraven]] the Hunter. \n\nIn a major battle between Spider-Man, Kraven and the new Vulture, Kraven’s double-barreled ray missed Spider-Man and accidentally collided with the Vulture knocking him unconscious. This gave Spider-Man a chance to tear the ray out of Kraven’s vest and strike him with a heavy punch. Both villains lay defeated. Blackie was returned to prison. It was later revealed that the Toomes was alive and well.\n\nSubsequently, Blackie and Toomes joined forces to escape, each wearing a Vulture costume. Once they were free however, Adrian publicly defeated the phoney Vulture in order to humiliate him, and regain the recognition he deserved. A defeated Drago was taken away by the police, vowing never to wear the Vulture costume again.",
        "categories": [
            "People",
            "Villains",
            "Spider-Man",
            "Spider-Man Villains"
        ]
    }
}