{
    "id": 1010880,
    "name": "Fixer (Paul Norbert Ebersol)",
    "description": "",
    "modified": "2011-08-23T19:20:05-0400",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/40/image_not_available",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010880",
    "comics": {
        "available": 5,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010880/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/33346",
                "name": "Captain America (2004) #606 (HEROIC AGE VARIANT)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/37336",
                "name": "Thunderbolts (2006) #155"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/38615",
                "name": "Thunderbolts (2006) #155 (CAPTAIN AMERICA 70TH ANNIVERSARY VARIANT)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/35662",
                "name": "Thunderbolts (2006) #156"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/37333",
                "name": "Thunderbolts (2006) #163"
            }
        ],
        "returned": 5
    },
    "series": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010880/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/832",
                "name": "Captain America (2004 - 2011)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/18527",
                "name": "Thunderbolts (2006 - 2012)"
            }
        ],
        "returned": 2
    },
    "stories": {
        "available": 5,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010880/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/78867",
                "name": "Thunderbolts (2006) #156",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/82690",
                "name": "Interior #82690",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/82696",
                "name": "THUNDERBOLTS 155",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/90111",
                "name": "THUNDERBOLTS 155 CAPTAIN AMERICA 70TH ANNIVERSARY VARIANT",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/94772",
                "name": "Captain America (2004) #606, HEROIC AGE VARIANT",
                "type": "cover"
            }
        ],
        "returned": 5
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010880/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010880/fixer_paul_norbert_ebersol?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Fixer%20(Paul%20Norbert%20Ebersol)?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "debut": "Strange Tales #141",
        "creators": "",
        "real_name": "Paul Norbert Ebersol",
        "identity": "Publicly known",
        "occupation": "Adventurer",
        "place_of_birth": "Dayton, Ohio",
        "groups": "[[Thunderbolts]]; formerly [[Masters of Evil]], [[Hydra]], former partner of [[Mentallo]]",
        "citizenship": "U.S. Citizen with criminal record",
        "education": "Unrevealed",
        "aliases": "Techno",
        "relatives": "None",
        "height": "5'8\"",
        "weight": "160 lbs",
        "eyes": "Brown",
        "hair": "Bald, with black goatee",
        "powers": "Technological genius",
        "origin": "",
        "significant_issues": "",
        "main_image": "Fixer(Ebersol)_Head.jpg",
        "bio_text": "",
        "bio": "Paul Norbert Ebersol was born in Dayton, Ohio. He was a scientist who held a number of odd jobs, including auto mechanic, television repairman, and electronics laboratory assistant. He then became the second and more prominent Fixer, a supervillain and genius-level criminal inventor who has often worked for criminal cartels like HYDRA.\n\nIn his first appearance he escaped from prison, and teamed with his partner Mentallo in an attempted takeover of the New York S.H.I.E.L.D. headquarters, and even captured Nick Fury. Fixer and Mentallo were defeated by Tony Stark and S.H.I.E.L.D. troops. His connection with THEM was revealed; and THEM was later revealed as part of HYDRA. Behind the scenes, he was even revealed as the chief of the HYDRA Science Division.\n\nWith Mentallo, the Fixer later escaped prison again. They invaded the New York S.H.I.E.L.D. headquarters and captured the Thing. They then invaded the Baxter Building, battled the Thing and Nick Fury, and used Doctor Doom's time machine to bring Deathlok from his alternate future. Mentallo then mind-controlled Deathlok in an attempted assassination of the U.S. President, but Fixer and Mentallo were defeated by the Fantastic Four and taken into custody by S.H.I.E.L.D. The pair was freed from prison by a HYDRA force controlled by Baron Karza. Fixer created the living machine-intelligence Computrex, which was destroyed by the Micronauts, who then defeated Fixer and Mentallo.\n\nFixer and Mentallo then aided Professor Power in his attempt to add Professor X's powers to Mentallo's, but they were defeated by Spider-Man. Fixer attempted to loot Northwind Observatory of Bruce Banner's inventions, but was captured by Captain America. Fixer then invaded the West Coast Avengers Compound in an attempt to steal Iron Man's armor, but was defeated by Iron Man and Ka-Zar.\n\nWhen Baron Helmut Zemo formed the fourth incarnation of the Masters of Evil, Fixer served as his right-hand man. When the Masters of Evil invaded Avengers Mansion, Fixer created a device enabling Baron Zemo to control Blackout. Fixer helped engineer the capture of Captain America, Black Knight, and Edwin Jarvis. Fixer was apprehended by Ant-Man. Behind the scenes, Fixer was overpowered by the Super-Adaptoid, who changed places with him. The Super-Adaptoid disguised as the Fixer later escaped prison. The real Fixer was discovered by the Avengers in the Adaptoid's former confinement tube at Avengers Island. Fixer later escaped prison with Yellowjacket, who then spurned his romantic advances. The Fixer followed her and battled her and the Black Knight before escaping.\n\nIn Zemo's second incarnation of the Masters of Evil, the team changed their identity to the Thunderbolts, while Fixer adopted the alias of Techno. He was then apparently killed when his neck was broken by Iron, one of the Elements of Doom, and he transferred his mind into a robotic body, and this Techno sided, alone among the Thunderbolts, with Zemo when he went ahead with his scheme to conquer the planet.\n\nZemo and Techno decamped to one of Zemo's bases, where Techno began to experiment with cloning, offering to clone Zemo an unscarred body, and even cloning Kevin Costner for fun at one point. After the two fell out, Techno infiltrated the Thunderbolts by replacing Ogre, while continuing his experiments behind-the-scenes, including recovering Jolt's body when she was killed and placing it in a healing tube.\n\nTechno's impersonation of Ogre ended when Scourge stowed away inside him, shrunken, and destroyed his body from the inside, while he refused to kill Jolt again to allow him to construct a new body. However, his backup plan worked, and his consciousness was returned to his original human body—mostly healed, although the nerve damage in his neck meant he required his tech-pac to bypass the damage—and the human Ebersol, initially amnesiac of the robot's exploits, returned to calling himself the Fixer.\n\nFixer then became one of the Redeemers, a government-backed team whereby criminals could use it to accelerate their sentences and clear their record, until most of that team was slaughtered by Graviton. He joined with the reunited Thunderbolts to stop Graviton, and he was one of the team members exiled to Counter-Earth. By a complicated series of events, at the end of the trip to Counter-Earth, Zemo's consciousness ended up in Fixer's tech-pac. By threatening to disable it and leave him quadriplegic, Zemo managed to force Fixer to transfer the Baron's consciousness to his Counter-Earth counterpart's body.\n\nThe team remained on Counter-Earth for some time, until, in sealing a rift, they returned home, leaving Jolt (whom Fixer saved from burning out in helping to seal the rift) behind. Finally, after Moonstone went insane, Fixer furnished a device that could give the combined Avengers and Thunderbolts a couple of seconds to make their move; he then left.\n\nLater, Deadpool visited Fixer at his holiday home enlist his help in saving Cable. After a brief fight, Fixer accepted the challenge (and Deadpool's monetary inducement), and successfully bonded new, benign, techno-organic mesh to Cable. Some time after this, Fixer suddenly reappeared to save MACH-IV, his former teammate, from a fall; the script hinted that Fixer was working with Zemo once more.",
        "categories": [
            "Thunderbolts",
            "Avengers",
            "Heroes",
            "Reformed Villains",
            "People who used to be dead but aren't anymore",
            "Initiative",
            "Civil War"
        ]
    }
}