{
    "id": 1010773,
    "name": "Arachne",
    "description": "",
    "modified": "2013-10-24T13:07:59-0400",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/70/5269526591794",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010773",
    "comics": {
        "available": 3,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010773/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/37899",
                "name": "Amazing Spider-Man (1999) #5"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/30310",
                "name": "Amazing Spider-Man (1999) #635"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/29773",
                "name": "Herc (2010) #8"
            }
        ],
        "returned": 3
    },
    "series": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010773/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/454",
                "name": "Amazing Spider-Man (1999 - 2013)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/9898",
                "name": "Herc (2010 - 2011)"
            }
        ],
        "returned": 2
    },
    "stories": {
        "available": 3,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010773/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/64693",
                "name": "Herc (2010) #8 - Int",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/69447",
                "name": "Amazing Spider-Man (1999) #635 - Int",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/94843",
                "name": "Amazing Spider-Man (1999) #5",
                "type": "cover"
            }
        ],
        "returned": 3
    },
    "events": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010773/events",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/events/305",
                "name": "Spider-Island"
            }
        ],
        "returned": 1
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010773/arachne?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Arachne_(Julia_Carpenter)?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Julia Cornwall Carpenter",
        "identity": "Secret, known to certain government officials",
        "occupation": "Adventurer, government operative",
        "place_of_birth": "Los Angeles, California",
        "groups": "[[Omega Flight]]; formerly [[Avengers]], [[Queen's Vengeance]], [[Force Works]], [[Secret Defenders]], [[Commission on Superhuman Activities]], [[Freedom Force]]",
        "citizenship": "U.S.A.",
        "education": "College dropout, federal agent training",
        "aliases": "Spider-Woman; considered using Ariadne",
        "relatives": "Rachel Carpenter (daughter), Walter Cornwall (father), Elizabeth Cornwall (mother), Larry Carpenter (ex-husband, deceased)",
        "height": "5'9''",
        "weight": "140 lbs.",
        "eyes": "Blue",
        "hair": "Strawberry blonde",
        "powers": "As Spider-Woman, Julia possessed enhanced strength, speed, stamina, agility and reflexes. She could generate and manipulate strands of psionic force, which she often weaved into adhesive \"psi-webs\" to snare her targets. With severe concentration Julia's psi-webs can become super dense and be used as effective force shields. By concentrating this psionic force in her hands and feet, she can cling to and crawl across any surface, even scaling sheer walls. She was later depowered.  Currently, she was repowered and goes by the code-name 'Arachne'.  As Arachne, she has displayed many of her original powers, though it is unclear if she possesses all of her original powers.",
        "debut": "Marvel Super Heroes Secret Wars #6 (1984)",
        "creators": "this has not been updated yet",
        "main_image": "Spiderjulia.jpg",
        "bio_text": "An athletic young single mother, Julia Carpenter was drawn into a covert double life by an old college friend, federal agent [[Cooper, Val|Valerie Cooper]], who believed Julia would be an ideal test subject for a secret government super-agent program. Reuniting with Carpenter seemingly by chance, Cooper promised her cash-strapped friend lucrative employment and manipulated Julia into undergoing a series of experimental treatments, including injections of a formula incorporating rare Amazon jungle plants and various types of spider venom, which gave Julia superhuman powers. She became an operative of the [[Commission on Superhuman Activities]] (CSA) as Spider-Woman. The CSA was based in Washington, but Julia initially moonlighted as a seemingly independent super hero in Denver. When the near-omnipotent [[Maker|Beyonder]] abducted an entire Denver suburb (including the Carpenter home) into space as part of his [[Secret Wars|Secret Wars]], Julia fought the Beyonder's army of villains alongside heroes such as the [[Avengers]], the [[Fantastic Four]], the [[X-Men]] and [[Spider-Man (Peter Parker)|Spider-Man]] (who was so impressed by Julia that he adopted a new costume based on her outfit for a time).",
        "bio": "An athletic young single mother, Julia Carpenter was drawn into a covert double life by an old college friend, federal agent [[Cooper, Val|Valerie Cooper]], who believed Julia would be an ideal test subject for a secret government super-agent program. Reuniting with Carpenter seemingly by chance, Cooper promised her cash-strapped friend lucrative employment and manipulated Julia into undergoing a series of experimental treatments, including injections of a formula incorporating rare Amazon jungle plants and various types of spider venom, which gave Julia superhuman powers. She became an operative of the [[Commission on Superhuman Activities]] (CSA) as Spider-Woman. The CSA was based in Washington, but Julia initially moonlighted as a seemingly independent super hero in Denver. When the near-omnipotent [[Maker|Beyonder]] abducted an entire Denver suburb (including the Carpenter home) into space as part of his [[Secret Wars|Secret Wars]], Julia fought the Beyonder's army of villains alongside heroes such as the [[Avengers]], the [[Fantastic Four]], the [[X-Men]] and [[Spider-Man (Peter Parker)|Spider-Man]] (who was so impressed by Julia that he adopted a new costume based on her outfit for a time). \n\n\nArrogant, greedy and self-absorbed, Julia's ex-husband Larry had lost custody of their daughter Rachel after Julia divorced him for cheating on her; but when Julia's secret Spider-Woman career led to frequent unexplained absences on her part, Larry sued for custody of Rachel and won. Meanwhile, Julia served reluctantly with the ruthless CSA-sponsored super-team [[Freedom Force]] until they were arrested by the Avengers on false treason charges. A sympathetic Julia freed them and became a fugitive herself, though the Avengers were soon exonerated. Cooper later gave Carpenter a second chance, employing her as a solo operative supervised by unscrupulous CSA agent Mike Clemson; but after aiding the Avengers against the [[Pacific Overlords]], Julia joined the superhero team and cut ties with the CSA. As a member of the government sponsored West Coast Avengers, Julia's criminal record was expunged and it was as an Avenger that Julia fought the criminal trio [[Deathweb]]; their powers, like hers, came from the formula of the CSA's Dr. Carter Napier. Deathweb and their employer, the [[Manipulator]], fought Julia several times, killing her exhusband and Napier, threatening Rachel, and menacing Julia's parents, the Cornwalls, who as Amazon jungle guides had helped locate the ingredients for Napier's formula; but Julia ultimately defeated the villains, saving her daughter and parents. It was later revealed that all three members of Deathweb had been involved in the development of the Spider-Woman formula and all had been employed by Val Cooper.\n\n\nWhen the Avengers decided to close their West Coast base, Julia resigned in protest and joined several other ex-western Avengers in founding the new [[Force Works]] super-team, though it soon disbanded and Julia renewed her ties with the Avengers on an inactive basis. She was later forced to retire from superheroics after a crippling attack by a rival criminal Spider-Woman, [[Spider-Woman (Charlotte Witter)|Charlotte Witter]], who drained away Carpenter's superhuman powers, as well as those of the original Spider-Woman, [[Spider-Woman (Jessica Drew)|Charlotte Witter]]. In a battle with the young new Spider-Woman, [[Spider-Woman (Mattie Franklin)|Mattie Franklin]], Witter lost possession of the stolen powers.\n\nShortly after the Superhuman Registration Act was passed, Julia (who now called herself, 'Arachne') was persuaded by Tony Stark (Iron Man) to join his team. Alongside Ms.Marvel and [Wonder Man], her mission was to train other registered super heroes to perform government-authorized security activities. As well as the standard apprehension of unregistered super heroes.\n\nArachne was soon sent to go after the [[Shroud]] (Max Coleridge),an unregistered superhero and Julia's new boyfriend (and former paramour to the original Spider-Woman). Julia helped Coleridge escape from government soldiers and once again became a fugitive.  After sending three squads to the hospital, stealing clothes and a car, they headed to Colorado to pick up Rachel on their way to Canada.  After an ambush by Ms. Marvel and Wonder Man, Shroud was captured, but Arachne evaded the attack and went to her parents' home, where young Rachel was staying.  Following another ambush by Ms. Marvel (this time including newly registered superheroine, Araña), Arachne was captured and ripped from the arms of her daughter. Julia was incarcerated and held in chains, before being sent to the Negative Zone.  \n\nHowever, Julia escaped captivity during the Negative Zone prison break, and returned to Colorado in search of Rachel. A S.H.I.E.L.D. Psy-Ops team telepathically traced her to Brooklyn, where she furiously confronted Araña, demanding to know where her daughter had been taken. Due to the guilt Ms. Marvel, Wonder Man, and Araña all felt during their encounter with Arachne in Colorado, they agreed to help Julia find her parents and daughter, who by now, had gone into hiding. Going against her mother and father's wishes, CJulia took Rachel and agreed to become a member of Canada's super-team, Omega Flight, and received a full pardon for her previous crimes, thanks to the efforts of Ms. Marvel. Despite Ms. Marvel's aid in the end, Arachne made a promise that the animosity between the two women was not forgotten.",
        "categories": [
            "Women",
            "Heroes",
            "Avengers",
            "Spider-Man",
            "Civil War"
        ]
    }
}