{
    "id": 1010719,
    "name": "Daimon Hellstrom",
    "description": "",
    "modified": "2010-11-18T12:51:28-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/9/60/4ce5a2959ba25",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010719",
    "comics": {
        "available": 4,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010719/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/5600",
                "name": "Hellstorm: Son of Satan (2006) #2"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/33148",
                "name": "New Avengers By Brian Michael Bendis Vol. 2 TPB (Trade Paperback)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/42178",
                "name": "Villains for Hire (2011) #0.1"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/30232",
                "name": "Wolverine (2010) #6"
            }
        ],
        "returned": 4
    },
    "series": {
        "available": 4,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010719/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1128",
                "name": "Hellstorm: Son of Satan (2006 - 2007)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/10361",
                "name": "New Avengers By Brian Michael Bendis Vol. 2 TPB (2011)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/15282",
                "name": "Villains for Hire (2011 - 2012)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/9962",
                "name": "Wolverine (2010 - 2012)"
            }
        ],
        "returned": 4
    },
    "stories": {
        "available": 4,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010719/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/6210",
                "name": "2 of 5 -",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/69291",
                "name": "Wolverine #6",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/74619",
                "name": "Interior #74619",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/95478",
                "name": "Villains for Hire (2011) #0.1",
                "type": "cover"
            }
        ],
        "returned": 4
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010719/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010719/daimon_hellstrom?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Hellstorm?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Daimon Hellstrom, changed to Hellstorm",
        "identity": "No dual identity; his status as lord of Hell is not publicly known",
        "occupation": "Lord of Hell; former demonologist, exorcist, occult investigator, parapsychology professor",
        "place_of_birth": "Fire Lake, Greentown, Massachusetts",
        "groups": "[[Hell-lords]]; formerly the [[Defenders]], Hellstrom & Hellstrom: Occult Investigators; allegedly/unofficially member of the Hellfire Club's Inner Circle",
        "citizenship": "U.S.A.; Hell",
        "education": "Advanced degree in theology, self-taught in demonology; briefly trained as a priest",
        "aliases": "Antichrist, Black Halo, the Devil, King of Hell, Prince of Lies, Satan, Son of Satan; briefly the \"Son of Satannish\" and the \"White King of the Hellfire Club\"",
        "relatives": "Marduk Kurios ([[Satan (Marduk Kurios)|Satan]], father (and son)), Victoria Wingate Hellstrom (mother, deceased), [[Satana|Satana Hellstrom]] (sister), [[Hellcat|Patsy Walker]] (ex-wife), [[Cutter, Jaine|Jaine Cutter]] (consort); [[Asmodeus]], [[Beelzeboul]], [[Lucifer (Prince of Darkness)|Lucifer]], [[Mephisto]], [[Satannish]], [[Thog]], and other Hell-Lords (apparent quasi-fathers); [[Blackheart]], Mikal Drakonmegas ([[Hellfire (Mikal Drakonmegas)|Hellfire]]), [[Mephista]] (apparent quasi-half siblings)",
        "height": "6'1\"",
        "weight": "180 lbs.",
        "eyes": "Red (formerly blue)",
        "hair": "Red",
        "powers": "Hellstorm possesses vast magical power, enhanced by the number and faith of his worshippers. He can fly or transport himself and other beings and objects (even buildings) across the planet and to other realms via travel through Hell; he can even travel through time. He can project true fire; hellfire, able to cause spiritual pain; and destructive energies able to devastate a house or slay even beings of great magical power. He can form and shatter mystic shields, tear thoughts from minds, and heal injuries and ailments in himself or others. Though he is only slightly stronger than human, his powers can amplify his strength to higher levels. He can alter his garments and appearance at will, taking on a more demonic appearance, in some cases including hooves, fangs, and wings. His powers, formerly dependent on the Darksoul within him, are greatest within his own realm of Hell.",
        "paraphernalia": "Hellstorm wields a trident, formed of a Nether metal (Netheranium, a bane to other demons) and summoned and re-formed at his will, which serves as his power focus and symbol, though he can discharge his energies without it. He often travels across space or dimensions via his Demon-Steed drawn chariot, appearing with a thought. His Fire Lake mansion contains a portal to Hell, but possesses wards blocking unwanted entry of demons or angels. Hellstorm also possesses a number of magical artifacts, such as the Necromanteion (a magical scrying crystal) and the Grimorium Verum (an ancient arcane text). He sometimes uses a cane due to a left leg injury from the arcane Breathing Gun. | abilities = Hellstorm is highly intelligent and an expert in the occult, specifically in demonology and theology. He can perform complex and powerful magical rites. | debut = Ghost Rider #1 (1973)",
        "creators": "this has not been updated yet",
        "main_image": "hellstormmm.jpg",
        "bio_text": "Though demons are notorious liars, more reliable sources trace the genesis of the Class Two Demons ([[Hell-lords]]) to the primeval concentration of evil energy left behind when Demogorge drove the evil [[Elder Gods]] from Earth billions of years ago. That energy eventually gave rise to demons, shaped by the unconscious desires of their earliest human worshippers. These included at least [[Mephisto]], [[Satannish]], and [[Thog]], though many others followed, each ruling their own nether realms. Other Hell-Lords arose from fallen gods and angels, such as [[Lucifer (Prince of Darkness)|Lucifer]], cast down from Heaven. [[Satan (Marduk Kurios)|Marduk Kurios]] was worshipped by the ancient Sumerians thousands of years ago. It is unclear whether some Mesopotamian Gods ([[Annunaki]]) may have usurped names and worshippers of demonic predecessors (as the Egyptian [[Seth]] did to the Elder God [[Set]]), whether some Gods degenerated into demons or assumed alternate roles such as false angels after being deprived of worshippers in later millennia, and/or if gods may have split off demonic counterparts, or vice-versa. Regardless, the above mentioned demons and many others capitalized on the eventual human belief in a single lord of evil, Satan, each claiming to be that being and naming their realms Hell. Numerous, often unidentifiable, Satans and Devils have encountered humanity throughout history.",
        "bio": "Though demons are notorious liars, more reliable sources trace the genesis of the Class Two Demons ([[Hell-lords]]) to the primeval concentration of evil energy left behind when Demogorge drove the evil [[Elder Gods]] from Earth billions of years ago. That energy eventually gave rise to demons, shaped by the unconscious desires of their earliest human worshippers. These included at least [[Mephisto]], [[Satannish]], and [[Thog]], though many others followed, each ruling their own nether realms. Other Hell-Lords arose from fallen gods and angels, such as [[Lucifer (Prince of Darkness)|Lucifer]], cast down from Heaven. [[Satan (Marduk Kurios)|Marduk Kurios]] was worshipped by the ancient Sumerians thousands of years ago. It is unclear whether some Mesopotamian Gods ([[Annunaki]]) may have usurped names and worshippers of demonic predecessors (as the Egyptian [[Seth]] did to the Elder God [[Set]]), whether some Gods degenerated into demons or assumed alternate roles such as false angels after being deprived of worshippers in later millennia, and/or if gods may have split off demonic counterparts, or vice-versa. Regardless, the above mentioned demons and many others capitalized on the eventual human belief in a single lord of evil, Satan, each claiming to be that being and naming their realms Hell. Numerous, often unidentifiable, Satans and Devils have encountered humanity throughout history. \n\n\nSome thirty years ago, a number of Hell-lords acted collectively to create a son via a human woman, who would serve as a living battery drawing in the black energy (sin) of mankind, storing it up as a charge of pure evil. This would give the Hell-Lords the power to break through the walls of reality en masse and lead to an unstoppable assault on man. An early attempt saw Beelzeboul seduce and impregnate Cassandra Dragonmekas, who learned her lover's true identity and banished him from Earth with a magic dagger that foiled their spell. Apparently unknown to the Hell-Lords, the Chapel of Dresden cult sought to create a half-human, half-demon child through which they could rule mankind. Purchasing Victoria Wingate Hellstrom from her Satanist parents, they tattooed her womb with Satanic symbols, enabling her to bear such a child. Kurios came to Earth in human form, and was drawn to and seemed to seduce Victoria. Marrying quickly, they moved to Fire Lake's mansion and Daimon was born there a year later, tended by his father's servants. Despite being weaned on human blood and his pentagram-shaped birthmark, Daimon was more attached to his mother and remained unaware of his father's true nature; but his sister, [[Satana]], born when he was three, was always Daddy's little girl. When Daimon was six, Victoria walked in on an animal sacrifice Satana was performing for her father; she was driven mad and institutionalized upon seeing her husband's true face. Driving out the memory of willingly mothering the Antichrist, Victoria described herself as an innocent victim of Satan in her diary.\n\n\nSatana was taken to Hell to be raised by Satan while Daimon was raised in an orphanage, having no contact withhis father. His addled mother gave him an Ankh chain during a visit, telling him that only it could save him. Daimon studied under Father [[Gossett, Raymond|Raymond Gossett]] at a Jesuit Monastery for over three years, but he left abruptly before being ordained upon his mother's death and learning of his inheritance of Fire Lake. There he read Victoria's diary, learned of his father's true nature, and heard his father's call and promises of power. Removing his Ankh chain and accessing the mansion's portal to Hell, Daimon confronted Satan, ultimately refusing his father's offer. Daimon stole his father's trident and used it to summon his Demon-Steeds (Amon, Hecate, Set) and chariot, escaping Hell and sealing the portal behind him.\n\n\nDaimon spent years studying demonology and wallowing in indecision, using the Ankh chain and isolation to moderate the nightly transformations when his demonic Darksoul would gain ascendance. Eventually he began to work as an exorcist, assisting the possessed Linda Littletrees ([[Witch Woman]]), which led to an alliance with the [[Ghost Rider (John Blaze)|Ghost Rider]] against a Satan who cannot be clearly identified. As the Son of Satan, Daimon thwarted Satan by threatening to shatter his realm. After finding that the Fire Lake opening to Hell had reopened, Daimon traveled to St. Louis' [[Gateway University]] at the request of parasychology professor [[Reynolds, Katherine|Katherine Reynolds]], driving off [[Ikthalon]], the icy demon of stagnation, and his Legions of Boreas. He stayed there for a time, befriending Reynolds and divinity student [[Hyatt, Byron|Byron Hyatt]] and celebrating his birthday, marked by a battle with his father's agent [[Baphomet]] and the merging with his Darksoul, ending his nocturnal transformations and inverting his pentagram. \n\n\nTo end the threat of the fiery serpent [[Kometes]], Daimon traveled back in time to pre-Cataclysmic [[Atlantis]], where he encountered [[Kamuu]] and [[Zartra]] and the legendary sorceress [[Zhered-Na]], and destroyed Kometes via an encounter with [[Spyros (Adam K'ad-Mon)]], the first man on Earth. Working locally and distantly, Daimon exorcised the demon [[Allatou]], one of Satan's court, from the Manners family; destroyed the evil [[Madame Swabada]] who resented his fame and used tarot manifestations in a failed effort to slay him; assisted the [[Defenders]] against Satannish's human mystic [[Asmodeus (Charles Benton)]] and later the [[Sons of the Serpent]]; defeated a plot of his father's agent [[Dryminextes]] with the aid of the [[Human Torch (Johnny Storm)|Human Torch]]; and encountered the enigmatic [[Father Darklyte]] and his [[Legion of Nihilists]], the former exploding into a shower of cockroaches at battle's end. Daimon left Gateway, encountering and assisting Satana against Satan's agent [[Kthara of the Outer Dark]], earning Satana's enmity in the process when he unwittingly nearly slew her. Daimon joined the [[Thing (Benjamin Grimm)|Thing]] against another plot of Kthara, assisted Ghost Rider against Mephisto, and even joined forces with Satan against the [[Possessor (Raphael Zoran)]] who thought to conquer Hell. \n\n\nRelocating to Washington, D.C.'s [[District University]], Daimon taught parapsychology; defeated [[Mindstar]], who attempted to use him against the Egyptian god [[Anubis]]; befriended the bizarre [[Proffet the Celestial Fool]]; and became more than friends with wicca [[Thames, Saripha|Saripha Thames]]. Summoned to investigate the ditzy psychic [[Wester, Winda|Winda Wester]], Daimon crossed Hitler's alleged dentist [[Doctor Reich]] and corrupt cult-leader Reverend Joon Moon Yuc, leading to Daimon's Darksoul briefly possessing [[Howard the Duck]]. Daimon also helped free the vampire hunter [[Blade (Eric Brooks)|Blade]] from the control of [[Frost, Deacon|Deacon Frost]] and participated in the \"Defenders for a Day\". \n\n\nNow 27 years old, Daimon joined the Defenders in saving [[Eternity]] and the entire universe, opposing the alien [[Nebulon the Celestial Man|Nebulon]], as well as the demonic [[Six-Fingered Hand]] ([[Avarrish]], [[Fashima]], [[Hyppokri]], [[Maya]], [[Puishannt]], [[Unnthinnk]]) who threatened to conquer Earth. The Defenders (including Daimon) teleported across the planet to fight the demons' agents [[Gargoyle (Isaac Christians)]] and [[Hellcat]], both of whom were purged of demonic influences; the vampire [[Gordski]], whom Daimon exposed to premature daylight via time manipulation; rock singer [[Jones, Asmodeus|Asmodeus Jones]]; a would-be [[Messiah (David Kessler)]]; and the possessed [[Man-Thing]]. Ultimately, the Six-Fingered Hand were revealed to be pawns of the major Hell-Lords, led by Mephisto (who had manipulated them as Maya), Satan, Satannish, and Thog, who threatened to merge Hell and Earth, enabled by the damage to the dimensional walls caused by the threat to Eternity and their multiple teleportations. After a pitched battle between father and son, Daimon agreed to stay in Hell to study under his father, and Satan cancelled the invasion of Earth, leaving the Defenders to wonder if Satan had achieved his true goal after all.\n\n\nAfter months of attempting to purge his humanity, Daimon rebelled against and abandoned Satan, who surprisingly expressed pride and revealed his multi-faceted nature. Daimon returned to the Defenders, saving the life of the [[ Beast (Henry McCoy)|Beast]]'s girlfriend [[Cantor, Vera|Vera Cantor]], foiling the corrupting spirit within the [[Resurrection Stone]], and fighting the [[Secret Empire]]. To save the [[Valkyrie (Brunnhilde)]]'s life, he sought the [[Rose of Purity]] from the [[Wasteland Dimension]], but found he could not steal the Rose, a god to residents [[Damask]] and [[Zaffer]]. After aiding the [[Sqaudron Supreme (Earth-712)|Squadron Supreme]] on [[Earth-712]] against [[Null The Living Darkness|Null the Living Darkness]], Daimon expressed his love for Patsy Walker (Hellcat), who initially rebuffed him. Leaving in a rage, Daimon returned to District University where he found that a demon from Satan's realm had usurped his identity. Daimon defeated the interloper, but left him in peace when Saripha revealed her love for the demon. \n\n\nDaimon sought solace at Father Gosset's new monastery, but fell into a plot of the [[Miracle Man]], who stole his Darksoul, which was ultimately cast into a serpent that seemed to slither off and die. Seemingly free of his demonic half, Daimon married Patsy, despite interference from the Secret Empire, and they moved out to San Francisco to work as occult investigators. Daimon's pentagram returned soon after and he showed intermittent mystic power, sometimes using the alias Hellstorm and donning a garish costume. He and Patsy joined the Defenders against [[Bannister, Minerva|Minerva Bannister]] (who sought vampiric immortality); aided the Avengers against Allatou, [[Master Pandemonium]] and the [[Cat People]]; and helped resolve the dual possession of the [[Phantom Rider (Hamilton Slade)|Phantom Rider]] by his uncles, the heroic [[Phantom Rider (Carter Slade)|Carter]] and the maddened [[Phantom Rider (Lincoln Slade)|Lincoln]]. \n\n\nMeanwhile, the Hellfire Serpent, recipient of Daimon's Darksoul, was used by Terror to empower Mikal Drakonmegas as Hellfire to oppose Beelzeboul. Daimon's powers faded, and he retired, but he soon began to die without his Darksoul. In desperation, Patsy used the [[Grimorium Verum]] to summon Satan, who restored Daimon's Darksoul to continue their struggle. Patsy was driven mad upon seeing Daimon's full demonic spirit; he brought her back to Fire Lake where Isaac Christians cared for her. In preparation for the final battle with his father, Daimon took a road trip, defeating Satan's Somnambulist and his pawn [[Allred, Ervil|Ervil Allred]] in Nevada, then befriended occult experts [[Al Shaitan]] and [[Siegel, Avram|Avram Siegel]]. From the witch [[Lavoisin]] he learned his birth father's true name - a source of vulnerability to demons - for the price of donating his seed to her. Satan located Daimon's former imposter, sending him to resume the identity and lead the Satanic Black Church. Daimon slew the demon and promised his father their next battle would be their last. \n\n\nSevering ties with [[Doctor Strange (Stephen Strange)|Doctor Strange]], Daimon battled the Black Church's [[Riley, Jack|Jack Riley]] alongside [[Soulfire]], initially intended as Satan's pawn; punished the lethally abusive father of Lisa Beckman; and allied with the Souls of the Damned, spirits from Hell restored to Earth by Satan via misguided would-be faith-healer father [[Crow, Joshua|Joshua Crow]]. Daimon successfully fought to bring the few redeemed Souls to Heaven, but was cast down to Hell as punishment. After learning the secrets of Heaven and Hell, Daimon invoked the name and symbols of Marduk Kurios, granting him the power to slay his father. Unexpectedly, the Black Halo of Satanic regency passed to Daimon, making him new Lord of Hell. As Daimon mandated secrecy and pondered these changes, high-ranking demons noticed the laxity and sought to increase their domains, while the forces of a division of Heaven, long-associates and rivals of Kurios, saw this as a chance to win the eternal struggle with Hell. Daimon slew the [[Armorer]], who wore the organs of murdered sorcerers and sought to give Manhattan to the demon [[Zahgurim]] as a dowry; along the way, Daimon fell in love with occult terrorist [[Cutter, Jaine|Jaine Cutter]], while Patsy regained sanity only to commit suicide under [[Deathurge]]'s guidance. Working alongside occult network head and Satanist [[Devine, Anton|Anton Devine]], Daimon and Jaine destroyed the Antimuse Inanna and her Bailiff of Madness; drove mad the angel Tzadqiel; and destroyed Heaven's homonculus agent [[Loss, Stephen|Stephen Loss]], driving his agent [[Gabriel, Devil-Hunter|Gabriel]] insane in the process. Daimon had Isaac care for Gabriel, and he learned that Lavoisin was expecting a boy -- a child he knew would be his reborn father, Satan. \n\n\nDaimon slew [[Doctor Druid]] when his powers and motives threatened earthly existence, resurrecting the mutant witch [[Nekra]] in the process; warned [[Wolverine (James Howlett)|Wolverine]] of a mysterious box long thought lost in the nether regions; and assisted the mystically-empowered [[Punisher (Frank Castle)|Punisher]] against rival Hell-lord [[Olivier]]. He was rescued by the [[Fantastic Four]] and sorcerers [[Szardos, Margali|Margali Szardos]] and [[Mechamage]] from rival devil-spawn [[Blackheart]]'s apparent imprisonment, allegedly gaining standing as the White King to Blackheart's Black King of the [[Hellfire Club]] in the process. Daimon manipulated the [[Thunderbolts]] into recovering Patsy from Mephisto's Hell. When Satannish united with the extradimensional Dormammu to conquer all of Hell, Hellstorm joined with Mephisto, [[Pluto]], [[Hela]], and Hellcat to foil this plot. Afterwards, perhaps addled by her experiences, Patsy made an odd series of conclusions and claimed that Daimon was the Son of Satannish. Seeking to keep Patsy distant from the horrors of his current life, Daimon took on a malevolent aspect and agreed to her claims, though Mephisto provided her safe transport back to Earth for her help. With Jaine as his consort, Daimon remains lord of Hell, though his reborn father is almost certainly plotting a coup against him.\n\n\n* '''Note''' - Though Marduk Kurios is Daimon's direct father, Satan has been shown to be made up of aspects of Asmodeus, Lucifer, Mephisto, Satannish, Thog, and others, indicating that the Hell-lords merged their energies to father a true \"Son of Satan.\" Reliable sources have named Beelzeboul, Kurios, Lucifer, and Mephisto as Daimon's father, further supporting this conclusion.",
        "categories": [
            "Horror",
            "Magic",
            "Heroes"
        ]
    }
}