{
    "id": 1010947,
    "name": "Maverick (Chris Bradley)",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/6/60/4c7c63f89c100",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010947",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010947/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010947/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010947/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010947/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010947/maverick_chris_bradley?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Maverick_%28Chris_Bradley%29?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Christopher \"Chris\" Bradley",
        "identity": "Secret",
        "occupation": "Mercenary; former adventurer, student",
        "place_of_birth": "Duchess County, New York City, New York",
        "groups": "(As Maverick) Formerly Gene Nation, Cable’s Underground; (as Bolt) formerly New Warriors",
        "citizenship": "U.S.A",
        "education": "High school (incomplete)",
        "aliases": "Formerly Bolt, \"Bulk,\" Brian Johnson",
        "relatives": "Robert Bradley (Frank Johnson, father), Marion Bradley (Rose Johnson, mother), Catherine Bradley (Jennifer Johnson, sister)",
        "height": "6'4\"",
        "weight": "244 lbs.",
        "eyes": "Blue",
        "hair": "Black",
        "powers": "Chris Bradley could absorb ambient static electricity from the atmosphere. Typically, Chris’ body harmlessly expended this energy; however, he was able to store and release it for a variety of effects, such as obscuring his features, channeling it through conductive material, forming protective shields, or generating electric arcs. Chris was also able to absorb electricity from electricity-generating sources to empower himself.",
        "abilities": "Chris was extensively trained by Cable in armed and unarmed combat, and was a skilled albeit brutal interrogator.",
        "paraphernalia": "As Maverick, Chris wore a suit of lightweight Kevlar body armor as well as a mask with atmospheric seals.",
        "weapons": "As Maverick, Chris wielded a pair of conventional handguns.",
        "debut": "(As Bradley) X-Men Unlimited #8 (1995); (as Johnson) Maverick #4 (1997); (as Bolt) Maverick #8 (1998); (as Maverick) Weapon X #6 (2003)",
        "origin": "X-Men Unlimited #8 (1995)",
        "significant_issues": "Mutant nature manifested, trained by X-Men, revealed to have contracted Legacy Virus, began relationship with Donna (X-Men Unlimited #8, 1995); threatened by Friends of Humanity, saved by Maverick, house burned down by Friends, sought help from Maverick, vs Friends, family relocated by Maverick, given new identity of Brian Johnson (X-Men Unlimited #15, 1997); Legacy Virus began affecting powers (Maverick #1, 1997); reunited with Donna, attacked by Friends, saved by Maverick, Elena Ivanova & Wolverine, first used Brian Johnson identity (Maverick #4, 1997); visited Dr Keller, learned of Maverick’s remission (Maverick #6, 1998); saved Keller from burglars (Maverick #9-11, 1998); left home bound for New York (New Warriors #0, 1999); reunited with Donna, aided heroes vs Blastaar, joined New Warriors, began living on streets (New Warriors #1, 1999); with Warriors, vs Genecide & Eugenix (New Warriors #2, 1999); with Warriors, won basketball game vs Slingers during Coterie’s “Contest of Champions”, defeated by Black Panther (Contest of Champions II #3, 1999); with Warriors, vs Lobo’s Boys (New Warriors #3-4, 1999-2000); with Warriors, vs Heavy Mettle (New Warriors #4, 2000); with Warriors, alongside Generation X, vs Biohazard, moved in with Namorita (New Warriors #5, 2000); with Warriors, vs Mutant Force (New Warriors #6, 2000); with Warriors, vs Heavy Mettle (New Warriors #7, 2000); briefly lost powers due to High Evolutionary’s machinations (Uncanny X-Men #379/Wolverine #149/Uncanny X-Men #380, 2000); with Warriors, alongside Night Thrasher, vs Junzo Muto & the Hand (New Warriors #8, 2000); with Warriors, vs Blizzard & sentient Iron Man armor, revealed Legacy Virus infection to Namorita (New Warriors #9, 2000); with Warriors, vs Hercules, asked Zeus for help in curing Legacy Virus, revealed Legacy Virus infection to teammates (New Warriors #10, 2000); Legacy Virus cured (Uncanny X-Men #390, 2000); with Warriors, vs Spragg the Living Hill (Maximum Security #1, 2000); with Warriors, alongside Earth’s heroes, vs Ronan (Maximum Security #3, 2001); learned of Maverick’s apparent death, sought revenge on Weapon X, trained by Cable, assumed Maverick’s identity (Weapon X #21, 2004); with Underground, helped capture Reaper & Wildside, brutally interrogated them (Weapon X #8-10, 2003); with Underground, assaulted Weapon X, betrayed by Jackson, captured, escaped, encountered Agent Zero (Weapon X #11-13, 2003); joined Gene Nation intending to secretly oppose them, sent to aid in terrorist attack on Grand Central Station, opposed by Agent Zero, shot & killed (Weapon X #19-21, 2004)",
        "main_image": "Mavrikbrad.jpg",
        "bio_text": "Chris Bradley lived the life of a normal teenager until the day his mutant nature first manifested. This drew the attention of the mutant heroes the [[X-Men]], two members of which – [[Gambit]] and [[Phoenix (Jean Grey)|Jean Grey]] – were sent to monitor Chris. At school, Chris found himself unable to control his electricity-based powers and was overwhelmed, falling unconscious in the school’s bathroom. He was found by Gambit and Jean who subsequently took him home. With his parents’ blessing, Chris went to live with the X-Men at their mansion home. There, Chris trained with them in the use of his powers, and began to form close friendships with several of the X-Men, particularly [[Iceman]]. Eventually, Chris proved able to control his powers, but on the eve of his return home, the X-Man [[Beast]] discovered that Chris had contracted the mutant-killing Legacy Virus. A despondent Chris still sought to return to a normal life, and although alienated from his best friend, Chris found acceptance in his classmate [[Funaro, Donna|Donna Funaro]], who did her best to understand his situation, and they soon fell in love. After public anti-mutant sentiments grew to a near-fever pitch, Chris’ parents were forced to take him out of school. On a visit to the only clinic willing to help those infected with the Legacy Virus, they stumbled upon members of the anti-mutant [[Friends of Humanity]] movement who were intending to bomb the clinic. They were saved by the mutant mercenary [[Agent Zero|Maverick (Christoph Nord)]], who was also infected with the Virus. With the Friends defeated, Chris used his powers to help defuse the bomb. Maverick then provided Chris with contact details should he ever need Maverick’s help in the future. Later, Chris’ home was burned down by mutant-haters, and he angrily sought revenge on the Friends, whom he believed to be the perpetrators. Iceman sought to stop him, but Chris rejected his offer of help, feeling that the X-Men had abandoned him. Instead, Chris sought out Maverick, unwittingly leading the Friends to confront them. Aided by Iceman and the feral X-Man [[Wolverine (James Howlett)|Wolverine]], they defeated the Friends, after which Maverick arranged for Chris and his family to be given new identities as the Johnsons and relocated to Altamonte Springs, Florida. Maverick also had his old ally, [[Keller, James|Doctor James Keller]], begin analyzing Chris’ condition.",
        "bio": "Chris Bradley lived the life of a normal teenager until the day his mutant nature first manifested. This drew the attention of the mutant heroes the [[X-Men]], two members of which – [[Gambit]] and [[Phoenix (Jean Grey)|Jean Grey]] – were sent to monitor Chris. At school, Chris found himself unable to control his electricity-based powers and was overwhelmed, falling unconscious in the school’s bathroom. He was found by Gambit and Jean who subsequently took him home. With his parents’ blessing, Chris went to live with the X-Men at their mansion home. There, Chris trained with them in the use of his powers, and began to form close friendships with several of the X-Men, particularly [[Iceman]]. Eventually, Chris proved able to control his powers, but on the eve of his return home, the X-Man [[Beast]] discovered that Chris had contracted the mutant-killing Legacy Virus. A despondent Chris still sought to return to a normal life, and although alienated from his best friend, Chris found acceptance in his classmate [[Funaro, Donna|Donna Funaro]], who did her best to understand his situation, and they soon fell in love. After public anti-mutant sentiments grew to a near-fever pitch, Chris’ parents were forced to take him out of school. On a visit to the only clinic willing to help those infected with the Legacy Virus, they stumbled upon members of the anti-mutant [[Friends of Humanity]] movement who were intending to bomb the clinic. They were saved by the mutant mercenary [[Agent Zero|Maverick (Christoph Nord)]], who was also infected with the Virus. With the Friends defeated, Chris used his powers to help defuse the bomb. Maverick then provided Chris with contact details should he ever need Maverick’s help in the future. Later, Chris’ home was burned down by mutant-haters, and he angrily sought revenge on the Friends, whom he believed to be the perpetrators. Iceman sought to stop him, but Chris rejected his offer of help, feeling that the X-Men had abandoned him. Instead, Chris sought out Maverick, unwittingly leading the Friends to confront them. Aided by Iceman and the feral X-Man [[Wolverine (James Howlett)|Wolverine]], they defeated the Friends, after which Maverick arranged for Chris and his family to be given new identities as the Johnsons and relocated to Altamonte Springs, Florida. Maverick also had his old ally, [[Keller, James|Doctor James Keller]], begin analyzing Chris’ condition.\n\nChris settled into his new life as Brian Johnson, though the Legacy Virus soon affected his control over his powers. Eventually, Chris ran away from home to New York to be reunited with Donna, but became the target of the Friends once more. Saved by Maverick and Russian telepath [[Ivanova, Elena|Elena Ivanova]], they were soon joined by Wolverine in opposing the Friends. An explosion allowed the heroes to escape, but also left Donna mistakenly believing Chris had died. For his protection, Maverick had Chris take a code-name, and he chose “Bolt.” On a subsequent visit to Keller’s clinic, Chris learned that Maverick’s powers had returned, forcing the Virus into remission. He then aided Keller in opposing a group of would-be burglars, using his powers to mask his true identity. Later, seeking to fight mutant persecution as a super-hero, Chris moved to New York and was again reunited with Donna. Soon after, Chris aided several other teen heroes in battling the alien warrior [[Blastaar]], after which the heroes banded together as a new incarnation of the [[New Warriors]]. Initially, Chris kept his Legacy Virus infection a secret from his teammates. Having nowhere to live, Chris slept on the streets for a time before turning to Donna for help, after which she let him sleep on the floor of her room for a time. As a Warrior, Chris helped his teammates save [[Namorita]] from [[Genecide]] and her [[Eugenix]] soldiers, after which they became involved in a war between rival gangs [[Born 2 Die]] and [[Lobo's Boys]], during which Chris’ teammate [[Aegis (Trey Rollins)|Aegis]] opted to save his friend James, one of Lobo’s Boys, instead of Chris, resulting in Chris being injured by a falling wall. Subsequently investigating the gang’s arms supplier, [[Traynor, Harvey|Harvey Traynor]], a recovering Chris and his teammates clashed with the armored mercenaries [[Heavy Mettle]], with Chris facing off against the energy arrows of [[Warbow]]. Traynor went to prison, where he was killed by an agent of Heavy Mettle’s employer, [[Silvermane]]. The Warriors were also involved in the “contest of champions” held by the alien [[Coterie]], during which they bested fellow teen heroes the [[Slingers]] in a game of basketball only to be subsequently defeated in combat by the [[Black Panther (T'Challa)]]. Chris and the Warriors later teamed with teen mutant heroes [[Generation X]] in opposing Fletcher Traynor, who sought revenge on the Warriors for his father’s death and was mutated by one of his father’s weapons into the monstrous [[Biohazard (Fletcher Traynor)|Biohazard]]. After Biohazard’s defeat, Namorita learned of Chris’ lack of accommodation and offered him the spare room at her apartment. The Warriors next prevented an armored car heist by the [[Mutant Force]] during which Chris opposed [[Peeper]]. Media reports of the clash mistakenly referred to Chris as “Bulk,” much to his chagrin. Subsequently, the Warriors battled Heavy Mettle once more, with Chris besting the aquatic powerhouse [[Barracuda (Heavy Mettle)|Barracuda]] by electrocuting him.\n\nLater, Chris was among the world’s mutants who were temporarily stripped of their powers by the [[High Evolutionary]]’s machinations, regaining them in time to rejoin his teammates in helping the Warriors’ former leader [[Night Thrasher]] against the would-be new [[Iron Fist (Junzo Muto)|Iron Fist]] and the ninjas of the [[Hand]]. Chris and the Warriors then opposed an attempted robbery by [[Blizzard (Donald Gill)]]. During the clash, [[Iron Man (Anthony Stark)|Iron Man]] joined the fight, but subdued Blizzard so brutally that the Warriors interceded, unaware that they were actually opposing a suit of sentient Iron Man armor which almost killed the Warriors until it realized what it was doing was wrong and left. Subsequently, the Warriors were transported to the extradimensional realm of Olympus by [[Hercules]], who sought to test them in battle. Chris took the opportunity to ask the ruling god [[Zeus]] for help in curing the Legacy Virus; however, Zeus declined to involve himself in mortal affairs. Chris ultimately told his teammates the truth about his condition, and they – along with a returned Night Thrasher - pledged their resources to finding a cure. Eventually, the X-Man Beast created a cure which was released into Earth’s atmosphere by the sacrifice of the X-Man [[Colossus (Piotr Rasputin)|Colossus]]. Soon after, an intergalactic council attempted to convert Earth into a prison planet, during which a reinvigorated Chris fought with his teammates against [[Spragg the Living Hill]] and other threats before joining many of Earth’s heroes in opposing their would-be “warden,” [[Ronan the Accuser]], and a horde of mutated [[Kree]] soldiers.\n\nUpon learning of Maverick’s apparent death at the hands of [[Sabretooth]], then an agent of the subversive [[Weapon X]] program, Chris swore revenge. Seeking out the mutant soldier [[Cable]], Chris recruited his help as a combat instructor to better allow Chris to take up Maverick’s name and uphold his legacy. Chris immersed himself in the Maverick persona, doing his best to look, sound, and act like Maverick. Chris subsequently joined [[Cable's Underground]] resistance group in opposing Weapon X and its sadistic Director, [[Colcord, Malcolm|Malcolm Colcord]]. Alongside [[Domino (Neena Thurman)|Domino]], Chris helped capture Weapon X operatives [[Reaper (Pantu Hurageb)|Reaper]] and [[Wildside]], whom he proceeded to brutally torture in an effort to learn of Weapon X’s plans. The Underground then formed an alliance with rogue Weapon X operative [[Jackson, Brent|Brent Jackson]] and a cadre of agents loyal to him in an assault on Weapon X’s headquarters, but they were ultimately betrayed by Jackson and captured. Chris escaped and battled Weapon X’s Agent Zero, unaware that he was secretly the former Maverick. After the Underground was co-opted by former Weapon X agent [[Marrow]] and restructured as [[Gene Nation]], Chris tracked her down and confronted her. Marrow surprisingly invited Chris to join them, and he accepted, secretly intending to dismantle the organization from within. For his first mission, Chris was sent to aid in a terrorist attack on Grand Central Station. Seeking to stop the bomber, Chris was confronted by Agent Zero, who mistakenly believed him to be the perpetrator. In the ensuing confusion, Zero fatally shot Chris. As he lay dying, Chris was unmasked by Zero, who was shocked to discover he had killed his former friend. Chris died, never knowing Zero’s true identity. \n\nRecently, Chris was revived with an alien techno organic virus.",
        "categories": [
            "X-Men",
            "Heroes",
            "People who used to be dead but aren't anymore",
            "Mutants"
        ]
    }
}