{
    "id": 1010450,
    "name": "Lightspeed",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/6/a0/4c7c643921b8e",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010450",
    "comics": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010450/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/15848",
                "name": "The Loners (2007) #3"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/13736",
                "name": "Uncanny X-Men (1963) #195"
            }
        ],
        "returned": 2
    },
    "series": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010450/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1938",
                "name": "The Loners (2007 - 2008)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2258",
                "name": "Uncanny X-Men (1963 - 2011)"
            }
        ],
        "returned": 2
    },
    "stories": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010450/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/27899",
                "name": "Cover #27899",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/32363",
                "name": "3 of 6 - 6XLS",
                "type": "cover"
            }
        ],
        "returned": 2
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010450/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010450/lightspeed?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Lightspeed?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Julia \"Julie\" Power",
        "identity": "Secret",
        "occupation": "Adventurer, former student",
        "place_of_birth": "Richmond, Virginia",
        "groups": "[[Loners|The Loners]], formerly [[Power Pack]]",
        "citizenship": "U.S.A.",
        "education": "High school educated (graduation unconfirmed)",
        "aliases": "Formerly Molecula \"Mistress of Destiny\", Starstreak",
        "relatives": "James Power (father), Margaret Power (mother), Alex and Jack Power (Zero-G and Mass Master, brothers), Katie Power (Energizer, sister), Roy Craig (grandfather)",
        "height": "Current height unrevealed",
        "weight": "Current weight unrevealed",
        "eyes": "Blue",
        "hair": "Strawberry blonde",
        "powers": "Lightspeed can fly at high (supersonic) speeds, leaving behind her a rainbow-like trail. Apparently she somehow generates energy that gives her great forward thrust enabling her to rise from the ground and move through the air at rapid speed. While flying she generates a protective aura around her of an undetermined thickness that protects her from air friction. She has superhuman stamina and reflexes.",
        "debut": "Power Pack #1 (1984)",
        "origin": "Power Pack #1 (1984)",
        "significant_issues": "Gained superhuman powers from dying Kymellian Aelfyre Whitemane, became Lightspeed (Power Pack #1, 1984); moved to New York City, encountered Spider-Man (Power Pack #6, 1985); encountered Cloak and Dagger (Power Pack #7, 1985); first battled Boogyman (Power Pack #14, 1985); first met Franklin Richards (Power Pack #16, 1985); encountered New Mutants (Power Pack #20, 1986); powers siphoned into Snark Jakal, when returned powers exchanged with her brother Jack, became \"Molecula\" (Power Pack #25, 1986); regained original powers (Power Pack #52, 1989); encountered Galactus and Nova (Power Pack #58, 1990)",
        "abilities": "Unrevealed",
        "weapons": "None",
        "paraphernalia": "Julia's costume is made of unstable molecules which can transform back and forth into conventional attire via a voice-activated device which responds to commands of \"Costume on\" or \"Costume off\"; when not in use, costumes are stored and cleaned in the infra-spatial dimension referred to as \"Elsewhere.\"",
        "main_image": "Lightspeed Head.jpg",
        "bio_text": "Julie Power grew up accustomed to superhuman adventure as one of the four sibling members of the team [[Power Pack]]. She is the daughter of Dr. James Power, a physicist who was working for the United States government on a means of producing large quantities of energy cheaply through combining matter and antimatter. (The subatomic particles composing antimatter have opposite charges to those of the equivalent particles of matter itself. When matter contacts antimatter, both are converted entirely into vast quantities of energy.)",
        "bio": "Julie Power grew up accustomed to superhuman adventure as one of the four sibling members of the team [[Power Pack]]. She is the daughter of Dr. James Power, a physicist who was working for the United States government on a means of producing large quantities of energy cheaply through combining matter and antimatter. (The subatomic particles composing antimatter have opposite charges to those of the equivalent particles of matter itself. When matter contacts antimatter, both are converted entirely into vast quantities of energy.) \n\n\nAn alien Kymellian named Aelfyre Whitemane (nicknamed \"Whitey\") learned of Power's discovery and intended to stop it from being used. Whitemane knew that a device such as Power's, although Power and his co-workers did not realize it, would trigger a chain reaction that would destroy the Earth. Moreover, he knew that Power's device was sought by the alien Z^nrx, nicknamed \"Snarks,\" who intended to use it to conquer inhabited worlds. Snarks captured Dr. Power and his wife Margaret, intending to force him to reveal the secret of how his device worked. Whitemane saved the Powers' children, Alex, Julie, Jack, and Katie, from being captured, but he himself was fatally wounded in the process. Dying, Whitemane transferred a different one of his superhuman powers into each of the four Power children and asked them to use their new abilities to save their world. Julie received the power to fly at great speed whileleaving a trail of colored light behind her, and therefore called herself Lightspeed. The four children called themselves the Power Pack. Power Pack thwarted the Snarks, rescued their parents, and destroyed Dr. Power's dangerous matter/antimatter converter, thereby saving the Earth from destruction. The four children continued to have adventures as Power Pack.\n\nFor a time, Julie, calling herself Molecula, possessed Jack's powers to become cloud-like.During this period of time,she wore his costume, which apparently proved that their costumes fit any of the Power siblings. She shared adventures with the likes of X-Factor, the Avengers, and the Fantastic Four. She later regained her flight powers and called herself Lightspeed once again. After her parents and her brother Alex were replaced by alien substitutes, Julie and the rest of Power Pack flew to Kymellia where they defeated both the Kymellian Technocrat and the Snark queen, Maraud and rescued them. Her brother Alex stole all the powers from his siblings for himself and joined the New Warriors. Alex eventually quit and returned the powers. The Power family moved to Bainbridge Island near Seattle, and for a brief period, Julie called herself \"Starstreak\", the name that her sister Katie had previously used with Julie's powers.During her time as Starstreak,Julie was able to teleport. Julie left home eventually and moved to Hollywood hoping to start her acting career. There, she encountered the Runaways while working with a support group for former teenage super-heroes. This support group has evolved into the team known as the [[Loners]]. Since her time with the Loners failed to help her be \"normal\" Julie has re-embraced her powers and has joined the Avengers Academy.",
        "categories": [
            "Heroes",
            "Women"
        ]
    }
}