{
    "id": 1010858,
    "name": "Shockwave",
    "description": "Lancaster Sneed was a secret agent working for the United Kingdom’s MI:6, but no one esteemed him as highly as himself, and despite his pride, he was wounded in an explosion on his first field assignment and forced to undergo a radical surgery that grafted metal plates and cybernetic systems to his body.",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/5/c0/4c0035c193fc3",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010858",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010858/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010858/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010858/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010858/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010858/shockwave?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Shockwave?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Lancaster Sneed",
        "identity": "Known to the authorities",
        "occupation": "Criminal, mercenary; former performer, espionage agent",
        "place_of_birth": "Unrevealed",
        "groups": "(formerly) [[Masters of Evil]], MI: 6; (formerly) partner to Brynocki, agent of Ward Sarsfield",
        "citizenship": "U.K.",
        "education": "Unrevealed; trained by British military and intelligence",
        "aliases": "None",
        "relatives": "Sir Denis Nayland Smith (uncle)",
        "height": "5'11\"",
        "weight": "170 lbs.; (in armor) 182 lbs.",
        "eyes": "Green",
        "hair": "Black",
        "powers": "Shockwave’s cybernetics give him above-average strength, speed, and stamina. His armor is highly resistant to injury and is capable of delivering powerful electric shocks upon contact.",
        "abilities": "Sneed is an accomplished secret agent and is skilled in hand-to-hand combat, infiltration, and demolitions.",
        "weapons": "None",
        "paraphernalia": "None",
        "debut": "Master of Kung Fu #42 (1976)",
        "origin": "Master of Kung Fu #42; Master of Kung Fu #75",
        "significant_issues": "",
        "main_image": "Shkwve.jpg",
        "bio_text": "Lancaster Sneed was a secret agent working for the United Kingdom’s MI:6 , but no one esteemed him as highly as himself. Despite his pride, he was wounded in an explosion on his first field assignment and forced to undergo a radical surgery that grafted metal plates and cybernetic systems to his body. MI:6 dismissed him, however, as the surgery had driven the man insane. Sneed instead traveled to Asia, becoming a martial arts master and creating his Shockwave costume and identity. He served briefly as a sideshow act until recruited to join Fu Manchu’s criminal underworld.",
        "bio": "Lancaster Sneed was a secret agent working for the United Kingdom’s MI:6 , but no one esteemed him as highly as himself. Despite his pride, he was wounded in an explosion on his first field assignment and forced to undergo a radical surgery that grafted metal plates and cybernetic systems to his body. MI:6 dismissed him, however, as the surgery had driven the man insane. Sneed instead traveled to Asia, becoming a martial arts master and creating his Shockwave costume and identity. He served briefly as a sideshow act until recruited to join Fu Manchu’s criminal underworld. \n\nOn behalf of Fu Manchu, Shockwave guarded one of its front organizations, Oriental Expediters, where he first encountered [[Shang-Chi]],  Fu Manchu’s son and mortal enemy who was determined to bring his father to justice. Shockwave fled their battle when outnumbered, but traveled to Switzerland to assist Tarrant of the Oriental Expediters in kidnapping [[Wu, Leiko|Leiko Wu]] and [[Ducharme]]. The plot was foiled by Shang-Chi and his allies in MI:6, and Shockwave was thrown into a pool, shorting out his armor and putting him in the hospital.\n\nHe was interviewed in the hospital by Sir Denis Nayland Smith and Dr. Petrie, two of Fu Manchu’s most persistent adversaries. Shockwave revealed that it was he and Dr. Petrie who planted a bomb in Smith’s office before he left for Switzerland. Surprised by the revelation, Smith was shot by Petrie, who had become brainwashed by Fu Manchu. He left the gun in Shockwave’s hand to frame him, but ultimately, Smith survived and Petrie was freed from Fu Manchu’s influence thanks to Shang-Chi and the agents of MI:6. \n\nShockwave was freed from custody and brainwashed by rogue administrator Ward Sarsfield to serve his own interests. Directed to fight Nayland Smith, he nearly beat him to death until [[Reston, Clive|Clive Reston]], Leiko Wu, and Shang-Chi forced him to flee. \n\nHe was then directed to serve [[Brynocki]] as the robot captured [[Tarr, Black Jack|Black Jack Tarr]] and took him to [[Mordillo Island]]. As Shang-Chi and his allies came to the rescue, Shockwave was injured falling from a flying dragonfly transport, and Brynocki turned against him. Shockwave joined his former enemies in escaping from Mordillo Island and fighting Brynocki’s Monstrobot. During the escape, the once-proud Shockwave was brought low. He was forced to allow Shang-Chi to disconnect his electrical systems so that they all could swim to safety. He was also hit hard by the Monstrobot, and his faceplate was removed. He revealed his past-- how he was, in fact, the nephew of Nayland Smith and suffered a lonely childhood at a boarding school away from friends and family. He loved Smith’s visits and stories but resented him for leaving each time. He also revealed his subjugation under Sarsfield, and Leiko Wu promised MI:6 would help free him of his brainwashing. Shang-Chi also used a recording of Shockwave’s confession to expose Sarsfield.\n\nWhat followed was a succession of mercenary endeavors. When the [[Avengers]]’ West Coast branch inadvertently stumbled onto a conspiracy within [[S.H.I.E.L.D.]], the conspiracy hired Shockwave, alongside [[Razor-Fist]] and [[Zaran, Maximillan|Zaran the Weapons Master]], to fight them, and Shockwave nearly downed [[Iron Man (Anthony Stark)|Iron Man]] before being forced to flee. He was later hired by a New York crime ring to kidnap the son of the [[Cat (Shen Kuei)|Cat]], who was setting himself up to be a rival gang lord, but the Cat and [[Spider-Man (Peter Parker)|Spider-Man]] defeated them. \n\nFinally working on his own behalf, Shockwave joined [[Killer Shrike]], [[Orka]], and [[Whiplash (Mark Scarlotti)|Whiplash]] in trying to take over the retired Intrepid aircraft carrier to extort money from the U.S. government, but they were foiled by the [[Heroes for Hire]]. He also joined the [[Crimson Cowl (Justine Hammer)|Crimson Cowl]]’s [[Masters of Evil]] in their attempt to blackmail the world’s governments with a weather-control device, but they were confronted by the [[Thunderbolts]] and defeated. Shockwave was among those remanded to custody. \n\nShockwave appeared as one of the many villains who were freed upon a massive breakout of the [[Raft]] staged by [[Electro (Maxwell Dillon)|Electro]]. Although many were thwarted by the new Avengers, Shockwave managed to escape.",
        "categories": [
            "People",
            "International",
            "Villains",
            "Civil War"
        ]
    }
}