{
    "id": 1010782,
    "name": "Ben Urich",
    "description": "Ben Urich is a reporter for the Daily Bugle who has many ties to the city's superhero community.",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/5/90/4c00373d10e5e",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010782",
    "comics": {
        "available": 11,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010782/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/37257",
                "name": "Alias (2003) #10"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/37255",
                "name": "Alias Omnibus (Hardcover)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/24415",
                "name": "Amazing Spider-Man (1999) #608"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/16889",
                "name": "Amazing Spider-Man Annual (1964) #15"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/16890",
                "name": "Amazing Spider-Man Annual (1964) #16"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/15616",
                "name": "Daredevil (1998) #16"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/15617",
                "name": "Daredevil (1998) #17"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/955",
                "name": "Daredevil Vol. III: Wake Up (Trade Paperback)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/15855",
                "name": "Mighty Avengers (2007) #4"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/21802",
                "name": "Mighty Avengers Vol. 1: The Ultron Initiative (Trade Paperback)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/23477",
                "name": "Venom: Lethal Protector (1993) #1"
            }
        ],
        "returned": 11
    },
    "series": {
        "available": 9,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010782/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/672",
                "name": "Alias (2003)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/13383",
                "name": "Alias Omnibus (2006)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/454",
                "name": "Amazing Spider-Man (1999 - 2013)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2984",
                "name": "Amazing Spider-Man Annual (1964 - Present)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/449",
                "name": "Daredevil (1998 - 2011)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/20",
                "name": "Daredevil Vol. III: Wake Up (1999)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1866",
                "name": "Mighty Avengers (2007 - 2010)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/5381",
                "name": "Mighty Avengers Vol. 1: The Ultron Initiative (2008)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/6685",
                "name": "Venom: Lethal Protector (1993)"
            }
        ],
        "returned": 9
    },
    "stories": {
        "available": 8,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010782/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/31929",
                "name": "Wake Up Part 1",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/31932",
                "name": "Wake Up Part 2",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/32378",
                "name": "4 of 6 - Ultron; THE INITIATIVE BANNER",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/35397",
                "name": "Spider-Man: Threat Or Menace?",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/35407",
                "name": "",
                "type": "profile"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/52045",
                "name": "Lethal Protector Part 1: Dark Soul Drifting",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/54188",
                "name": "Amazing Spider-Man (1999) #608 - Int",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/82495",
                "name": "[untitled]",
                "type": "interiorStory"
            }
        ],
        "returned": 8
    },
    "events": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010782/events",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/events/255",
                "name": "Initiative"
            }
        ],
        "returned": 1
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010782/ben_urich?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Urich%2C_Ben?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Ben Urich",
        "aliases": "none",
        "identity": "Publicly Known",
        "occupation": "Reporter",
        "citizenship": "U.S. citizen with no criminal record",
        "place_of_birth": "",
        "relatives": "Doris (wife); Arnold (brother); Mindy (sister-in-law); Ken (nephew); Philip (a.k.a. Green Goblin, nephew); unnamed father",
        "groups": "Daily Bugle staff",
        "education": "NYU degree in journalism",
        "height": "5' 9\"",
        "weight": "140 lbs.",
        "eyes": "Brown",
        "hair": "Brown",
        "powers": "None.  Ben Urich is an experienced reporter and writer.  He is in reasonably fit physical condition for a chain smoker of his age.",
        "abilities": "",
        "weapons": "",
        "paraphernalia": "",
        "debut": "Daredevil #153 (1978)",
        "origin": "Daredevil #192 (1983)",
        "significant_issues": "Revealed that he had learned Daredevil's secret identity, promised to keep it secret (Daredevil Vol. 1 #164, 1980); helped Daredevil rescue Vanessa Fisk from the King (Daredevil Vol. 1 #180, 1982); investigated former mentor, turned down real estate deal from the Kingpin (Daredevil Vol. 1 #192, 1983); warned away from investigating Matt Murdock's disappearance, targeted by Kingpin's operative Lois, rescued by Daredevil (Daredevil Vol. 1 #229-231, 1986); tried to interview Lois, endangered by assassins, killed one of them (Daredevil Vol. 1 #232, 1986); reunited with Emily Blake through machinations of the Kingpin (Daredevil Annual #7, 1991); attempted to prevent Sara Harrington from exposing Daredevil's secret identity (Daredevil Vol. 1 #325, 1994); discovered warehouse headquarters of Harry Osborn (Green Goblin #1, 1995); attacked by Kruel, confronted Daredevil, believing that he was not Matt Murdock (Daredevil Vol. 1 #339, 1995); abducted by Mister Fear (Cranston), rescued by Daredevil (Over the Edge #1, 1995); investigated history of the Green Goblins and abduction of Normie Osborn, worked with Spider-Man and the Molten Man, wrote book about Osborns (Spider-Man:  Legacy of Evil, 1996); confronted by the Green Goblin (Norman Osborn) (Spider-Man Vol. 1 #75, 1996); pursued story on Timmy Lange (Daredevil Vol. 2 #16-19, 2001); denied allegation that Daredevil was Matt Murdock (Daredevil Vol. 2 #34, 2002); followed Jessica Jones, told her about MGH ring (Alias #19, 2003); agreed to work with Jessica Jones on Daily Bugle feature (Pulse #1, 2004); met with Milla Donovan, expressed concerns to Daredevil (Daredevil Vol. 2 #56-59, 2004)",
        "main_image": "ben_urich.jpg",
        "bio_text": "Ben Urich obtained a job as copy boy for the Daily Bugle while still in college and began his reporting career under city editor Jimmy Hughes.  Urich longed to put his talent to work on criminal investigations and sought leads on such crime figures as Hammerhead and Fortunato, but after years of reporting he remained assigned to minor new items.  In the course of pursuing one such event, a farm festival, he was present at a diner when the criminal called Kruel burst upon the scene, fleeing from his employer, Kingpin Wilson Fisk.  Fisk beat Kruel and left him for dead, then had Urich and other witnesses drugged to forget the encounter.  Perhaps subconsciously influenced by this incident, Urich's efforts to break into crime investigation soon proved successful, and he covered both petty and organized crime in New York, occasionally working with photographer Peter Parker, secretly the super hero Spider-Man.",
        "bio": "Ben Urich obtained a job as copy boy for the Daily Bugle while still in college and began his reporting career under city editor Jimmy Hughes.  Urich longed to put his talent to work on criminal investigations and sought leads on such crime figures as Hammerhead and Fortunato, but after years of reporting he remained assigned to minor new items.  In the course of pursuing one such event, a farm festival, he was present at a diner when the criminal called Kruel burst upon the scene, fleeing from his employer, Kingpin Wilson Fisk.  Fisk beat Kruel and left him for dead, then had Urich and other witnesses drugged to forget the encounter.  Perhaps subconsciously influenced by this incident, Urich's efforts to break into crime investigation soon proved successful, and he covered both petty and organized crime in New York, occasionally working with photographer Peter Parker, secretly the super hero Spider-Man.\n\nDespite his relative success, Urich hoped for a major news story that would earn him recognition and perhaps the Pulitzer Prize.  He focused on the costumed hero Daredevil, and soon amassed heavy files on the hero, on whom he spent hours of research.  Urich's work paid off when he deduced Daredevil's secret identity of Matt Murdock and successfully traced the events that had led Murdock to begin his crimefighting career.  However, Urich empathized with the hero and his mission, and when the two met in person, Urich even aided Daredevil during one of the hero's own investigations.  He spoke with Daredevil to confirm his own conclusions, then, having decided that the good Daredevil did in New York outweighed his own desire for fame, he burned his files, leaving the secret his own for the time being.\n\nShortly after these events, Urich met with a source in pursuit of an investigation of crooked mayoral candidate Randolph Cherryh, only to see his source slain by Elektra, at that time an assassin for the Kingpin.  Elektra warned Urich to drop his investigations, but he found another method of forestalling Cherryh's rise to office when he discovered the whereabouts of the Kingpin's estranged wife Vanessa, living in the sewers as an amnesiac.  Alongside Daredevil, he ventured into the realm of the deranged King of the Sewers and watched as Daredevil won Vanessa's freedom.  Daredevil then offered the Kingpin Vanessa's return in exchange for Cherryh's fall, an offer the crimelord was compelled to accept.\n\nUrich soon learned that, having earned the Kingpin's attention, he would not easily escape it.  Subsequently investigating what he took to be false allegations of misconduct by his mentor Jimmy Hughes, he learned of a housing offer that would allow his wife Doris and himself a higher standard of living.  However, after learning that Hughes had indeed acted under mob influence in his newspaper work, Urich also found out that the housing offer was covertly controlled by the Kingpin, who wanted the reporter in his debt.  Urich ultimately ran the story about Hughes. When Doris learned of the Kingpin's manipulations from Daredevil, she agreed not to pursue the house.\n\nWhen the Kingpin learned Daredevil's secret identity and orchestrated his enemy's downfall, Urich investigated Police Lieutenant Nick Manolis, who had been forced to frame Murdock for criminal activities.  During their interview, one of the Kingpin's operatives, a woman named Lois, severely beat Manolis, pausing to break Urich's fingers.  Afraid for his life, Urich dropped the investigation, but his shame at this intimidation prevented him from working.  When Manolis called him to confess, Urich feigned ignorance of the subject, only to listen, horror-stricken, as Lois murdered Manolis.  Urich regained his dedication and wrote an expose of Murdock's framing, but in return, he and his wife were targeted by the Kingpin who sent Lois to kill them both.  Daredevil rescued the Urichs and captured Lois, who was sent to prison.  Urich attempted to interview her there, only to see her slain by more of the Kingpin's operatives; a prison guard shot down one of the assailants, and Urich, driven by adrenaline, beat the other to death with his own gun.  Following these events, Urich continued to find himself the object of the Kingpin's interest, as when the crimelord manipulated him into a reunion with his high school sweetheart, Emily Blake, in the hope of damaging Urich's marriage; however, Urich refused to be intimidated again.\n\nUrich's own investigation came back to haunt him when fellow reporter Sara Harrington discovered fragments of Urich's Daredevil notes and wrote her own expose on the hero's secret identity, despite Urich's protests.  The charge seemed false when Matt Murdock's home was searched and no incriminating evidence was found, but Daredevil himself, concerned by the coverage, faked the death of his civilian identity and took the new identity of Jack Batlin while augmenting his costume with body armor.  Unaware of this move, Urich was grief-stricken when Murdock was reported dead and held himself partially responsible for allowing Harrington to uncover his notes.\n\nUrich threw himself into a new project, a book detailing the histories of the various criminals who had used the Green Goblin identity, most notably industrialist Norman Osborn and his son Harry, both believed dead.  His investigations led to an abandoned warehouse laboratory, where, unknown to him, his intern and nephew Philip was inadvertently bonded to a high-tech mask, which he used to briefly become a heroic, if somewhat frivolous, Green Goblin.  However, Urich's investigation of a seemingly defunct criminal legacy faded before another forgotten danger when Kruel, having spent the last few years in amnesiac wandering, began tracking down the witnesses to his clash with the Kingpin in the deluded hope of rebuilding his memories via their deaths.  He attacked Ben and Doris Urich, leaving Doris hospitalized for a time.  When Daredevil investigated wearing his new costume, Urich, believing him to be an impostor cashing in on Murdock's reputation, scorned him, although Daredevil nevertheless defeated Kruel.  Weeks later, Daredevil, undergoing a mental crisis, changed to his original yellow costume and taunted Urich at his office window.  Urich was unsure of what to make of these developments, but his efforts to understand them were interrupted when Mister Fear (Cranston) abducted him as part of a trap against Daredevil.  The hero, back in his familiar red costume, rescued Urich, who despite the familiar garb failed to recognize Daredevil as Murdock.  Eventually Murdock revealed that his death had been a hoax, and he renewed his friendship with Urich.\n\nStill pursuing his book, Urich sought an interview with Harry Osborn's widow Liz, but the exchange was interrupted when three female robots abducted Osborn's young son Normie as part of a computerized contingency plan set into motion by Osborn prior to his death.  Accompanied by Spider-Man and the Molten Man, Urich helped uncover Normie's whereabouts and rescue the child.  He completed his book, \"Dynasty of Evil,\" which proved a financial success, but he faced an unexpected complication when Norman Osborn showed up alive and well, claiming vendettas against Urich and others at the Daily Bugle.  Later occupied by his own megalomaniacal schemes, Osborn declined to pursue legal action against Urich for supposed slander, but he did publish his own autobiography whose allegations cast aspersions on Urich's work.\n\nUrich next threw himself into an investigation of  young Timmy Lange, an abused and autistic boy who had witnessed a fight between Daredevil and Timmy’s father, one of the costumed criminals called Leap-Frog. Urich became so engrossed in Timmy's story that he failed to cover an ongoing trial of the Kingpin; he later made arrangements for the boy to live with the Urichs while he recovered from his trauma.  However, he was soon brought back to his former concerns when the Daily Globe revealed Daredevil's secret identity as Matt Murdock.  Urich's claim that the allegation was false hardly endeared him to Bugle publisher J. Jonah Jameson, who was determined to use the revelation in his campaign against costumed heroes, but Jameson nevertheless trusted Urich with an assignment to follow former costumed hero Jessica Jones, whom Jameson believed was involved in the disappearance of his ward, Mattie Franklin.  Urich aided Jones in discovering that Franklin had in fact been abducted by a cartel distributing a Mutant Growth Hormone drug, and she was soon returned to the Jamesons.\n\nWhile Urich grew closer to Jones since both were assigned to a newspaper feature highlighting costumed superhumans, he became estranged from Daredevil whose actions had become increasingly erratic.  When Daredevil disappeared for a time, Milla Donovan, whom he had secretly married, sought out Urich, who discovered the hero in a secret hospital facility.  Urich expressed his concerns that Daredevil was suffering a nervous breakdown; it remains to be seen how Daredevil's recovery will affect his friendship with Urich.",
        "categories": [
            "Marvel Knights",
            "Spider-Man",
            "Civil War"
        ]
    }
}