{
    "id": 1010705,
    "name": "Spectrum",
    "description": "",
    "modified": "2013-08-30T11:37:35-0400",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/9/00/4c0030bee8c86",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010705",
    "comics": {
        "available": 4,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010705/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/7094",
                "name": "Avengers (1963) #227"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/7100",
                "name": "Avengers (1963) #232"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/7118",
                "name": "Avengers (1963) #249"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/7164",
                "name": "Avengers (1963) #290"
            }
        ],
        "returned": 4
    },
    "series": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010705/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1991",
                "name": "Avengers (1963 - 1996)"
            }
        ],
        "returned": 1
    },
    "stories": {
        "available": 4,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010705/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/14727",
                "name": "Cover #14727",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/14739",
                "name": "Cover #14739",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/14775",
                "name": "Cover #14775",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/14867",
                "name": "Cover #14867",
                "type": "cover"
            }
        ],
        "returned": 4
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010705/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010705/spectrum?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Rambeau,_Monica?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Monica Rambeau",
        "identity": "Secret",
        "occupation": "Adventurer, charter fishing operator; former shipping company executive, cargo ship captain, harbor patrol officer (lieutenant)",
        "place_of_birth": "New Orleans, Louisiana",
        "groups": "Formerly [[Nextwave]], [[Secret Avengers]], [[Avengers]], [[Queen's Vengeance]], New Orleans Harbor Patrol",
        "citizenship": "U.S.A.",
        "education": "College and Police Academy graduate",
        "aliases": "Pulsar, Photon, Daystar, Captain Marvel, Sceptre, Lady-of-Light",
        "relatives": "Frank Rambeau (father), Maria Rambeau (mother)",
        "height": "5'10''",
        "weight": "130 lbs.",
        "eyes": "Brown",
        "hair": "Black",
        "powers": "Pulsar can transform herself into any form of energy within the electromagnetic spectrum. Among the many energy forms she has assumed are cosmic rays, gamma rays, X-rays, ultraviolet radiation, visible light, electricity, infrared radiation, microwaves, radio waves and neutrinos. She is invisible and intangible in many of her energy forms (the most frequent exception being visible light), and is capable of flight in all her energy forms (reaching velocities up to and including light speed). She also has the ability to project these energies from her body while she is in human form, usually in the form of energy blasts from her hands; a variation of this ability enables her to project light-based holographic illusions. When she encounters a new or unfamiliar energy, Pulsar can often duplicate it given enough time for analysis, such as when she replicated and drained the verdant will-powered energies of an extra-dimensional emerald gladiator. Pulsar tends to be physically insubstantial in her energy forms, though with concentration and effort she can sometimes perform tasks such as briefly grasping an object, either by partially solidifying or by applying some sort of force to the object in question.",
        "abilities": "Monica has strong leadership skills and law enforcement experience. She is an excellent markswoman, unarmed combatant, detective and swimmer with extensive nautical expertise.",
        "debut": "Amazing Spider-Man Annual #16 (1982)",
        "origin": "",
        "significant_issues": "",
        "main_image": "Pulsar_Head.jpg",
        "bio_text": "Monica Rambeau has always been devoted to serving and protecting the public, both as herself and in her various costumed guises. Before she became one of the brightest stars in the age of marvels, Monica Rambeau was a dedicated lieutenant in the New Orleans harbor patrol, partnered with the daring John Audain. Monica's life changed when old Rambeau family friend Professor Andre LeClare came to her for help; he had developed an other-dimensional energy-tapping device with financial support from South American dictator Ernesto Ramirez, who intended to use LeClare's technology to create incredibly dangerous weapons. Ramirez had already begun adapting the technology for his own purposes with the aid of scientist Felipe Picaro, but LeClare and Rambeau joined forces to destroy Picaro's prototype. In the process, Rambeau was bombarded by the device's extra-dimensional energies and gained the power to convert her own body into energy and back again at will. LeClare urged her to use this power as a crimefighter, and she left the harbor patrol to become a full-time adventurer.",
        "bio": "Monica Rambeau has always been devoted to serving and protecting the public, both as herself and in her various costumed guises. Before she became one of the brightest stars in the age of marvels, Monica Rambeau was a dedicated lieutenant in the New Orleans harbor patrol, partnered with the daring John Audain. Monica's life changed when old Rambeau family friend Professor Andre LeClare came to her for help; he had developed an other-dimensional energy-tapping device with financial support from South American dictator Ernesto Ramirez, who intended to use LeClare's technology to create incredibly dangerous weapons. Ramirez had already begun adapting the technology for his own purposes with the aid of scientist Felipe Picaro, but LeClare and Rambeau joined forces to destroy Picaro's prototype. In the process, Rambeau was bombarded by the device's extra-dimensional energies and gained the power to convert her own body into energy and back again at will. LeClare urged her to use this power as a crimefighter, and she left the harbor patrol to become a full-time adventurer. \n\nDubbed Captain Marvel by the media, Rambeau sought out the Avengers for help in mastering her new powers and became a member-in-training of their group. Befriended and mentored by Avengers veterans Captain America and the Wasp, Monica soon graduated to full membership, serving a lengthy stint during which she became one of the team's most valuable and respected members. One early complication was the memory of an earlier Captain Marvel, the legendary alien warrior Mar-Vell, a deceased honorary member of the Avengers. Rambeau felt awkward about inheriting his title after she learned of his existence, but she retained the name since the Avengers and others regarded her as a worthy heir to Mar-Vell's heroic legacy. Another new Avengers recruit, Mar-Vell's close friend Starfox (Eros), disapproved of Monica using the Captain Marvel name at first; but even he was soon impressed by Monica's character and ability, giving her his blessing and saluting the new Captain Marvel. \n\n[[image:MonicaRambeau01.jpg|thumb|left|180px]]As an Avenger, Monica faced foes such as Maximus, the Enclave, Annihilus, the Lava Men (who mistook her for the divine Lady-of-Light of their legends), [[Morgan Le Fay]], the Dire Wraiths, Maelstrom, the Skrulls, Kang, Attuma, Freedom Force, an insane Quicksilver, Tyrak, and Grandmaster's Legion of the Unliving, even battling an army of Earth's major super-criminals during the Beyonder's Secret Wars alongside many of Earth's foremost heroes. Two of Monica's earliest recurring enemies were super-powered psychiatrist Moonstone (Karla Sofen), who became one of Monica's bitterest foes, and Moonstone's powerful pawn Blackout (Marcus Daniels), who wielded the eerie Darkforce. Captain Marvel first encountered them when the Avengers opposed the duo's escape from incarceration in [[Project: PEGASUS]]. The pair would later return as members of Baron (Helmut) Zemo's Masters of Evil, participating in an occupation of Avengers Mansion and trapping Monica in the Darkforce dimension; but Captain Marvel escaped in time to help retake the Mansion during a series of skirmishes that left Moonstone temporarily crippled and Blackout dead. Another of Monica's major early foes was the murderous interstellar pirate Nebula, who shanghaied Monica into space for an extended period before she was reunited with the Avengers; but while Monica's adventures spanned space and time, she remained one of the most down-to-Earth Avengers. Her powers allowed her to make frequent visits to her native New Orleans, where she maintained a close and loving relationship with her parents. She even started a charter fishing business, eventually working on the water alongside her father, a retired firefighter and Monica's original heroic inspiration. \n\nWhen an exhausted Wasp stepped down as Avengers chairwoman, Captain America nominated Captain Marvel to replace her as team leader. Though she was overwhelmed at the prospect, Monica accepted the post and filled it quite capably at first, even seeing the team through a conflict with the Olympian gods; however, Monica became increasingly uneasy in her new role, a situation made worse after ambitious new recruit Doctor Druid began undermining her leadership. Finally, when honorary Avengers member Marrina transformed into the gigantic sea monster Leviathan, Captain Marvel led the hunt for the creature; during the battle that followed, Monica made contact with sea water while in her electrical form and accidentally conducted herself across the surface of the ocean, depleting her energies so gravely and dispersing her atoms so widely that she could barely regain physical form, emerging as a frail, withered husk of a woman devoid of super-powers. Forced to retire from the team, Monica fought her way back to health and eventually regained her powers, though in a reduced and altered form that allowed her to surround herself with a manipulable energy field. She resumed crimefighting, facing foes such as Brazilian crimelord Kristina Ramos, Moonstone, Powderkeg, the Sons of the Serpent, the Blue Marvel and the alien Starblasters. At the same time, she served as a cargo ship captain in her friend Ron Morgan's shipping company before starting her own charter business. Her original powers gradually regenerated, fully returning after the alien Stranger helpfully accelerated the process. \n\n[[image:MonicaRam02.jpg|thumb|right|200px]]Monica has yet to return to the full-time Avengers roster, but has stayed connected with the team and served often as a reservist, sometimes assuming leadership duties in the absence of the current chair. She helped repel an Atlantean invasion, opposed the [[Acts of Vengeance]] conspiracy, chaired a reserve substitute roster during the team's first United Nations-backed reorganization, led an Avengers delegation to the Shi'ar empire during the Kree-Shi'ar war, played a key role in overthrowing the alternate reality tyranny of Morgan le Fay (Monica being one of only a few heroes whose sense of Avengers spirit was strong enough to overcome Morgan's mind-warping magic), battled the Wrecking Crew, advised troubled new recruit Triathlon, led an ad hoc squad of Avengers in saving the galaxy from relocation by the Infinites, helped contain Bloodwraith, fought Lord Templar & Pagan, faced the Triple-Evil, helped liberate Earth from the forces of Kang, battled The Order, assisted during the Scorpio crisis, and was one of many Avengers who confronted an insane Scarlet Witch. Rambeau also helped staff the Avengers' deep space monitoring station in the asteroid belt between Mars and Jupiter, being one of the few Avengers who could commute there with ease. For a time, Monica's mother was intercepting her Avengers calls since she feared for her daughter's safety and wanted Monica to spend more time with her ailing father, but Monica soon put a stop to her mother's meddling. Whether she will work with the newly reorganized Avengers at some point remains to be seen. \n\n[[image:MonicaRam03.jpg|thumb|left|200px]]When the late Mar-Vell's offspring Genis became an adventurer, he soon became known as Captain Marvel like his father before him-which Monica resented at first. After she and Genis teamed up to defeat the Controller, Genis tried to concede the Captain Marvel title to Monica since he felt she was more worthy of it; but Monica declined out of respect for the Mar-Vell legacy, impulsively adopting a new costumed alias as Photon. More recently, Genis-physically and mentally transformed after a near-death experience and wanting to establish a new identity for himself distinct from his father-started calling himself Photon. Monica confronted him, tensely at first, but the two Photons ended up brainstorming super-hero names over coffee. Neither one of them wanted to become Captain Marvel again given all the baggage associated with the name, but Monica decided to let Genis keep the Photon alias after she came up with a name she liked better: Pulsar. A hero by any name, Monica remains one of the most formidable adventurers of her generation.\n\n\nRecently Monica has taken up the leadership mantle of the rogue superhero squad Nextwave and played a stellar role in helping [[Black Panther (T'Challa)|Black Panther]], [[Luke Cage]], [[Blade (Eric Brooks)|Blade]], and [[Brother Voodoo (Jericho Drumm)|Brother Voodoo]] rid her native New Orleans of an infestation of vampires.",
        "categories": [
            "Avengers",
            "Women",
            "Heroes",
            "Civil War"
        ]
    }
}