{
    "id": 1010951,
    "name": "Mysterio (Daniel Berkhart)",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/40/image_not_available",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010951",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010951/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010951/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010951/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010951/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010951/mysterio_daniel_berkhart?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Mysterio_%28Daniel_Berkhart%29?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Daniel \"Danny\" Berkhart",
        "identity": "Known to authorities",
        "occupation": "former criminal",
        "place_of_birth": "unrevealed",
        "groups": "None; Former [[Sinister Seven]], [[Sinister Six]]",
        "citizenship": "U.S.A with a criminal record",
        "education": "High-school level",
        "aliases": "Jack O'Lantern, Mad Jack,",
        "relatives": "unrevealed",
        "height": "5'10\"",
        "weight": "160 lbs.",
        "eyes": "blue",
        "hair": "brown",
        "powers": "",
        "abilities": "Berkhart learned from the original Mysterio all of his skills. He is master of make-up, physical stunt work, mechanical and visual special effects. He knew basic psychiatry and could employ hypnotism successfully. He also learned a great deal of applied chemistry, especially the use of hallucinogens, and electronics. He is a meticulous planner and organizer, and a skilled actor who keep himself in top physical form.",
        "paraphernalia": "Original costume contained boots with chemical smoke ejectors to produce a concealing mist, magnetic plate springs allowing him to leap heights, an acid spray in his gloves, enabling him to dissolve Spider-Man's webbing, and a one-way helmet with a built-in sonar device that jammed Spider-Man's spider-sense and allowed Mysterio to see through his mist. It also has \"psychedelic power\" to his helmet, knock-out gas, an electrically-charged cloak, hypnogens in his cloaking mist, electric bolts from his gloves, tranquilizer dart gun, an electro-magnetic disrupter beam, automatons, holographic projectors, and a stolen Digital Imagery Transmission chip. Berkhart used Beck’s equipment but also employed a sensory-deprivation tank to enhance the effect of his hallucinogens. When he was Jack O'lantern he had a round shape glider.",
        "debut": "(As Mysterio) Amazing Spider-Man #141 (1975); (As Jack O’lantern) Spectacular Spider-Man Vol. 1 #241 (1996)",
        "origin": "(As Mysterio) Amazing Spider-Man #141 (1975);",
        "significant_issues": "",
        "main_image": "Mysterio (Daniel Berkhart) Head.jpg",
        "bio_text": "When the original [[Mysterio (Quentin Beck)]] was captured and jailed. He devised a quiet, long-term plan, a nursing home scam whereby he would trick the infirm into signing all their wealth over to him. To this end, he made use of his cellmate, Daniel Berkhart, taking him into his confidence, teaching him all his secrets and training him to replace him as Mysterio, even as he engineered his own \"death\". Berkhart was released, looking for revenge on behalf of his \"buddy\" Beck, and was hired by [[Jameson, J. Jonah|Jameson]] to pretend to be the ghost of Mysterio and capture [[Spider-Man (Peter Parker)|Spider-Man]]. He plagued Spider-Man with illusions, even as Peter Parker, by planting an image-inducer on the wall-crawler's costume. Spidey later used the inducer to track down and confront a nervous Berkhart. When Spider-Man wasn't fooled by the ghost routine, Berkhart lost his temper and was easily overcome. Jameson abandoned him when he was jailed and he resented Jameson ever since.",
        "bio": "When the original [[Mysterio (Quentin Beck)]] was captured and jailed. He devised a quiet, long-term plan, a nursing home scam whereby he would trick the infirm into signing all their wealth over to him. To this end, he made use of his cellmate, Daniel Berkhart, taking him into his confidence, teaching him all his secrets and training him to replace him as Mysterio, even as he engineered his own \"death\". Berkhart was released, looking for revenge on behalf of his \"buddy\" Beck, and was hired by [[Jameson, J. Jonah|Jameson]] to pretend to be the ghost of Mysterio and capture [[Spider-Man (Peter Parker)|Spider-Man]]. He plagued Spider-Man with illusions, even as Peter Parker, by planting an image-inducer on the wall-crawler's costume. Spidey later used the inducer to track down and confront a nervous Berkhart. When Spider-Man wasn't fooled by the ghost routine, Berkhart lost his temper and was easily overcome. Jameson abandoned him when he was jailed and he resented Jameson ever since.\n\n\n[[image:mystery.jpeg|left|thumb]]Berkhart served his sentence and resurrected when [[Green Goblin (Norman Osborn)|Norman Osborn]] returned. This time he took the alias of Jack O'lantern calling himself Mad Jack and he had a partner named [[Mad Jack (Maguire Beck)|Maguire Beck]] as tech support. He was paid to get Jameson to sell the [[Daily Bugle]] to his employer Norman Osborn. Spider-Man tried to intervene, but was defeated by Mad Jack. Mad Jack then attacked Jameson and beat him badly and threatened to hurt his wife if he wouldn't sell the Bugle. Jameson agreed to sell the paper and Mad Jack left. He later rejected the payment for the service to Norman by saying that he did it for the pleasure.\n\nHe kept on working for Norman for sometime and teamed with [[Conundrum]] against Prodigy (Peter Parker). As Prodigy was fighting the two villains he realizes that he has a better change to win if he relies on his spider-sence, because Mad Jack used Mysterio's illusion tricks. He managed to knock Conundrum out and saw when one of Norman's bodyguards shot Mad Jack and he apparently killed him. Later it is revealed that Mad Jack didn’t die. The death was staged, because it served the purposes of both Mad Jack and Norman Osborn.\n\nUpon learning of Beck's death, Berkhart again took up the Mysterio identity, giving his Mad Jack identity to his protégé Maguire Beck, Quentin's cousin. He joined in with the [[Sinister Seven]], ostensibly to get vengeance on [[Doctor Octopus (Otto Octavius)|Doctor Octopus]], but in reality to use them for his own ends. He and [[Electro (Maxwell Dillon)|Electro]] gained control of Senator [[Ward, Stewart|Stewart Ward]], who had been permeated with a strange energy. Before they could make use of him though, they had to deal with [[Venom (Eddie Brock)|Venom]], who was hunting down the rest of the Sinister team members. Berkhart abandoned the group and instead kidnapped those who had the most contact with Spider-Man, subjecting them to an artificial scenario in which [[Thompson, Flash|Flash Thompson]] was a super hero in an attempt to learn Spider-Man's identity. Flash finally broke free of the illusion but Berkhart escaped. Most recently, Berkhart was involved with Maguire in a plan to kill Spider-Man, [[Daredevil (Matthew Murdock)|Daredevil]], [[Smith, Joe|Joe Smith]] and [[Schneider, Betsy|Betsy Schneider]]. He crossed paths with Spider-Man couple of times till Spider-Man managed to capture him with help of civilian.\n\nDaniel seems to have been freed from prison or escaped and he recently fought with Spider-Man and [[Mysterio (Francis Klum)|Francis Klum]] who also adopted Mysterio's identity by buying one of Quentin's old costumes from Kingpin. In the mist of the fight Spider-Man managed to knock Daniel out, but Klum kept him busy for a while and he managed to escape without anyone noticing.",
        "categories": [
            "Spider-Man",
            "Villains"
        ]
    }
}