{
    "id": 1010937,
    "name": "Josiah X",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/40/image_not_available",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010937",
    "comics": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010937/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/20499",
                "name": "Crew (2003) #5"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/20501",
                "name": "Crew (2003) #7"
            }
        ],
        "returned": 2
    },
    "series": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010937/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/553",
                "name": "Crew (2003)"
            }
        ],
        "returned": 1
    },
    "stories": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010937/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/43912",
                "name": "Cover #43912",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/43914",
                "name": "Cover #43914",
                "type": "cover"
            }
        ],
        "returned": 2
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010937/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010937/josiah_x?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Josiah_X?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "identity": "Secret",
        "real_name": "Josiah al hajj Saddiq (legally changed, former legal name unrevealed)",
        "occupation": "Muslim minister; former mercenary",
        "place_of_birth": "Unknown",
        "groups": "The Crew",
        "citizenship": "Citizen of the United States (false identity of Josiah Smith has a military criminal record)",
        "education": "Unknown",
        "aliases": "Josiah X, Justice, Josiah Smith, A-39",
        "relatives": "[[Bradley, Isaiah|Isaiah Bradley]] (genetic/adoptive father), Faith Bradley (adoptive mother), Sarah Gail Bradley (sister),  Elijah Bradley ([[Patriot (Elijah Bradley)|Patriot]], nephew), Stephanie Bradley (niece), Letigious Bradley (nephew), two other unidentified nieces, unidentified brother-in-law, unidentified surrogate mother",
        "height": "6'2\"",
        "weight": "240 lbs",
        "eyes": "Brown",
        "hair": "Bald (Black)",
        "abilities": "In the course of his many years, Josiah X (Justice) has had experience and training as a soldier, a radical activist and as a mercenary. He has learned a variety of martial arts styles, foreign languages and weapons training. Justice is a highly skilled combatant.",
        "weapons": "Josiah X (Justice) carries the scarred battle shield belonging to his father, Isaiah, an unsophisticated concave triangular shield, useful for defense or as an attack weapon.  Justice does not typically carry a firearm but has no compunction against using one. He will often turn his enemies' weapons against them.   Justice's shirt is a chain mail mesh (similar to that of [[Captain America (Steve Rogers)|Captain America]]), capable of stopping most small arms fire.",
        "paraphernalia": "",
        "powers": "Thanks to his father's genetic inheritance, Josiah is at 'peak human' condition much like his father and Steve Rogers. Like these men, he has genetically enhanced strength, speed, agility and mental acuity.  Justice is a genetically engineered enhanced human. During his creation his genetic code was monitored with great precision, and manipulated to compensate for the side effects of the unrefined Super Soldier serum. Scientists were able to synthesize a more balanced replica of the peak human speed, strength and endurance greater than any warrior, solider or athlete.  Josiah can lift (press) up to a maximum of 850 pounds with extreme effort. His body eliminates the excessive build-up of fatigue-producing poisons in his muscles, resulting in his phenomenal endurance. Due to his unique genetic makeup, Josiah's aging process is greatly slowed. Though he is well over fifty, Josiah appears to be roughly 25 years old.",
        "creators": "Christopher Priest and Joe Bennett",
        "debut": "The Crew # 1 (May, 2003)",
        "origin": "The Crew # 5 (September, 2003)",
        "significant_issues": "The Crew # 5 (September, 2003); The Crew #7 (November, 2003)",
        "main_image": "The Crew 5.jpg",
        "bio_text": "Josiah X's story is the story of his father, [[Bradley, Isaiah|Isaiah Bradley]], an African-American soldier who was used as a guinea pig in secret, illegal and immoral U.S. experiments to re-create the Super-Soldier process which created [[Captain America (Steve Rogers)|Captain America]]. Out of the hundreds of African-American men experimented on, only three survived, Isaiah among them. Although the serum left Isaiah and his new wife Faith unable to conceive, they had been blessed with their first child, a daughter named Sarah Gail, already on the way before Isaiah enlisted into the U.S. Army during World War II.",
        "bio": "Josiah X's story is the story of his father, [[Bradley, Isaiah|Isaiah Bradley]], an African-American soldier who was used as a guinea pig in secret, illegal and immoral U.S. experiments to re-create the Super-Soldier process which created [[Captain America (Steve Rogers)|Captain America]]. Out of the hundreds of African-American men experimented on, only three survived, Isaiah among them. Although the serum left Isaiah and his new wife Faith unable to conceive, they had been blessed with their first child, a daughter named Sarah Gail, already on the way before Isaiah enlisted into the U.S. Army during World War II.\n\nIsaiah and Faith Bradley's second child, the boy who would one day grow into the man called Josiah X, was not actually born to the couple. When Josiah came into this world it was by way of artificial insemination, using both Isaiah's inactive sperm following the effects of the Super-Soldier Serum and a healthy sample from before the Serum was administered. Like her husband before her, Faith's body was violated by men in the U.S. military involved in the dark events that took place at Camp Cathcart, men who helped exploit the African-American soldiers who'd been experimented on. The eggs were stolen from Faith's womb when she had her appendix removed, three months before Josiah was conceived. They tried dozens of times to somehow stimulate the Serum-altered sperm and carry a child to term. Josiah's official designation of A-39 implies that there had been 39 attempts to create a Super-Soldier with Josiah's fertilization being the only success.\n\n=== The Surrogate ===\nCarried in the womb of a surrogate with the same blood type and physical type as his genetic mother, Josiah was saved by the same young girl who had birthed his infant form. She overheard the military men who had paid her to be a part of this experiment discussing the dissection of the young child. \n\n[[image: The_surrogate.jpg]]\n\nSo she stole the baby boy from the nursery and the papers from the file, left the hospital and went to the address they had listed for Faith Bradley. In a ruse to save her son, she feared that if the U.S. military learned of his existence they would take him away, Faith publicly told the girl she was stupid, that their house was watched, and with Sarah Gail's doll in the basket she sent the girl out, screaming for her to run. Then, late at night Faith and Sarah Gail snuck out of the house and put the infant on a train, Sarah Gail left a note on her brother’s blanket, \"My name is Josiah.\"\n\nIsaiah, who had been wrongfully imprisoned for stealing Captain America's uniform, was finally pardoned in 1960 by an outgoing President Eisenhower. As a result Isaiah and Faith were sworn to secrecy under strict penalty of law. But his story wouldn't end there, as the name of Isaiah Bradley was fast becoming legendary within the African-American community, where many are heard to refer to him as the original, Black Captain America.\n\nJosiah grew up in a Catholic orphange outside of Boston during the early years of his life. When lashing out at one of the nuns in his early teens, Josiah's powers revealed themselves. Believing he had accidentally killed the nun called Sister Irenia, he fled. While Josiah was left with great guilt, having believed he had killed her, he was also afraid for his own freedom. The boy lied about his age, and under the assumed name of Josiah Smith he enlisted into the U.S. Army, like his father before him.\n\n=== The 'Nam ===\nJosiah served several tours in Vietnam, becoming a seasoned and experience veteran. His unit, made up of primarily black soldiers, was nearly killed on a mission by an inconsiderate and racist officer's order to bomb the area while they were still on patrol. He punched the officer, was court martialed, and sent back to the States to be held in military prison.\n\nWhile imprisoned, tests suggested Josiah may be the missing Super-Soldier baby. Agreeing to what he was told would be minor tests in exchange for his freedom, Josiah willfully allowed his transfer from detainment in Fort Leavenworth, Kansas to a secret research facility in Berkeley, California. It was here that blood tests proved he was the missing child and the only known subject that had survived. His surrogate mother, brought in to confirm a genetic match, again helped him escape and told him what she knew about his past, and the first names of his genetic parents.\n\n=== The Black Panthers ===\nIt was four years later, when Josiah was involved with the radical Black Panther movement that he was able to encounter his parents for the first time. As a Black Panther he was exposed to the legend and truth of the Black Captain America, as well as a list of African-American individuals abused by the Super-Soldier project, and used it to find his parents' full names and then their location. Upon traveling to Mount Vernon, New York in order to meet his parents, Faith told him who he was and to leave promptly, as they were always being watched by the U.S. military, so he left after a getting a brief glimpse of his father, Isaiah, and waited for a signal to return.\n\nFor a time, Josiah lived as a mercenary and adventurer, eventually leading him to the continent of Africa. It was here that Josiah turned to the Islamic faith to find purpose. Upon returning home after his pilgrimage to Mecca, Josiah made his way to Boston to confess the murder of Sister Irenia. To his surprise, she was still alive and healthy, and the two began a deep and meaningful friendship. Upon her retirement, Irenia came to live with Josiah, in Princeton Walk, an exclusive gated community of Brooklyn, New York, as his housekeeper and mentor. \n\n=== The Crew ===\n[[image: Thecrew.jpg|left]]Josiah became involved with [[Rhodes, James|James Rhodes]] and [[Crew, the|the Crew]] after they were lead to his location, Josiah's parents had relocated to the Bronx, New York, due to a plant. After some debate, Josiah joined the others to fight those who had framed him and turned his neighborhood into a virtual war zone, using the shield and costume of his father from many years ago. No longer would Josiah turn a blind eye to the criminal activities in the \" Little Mogadishu\" community of Brooklyn, New York, where his Mosque was located, in exchange for generous, anonymous donations to his Mosque. \n\n=== And today... ===\nIt has recently been revealed by his nephew, Elijah, that Josiah has disappeared, and they have not heard from him in over a year.",
        "categories": [
            "Heroes",
            "Avengers"
        ]
    }
}