{
    "id": 1010925,
    "name": "Ghost Rider (Daniel Ketch)",
    "description": "",
    "modified": "2010-11-17T14:55:11-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/5/50/4c003442a3ea6",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010925",
    "comics": {
        "available": 11,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010925/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/39018",
                "name": "Amazing Spider-Man (1999) #659"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/40882",
                "name": "Amazing Spider-Man (1999) #659 (2nd Printing Variant)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/35505",
                "name": "Amazing Spider-Man (1999) #660"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/39849",
                "name": "Fear Itself (2010) #1"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/38975",
                "name": "Fear Itself (2010) #1 (Ff 50th Anniversary Variant)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/38962",
                "name": "Fear Itself (2010) #1 (Blank Cover Variant)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/38926",
                "name": "Fear Itself (2010) #1 (Immomen Variant)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/39251",
                "name": "Fear Itself (2010) #1 (Comicspro Variant)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/38923",
                "name": "Fear Itself (2010) #1 (Variant B)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/40090",
                "name": "Fear Itself (2010) #1 (2nd Printing Variant)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/33700",
                "name": "Shadowland (2010) #5"
            }
        ],
        "returned": 11
    },
    "series": {
        "available": 3,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010925/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/454",
                "name": "Amazing Spider-Man (1999 - 2013)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/13691",
                "name": "Fear Itself (2010 - 2011)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/9934",
                "name": "Shadowland (2010)"
            }
        ],
        "returned": 3
    },
    "stories": {
        "available": 9,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010925/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/75552",
                "name": "Cover #75552",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/78516",
                "name": "Amazing Spider-Man (1999) #660 - Int",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/85415",
                "name": "Cover #85415",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/85493",
                "name": "FEAR ITSELF 1 BLANK COVER VARIANT ",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/85532",
                "name": "FEAR ITSELF 1 FF 50TH ANNIVERSARY VARIANT",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/88567",
                "name": "AMAZING SPIDER-MAN (1999) #659 - Int",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/89089",
                "name": "FEAR ITSELF 1 COMICSPRO VARIANT",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/90791",
                "name": "Fear Itself #1",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/92589",
                "name": "Amazing Spider-Man (1999) #659, 2nd Printing Variant",
                "type": "interiorStory"
            }
        ],
        "returned": 9
    },
    "events": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010925/events",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/events/302",
                "name": "Fear Itself"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/events/59",
                "name": "Shadowland"
            }
        ],
        "returned": 2
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010925/ghost_rider_daniel_ketch?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Ghost_Rider_(Daniel_Ketch)?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Daniel \"Dan\" Ketch",
        "identity": "Secret",
        "occupation": "Vigilante",
        "place_of_birth": "",
        "groups": "Formerly the [[Midnight Sons]], [[Nine]], [[Secret Defenders]], \"[[alternate Fantastic Four]]\"",
        "citizenship": "U.S.A.",
        "education": "High school graduate",
        "aliases": "None",
        "relatives": "Naomi Kale (mother, deceased), Francis Ketch (adopted mother), Barbara Ketch (sister, deceased), [[Ghost Rider (John Blaze)|John Blaze]] (half brother), Andrew Kale (cousin, deceased), [[Kale, Jennifer|Jennifer Kale]] (cousin), Joshua Kale (grandfather, deceased), Illyana Kale, Noble and Pastor Kale, Magdalena (ancestors)",
        "height": "5'10\" (Ketch), 6'2\" (Ghost Rider)",
        "weight": "180 lbs. (Ketch), 220 lbs. (Ghost Rider)",
        "eyes": "Green (Ketch), flaming red (Ghost Rider)",
        "hair": "Brown (Ketch), none (Ghost Rider)",
        "powers": "Ghost Rider has [[Glossary:S#superhuman|superhuman]] strength and durability, as well as the ability to project and control Hellfire. His Penance Stare forces victims to experience the pain and guilt of their own misdeeds.",
        "paraphernalia": "Ghost Rider wields an enchanted chain that can be transformed into various types of weaponry, including spears and shuriken, and then return to its original form. His motorcycle is also mystical in nature, allowing it to run across water and up vertical surfaces. If destroyed, the bike re-forms moments later. Ghost Rider is able to summon and control the bike from afar.",
        "abilities": "Dan is extremely familiar with motorcycles and is able to make minor repairs.",
        "debut": "Ghost Rider Vol. 3 #1 (1990)",
        "creators": "Howard Mackie & Javier Saltares",
        "main_image": "GhostRiderDanny442.jpg",
        "bio_text": "The story of the Ghost Rider began over twenty thousand years ago, when the immortals known as the [[Blood]] allied themselves with the original Spirits of Vengeance in a war against a soul-stealing demon named [[Zarathos]]. To win this war, the Blood created the mystical Medallion of Power, which housed the assembled power of the Spirits of Vengeance. A portion of Zarathos became trapped in this Medallion, too, leading the Blood to decide that the artifact was too powerful to be kept intact. The Medallion was broken into shards and placed into the spiritual bloodlines of two families, both of which would be overseen and protected by a Blood named [[Caretaker (Unrevealed)|Caretaker]].",
        "bio": "The story of the Ghost Rider began over twenty thousand years ago, when the immortals known as the [[Blood]] allied themselves with the original Spirits of Vengeance in a war against a soul-stealing demon named [[Zarathos]]. To win this war, the Blood created the mystical Medallion of Power, which housed the assembled power of the Spirits of Vengeance. A portion of Zarathos became trapped in this Medallion, too, leading the Blood to decide that the artifact was too powerful to be kept intact. The Medallion was broken into shards and placed into the spiritual bloodlines of two families, both of which would be overseen and protected by a Blood named [[Caretaker (Unrevealed)|Caretaker]].  \n\nThis arrangement lasted until the 1700s, when young [[Ghost Rider (Noble Kale)|Noble Kale]] of the spiritual bloodline fell in love with a woman named Magdalena. Fearing the reaction from his fire-and-brimstone pastor father, Noble hid his romance. When Magdalena bore him a child, however, Pastor Kale had Magdalena branded a witch and burned at the stake. As she died, she cursed Pastor Kale, invoking the legendary Furies to seek vengeance in her name, and these ancient spirits went on a destructive rampage. Pastor Kale sought aid from the demon [[Mephisto]], offering Noble's soul as payment. Mephisto recognized the Medallion shard within Noble Kale and activated it, transforming the young man into a living Spirit of Vengeance, a Ghost Rider. Noble defeated the Furies and then turned on his own father, who slew Noble's son as a sacrificial offering to Ghost Rider. A horrified Noble tried to commit suicide, but Mephisto appeared, seeking to claim his soul. An angelic being named Uriel intervened, stating Noble's soul belonged in Heaven. It was decided that Noble's soul belonged to neither Heaven nor Hell, but would instead be consigned to the void, to be summoned forth by his descendants. He inhabited the first-born child of each generation, with documented occurrences during World War I and the lifetime of [[Ghost Rider (Naomi Kale)|Naomi Kale]], the birth mother of Dan Ketch and his siblings. Fearing for her children, Naomi left Dan and his sister Barbara with Francis Ketch in Cypress Hills, New York. Her oldest son was left with his father while she unsuccessfully attempted to end the curse.\n\nDan and Barbara grew up in a happy and stable home, befriending local girl Stacy Dolan, who was the daughter of a local police officer and, later, the object of Dan's romantic affections. As Dan matured, he became interested in motorcycles and drawn to the open road. When Dan and Barb took a shortcut home through Cypress Hills Cemetery, they stumbled upon the criminal [[Deathwatch]] as he killed a man over canisters of bio-toxin. Barb's screams alerted Deathwatch and his minions, who shot her in the chest with an arrow. Dan carried her into a nearby junkyard, seeking escape, and noticed a pristine-looking motorcycle parked in the center of the debris. Drawn to it, Dan touched its gas cap, his fingers dripping with his sister's innocent blood. The blood's contact with the gas cap ignited a mystical transformation, changing Dan Ketch into the Spirit of Vengeance known as the Ghost Rider. \n\n[[image:GhostRiderDan01.jpg|thumb|left|200px]]Ghost Rider rushed Barbara to a hospital, but her severe wounds left her in a deep coma. Enraged, Dan embraced his new power and its mission of vengeance. Whenever innocent blood was spilled, Dan transformed into the Ghost Rider and used his powers - especially his dreaded Penance Stare - to mete out justice. At first, Ghost Rider focused on finding the now-missing bio-toxin, which had become the crux of an ongoing war between Deathwatch and the Kingpin of Crime. Ghost Rider and Deathwatch's pseudo-vampiric minion [[Blackout (Lilin)|Blackout]] clashed repeatedly over the canisters, which had been found and hidden in the cemetery by the Cypress Hills Jokers gang. During a final battle over the canisters, the contents of which could have wiped out most of the Tri-State Area, Blackout started to unseal them but was interrupted by the Ghost Rider. The pseudo-vampire tried to sink his artificial teeth into Ghost Rider's neck, but the hero's flaming skull badly burned him and drove him mad. Blackout fled, but Dan was now certain of his role as the Ghost Rider and swore to his comatose sister that he would continue fighting crime.\n\nThis proved to be a costly vow for Dan. Shortly after turning his Penance Stare on a group of criminals, Dan decided that no one deserved such torment - not even lawbreakers. He had his friend Jack D'Auria lock up the bike, but he was soon pressed into using it again when [[Mister Hyde|Mr. Hyde]] went on a rampage. Shortly thereafter, journalist Linda Wei began campaigning against the Ghost Rider, equating him with other vigilantes such as the [[Punisher (Frank Castle)|Punisher]]. Dan disliked the comparison, especially after teaming with the Punisher against the anarchist [[Flag-Smasher]]. Ghost Rider refused to allow the Punisher to kill their foe, saying he served vengeance, not death.  After teaming with [[Spider-Man (Peter Parker)|Spider-Man]], the [[Hulk (Bruce Banner)|Hulk]] and [[Wolverine (James Howlett)|Wolverine]] to form a temporary substitute [[Fantastic Four]], he aided Wolverine and [[Brass (Sean Watanabe)|Brass]]  in tracking down Deathwatch, who had kidnapped Watanbe's sister in a power play against the [[Mandarin]]. Barbara Ketch had stabilized by this time, but remained comatose. The stress of recent events built a wall between Dan and Stacy. When Blackout uncovered Dan's secret identity, he slew Barbara in her hospital bed. A traumatized Dan took out his rage on the insane [[Scarecrow (Ebenezer Laughton)|Scarecrow]], who had gone on a killing spree to draw out his old foe, [[Captain America (Steve Rogers)|Captain America]].\n\nA guilt-stricken Dan found his life becoming increasingly complicated. Blackout continued to target those close to Dan, slaying blind street vendor Mr. Larsen and the priest at Mrs. Ketch's church. A local parents group blamed Ghost Rider for a series of child abductions and hired an all-female mercenary group called H.E.A.R.T. to stop him. They ambushed Ghost Rider in the tunnels inhabited by the mutant [[Morlocks]], who were involved in the child abductions. With the aid of the original [[X-Factor]], Ghost Rider was able to resolve the crisis, though the media continued to portray him as a menace. He encountered [[Thor (Thor Odinson)|Thor]], then fought the murderer Zodiak, after which Ghost Rider was kidnapped and separated from Dan by [[Nightmare]], who believed him to be Zarathos. Nightmare force-fed Ghost Rider memories of Zarathos, but was shocked when the Rider rejected them as not his own. Dan and Ghost Rider re-merged and escaped Nightmare's realm, only to find themselves trapped by [[Doctor Strange (Stephen Strange)|Doctor Strange]] and his associate [[Rintrah]], who also believed Ghost Rider to be Zarathos. Ghost Rider convinced Strange of his error and aided the mage in exorcising a demon from his ally, [[Topaz]]. Ghost Rider joined the [[Moon Knight]] against [[Plasma]] and her Knights of the Moon, aided Spider-Man in rescuing young Adam from the [[Hobgoblin (Roderick Kingsley)|Hobgoblin]], and briefly assisted the resurrected warriors known as [[Shadow Riders]] against the demon-forces of the megalomaniacal [[Mys-Tech]].\n\nThe arrival of [[Ghost Rider (John Blaze)|John Blaze]] led to even more turmoil. The former Ghost Rider used a binding ritual to trap Dan, whom he believed to be Zarathos. However, an explosion of Hellfire leaped from Ghost Rider and into Blaze via his shotgun. This freed Dan, but also enabled Blaze to discharge Hellfire through the gun, badly wounding Ghost Rider. When he realized that slaying Ghost Rider would mean killing Dan - whom he now viewed as an innocent - Blaze relented. Convinced the entity within Dan was not Zarathos, but knowing what the younger man was going through, Blaze acted as Dan's protector from then on. Blaze and the Ghost Rider aided the extraterrestrials Gun Runner and the Enhanced, freeing prisoners of the [[Glossary:A#alien|alien]] religious fanatics known as the Cynodd. Ghost Rider also began trying to repair Dan's personal life, freeing Francis Ketch from the new [[Sin-Eater (Reverend Styge)]], who was preying on her suffering over her lost daughter. \n\nGhost Rider then assisted [[Cloak]] and [[Dagger]] against a plot of the demon [[D'spayre]], aided [[Quasar (Wendell Vaughn)|Quasar]] and others against the forces of [[Maelstrom]], teamed with the Punisher against the immense traveling drug-dealing fortress the Roaring Island, fought the [[Hand]] alongside [[Daredevil (Matthew Murdock)|Daredevil]], and joined the [[Glossary:M#mutant|mutant]] [[Cable]], clashing with the subterranean cult the Grateful Undead. The Ghost Rider was summoned alongside the Punisher and Wolverine to the town of Christ's Crown by [[Blackheart]] to slay his father Mephisto, but the trio fought off both demons, saving the young empath Lucy Crumm in the process; Lucy later summoned the trio to again banish Blackheart. Ghost Rider's near-constant battles continued. He fought against the likes of [[Zodiak]]; Mephisto's pawn [[Suicide]]; Spider-Man's foes the [[Sinister Six]]; Nightmare; the alien [[Sleepwalker]]; Deathwatch's agents [[Hag]], [[Troll]], and [[Snowblind]]; the demon Gorn; the werewolf cult the Braineaters; and the demon [[D'Kay]] and his Legion of Vengeance.\n\nDan sought revenge on Blackout, who tore out his throat. A transformation into Ghost Rider saved Dan's life, but left him unable to switch back. Trapped in a void, he was barely able to converse with Ghost Rider. During one of their shared visions, Ghost Rider saw a series of individuals capable of stopping the ancient demoness [[Lilith|Lilith, Mother of Demons]] ([[Lilin]]), from tearing the walls between dimensions. Ghost Rider teamed with John Blaze and the mysterious Caretaker to assemble these beings, who became the Midnight Sons. Around this same time, he journeyed to New Orleans to track down a group of alien [[Brood]]. Ghost Rider was briefly possessed by a Brood during this time, but Dan Ketch - while floating in the void - was able to resist the alien's control. Aided by John Blaze and the [[X-Men]], Ghost Rider slew the Brood Queen.\n\nAfter Doctor Strange helped restore Dan to normal, Dan began re-evaluating his work as Ghost Rider. He felt he was a force for good, but he also wanted to have a normal life again. This desire intensified after his mother revealed that both he and Barbara had been adopted. Ghost Rider and Blaze continued to work well together, though their methods sometimes clashed. The two of them united with Spider-Man in an attempt to capture both [[Brock, Eddie|Venom]] and a group of Deathspawn seeking the resurrection of Deathwatch. Soon after, Lilith allied herself with [[Centurious]], an old foe of the John Blaze Ghost Rider. Together, the two mystics kidnapped Dan's mother and stole Ghost Rider's enchanted chain, forging it into a weapon for Centurious. Ghost Rider badly injured Centurious during one of their clashes, unwittingly unleashing Zarathos, who had been lurking inside Centurious ever since their imprisonment in the Crystal of Souls. Zarathos mated with Lilith and schemed to resurrect the Fallen, a group of his former followers. At this point, Caretaker disclosed the true origins of the Medallion of Power and revealed that Dan and John were brothers. Armed with this new knowledge, Ghost Rider confronted Zarathos in a battle that seemingly destroyed them both, though Ghost Rider reconstituted himself weeks later, just prior to the murder of John Blaze's wife, Roxanne, by Anton Hellgate. \n\n[[image:GhostRiderDan02.jpg|thumb|right|200px]]Dan moved into a new apartment and began taking control of his life. While Ghost Rider was plagued by Blackheart, Dan broke up with Stacy and sought more answers about Ghost Rider's origins. With the aid of Doctor Strange, Dan discovered that he was related to the young sorceress Jennifer Kale. Jennifer mystically unlocked Ghost Rider's memories, restoring his knowledge of the family curse. This greatly lightened Ghost Rider's spirit, especially after Jennifer Kale mystically caused many of Dan's friends and relatives to forget his secret identity. At last aware of his past as Noble Kale, Ghost Rider began working with Dan on a much more intuitive basis, helping his human host reconcile with Stacy. He also teamed with [[Brother Voodoo (Jericho Drumm)|Brother Voodoo]] and Dracula's daughter, [[Lilith (Daughter Of Dracula)|Lilith]], to repel another attack by the Scarecrow, who had gained the power to inhabit other bodies and had summoned the decaying corpse of Barbara Ketch as part of his plan.  Ghost Rider had a brief clash with [[Daredevil (Matthew Murdock)|Daredevil]] during this time, coming to blows over their differing methods in capturing a psychotic killer.\n\nBlackheart later created his own [[Spirits of Vengeance]] - Wallow, Doghead, Verminous Rex and Pao Fu. They invited Noble to join them, killing him when he refused. Noble's soul was cast into Hell, where Blackheart sought to corrupt him by offering to restore Noble's mortal form and lift the family curse, in exchange for Noble's pledge to marry both Pao Fu and the mysterious [[Black Rose]], secretly a resurrected Roxanne Blaze. Noble agreed, but Dan was unwilling. Now fully separated from Ghost Rider, Dan was guided through Hell by the spirit of Naomi Kale, and was killed after revealing that Noble's true destiny was to become the Angel of Death. Utilizing the powers that came with this title, Ghost Rider slew Blackheart and assumed the throne of Hell. He then resurrected Dan and sent him back to Earth as a way of thanking him for their years together.\n\nNoble's tenure in Hell was a brief one. He subtly aided Jack Russell, the [[Werewolf By Night|Werewolf]], in tracking down a serial killer, but was forced out of Hell when a coup occurred. Injured and confused, Noble wandered the streets of New York City, his Hellfire raging out of control. This attracted the attention of Spider-Man, who tried to bring his old ally under control, with limited success. Dan arrived at the scene and realized that Noble's powers were fluctuating because he lacked a human host. The two men were forced to merge again and are currently seeking more innocents to avenge.\n\nAt some point after merging with Kale again, Daniel must have changed his mind about being host to the Ghost Rider because he chose to have it expelled from his body. He contacted a woman by the name of [[LeBow, Mary|Mary LeBow]], a paranormal consultant, and she separated the two by way of an exorcism. Then, two years later, Ketch decided he can't live without that part of him anymore and will do anything to get it back. Daniel gets his wish when an agent of [[Zadkiel]] known only as [[Mister Eleven]] comes to him and tell him he can have his abilities restored. Ketch only got a taste of it at first and immediately became addicted to the power. Dan wanted more and more, but he would only be allowed to sample a little at a time, until he decided to become an agent of Zadkiel too. Daniel was shown an ugly side of the Ghost Rider where the hosts can become mindless beasts if the spirit inside takes control of them. He was made to believe he'd be doing them a service by taking their powers from them and return them to [[Heaven]] where they originated from. The only downside was some of the hosts may not survive the process - such was the case of [[Ghost Rider (Shoba Mirza)|Shoba Mirza]] - but Ketch still felt he was truly helping even if that was the end result. What Daniel didn't know is Zadkiel wanted the powers of the Ghost Riders, so he could take control of Heaven. The current road Daniel has chosen to take led him on a collision course with Johnny Blaze, and several other [[Ghost Rider (disambiguation)|Spirits of Vengeance]] throughout the world. Ketch managed to defeat all the Ghost Riders, including Blaze, and delivered their power to his master. As soon as the deed was done, Ketch was cast out of Heaven, aware of Zadkiel's plans, but he managed to take some of the power back with him. Nevertheless, it was too late to stop Zadkiel from winning his war.\n\nKetch, Blaze and the new [[Caretaker (Sara)|Caretaker]] went their separate ways, but Daniel felt more cursed than ever. Finally seeing the error of his ways, Ketch wished he would have left the Ghost Rider behind instead of being made a fool by Zadkiel. For helping lay waste to Heaven, Daniel had become a slave to vengeance, unable to ignore the cries of the innocent. His first mission was to find the malicious [[Highwayman]] and avenge the lives of those unfortunate enough to cross his path. Daniel would soon get another crack at Zadkiel, but first he would make a deal with the devil to keep the [[Kid Blackheart|Antichrist]] safe in exchange for the keys to Heaven. Traveling to New York and meeting up with Blaze, Sara, [[Hellstorm]] and [[Cutter, Jaine|Jaine Cutter]], Daniel told them of his agreement and he and Blaze took off in search of the doorway to Heaven. The road would not be easy as an attack from [[Big Wheel]] and [[Trull]] slowed them greatly, allowing Blackout to steal the key. Ketch and Blaze had to find another way to reach their goal and the lair of the [[Gun Nuns]] held the answer. On arrival, the Ghost Riders had to contend with the new [[Orb (unrevealed)|Orb]] and a new [[Vengeance (Kowalski)|Vengeance]], but neither proved to be too much of a problem. Zadkiel was another story. Upon reaching Heaven and confronting the mad angel, Ketch and Blaze were tossed aside like insignificant specks. If it wasn't for the emergence of an army of Ghost Riders, they may never have beaten their tormentor. Not only that, but Ketch and the other Spirits of Vengeance fought off an attack by the Antichrist and his minions when they invaded Heaven. The holy city, now back in God's hands, was safe, and the two brothers were sent back to Earth. Ketch challenged Blaze to a race, and the two sped off with Sara not far behind.",
        "categories": [
            "Heroes",
            "Horror",
            "Marvel Knights",
            "Magic"
        ]
    }
}