{
    "id": 1010883,
    "name": "Wrecking Crew",
    "description": "",
    "modified": "2013-11-20T17:26:57-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/c/60/528d35dc8db1d",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010883",
    "comics": {
        "available": 3,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010883/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/20323",
                "name": "Defenders (1972) #17"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/20324",
                "name": "Defenders (1972) #18"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/31234",
                "name": "Hulk: Let the Battle Begin (2010) #1"
            }
        ],
        "returned": 3
    },
    "series": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010883/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/3743",
                "name": "Defenders (1972 - 1986)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/9316",
                "name": "Hulk: Let the Battle Begin (2010)"
            }
        ],
        "returned": 2
    },
    "stories": {
        "available": 4,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010883/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/43547",
                "name": "Power Play!",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/43548",
                "name": "Cover #43548",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/71179",
                "name": "Hulk: Let The Battle Begin (2010) #1",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/94919",
                "name": "Thor (1998) #28",
                "type": "cover"
            }
        ],
        "returned": 4
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010883/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010883/wrecking_crew?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Wrecking_Crew?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "base_of_operations": "",
        "debut": "Defenders #17 (1974)",
        "origin": "Defenders #18 (1974)",
        "significant_issues": "shown to be captured by Thunderbolts (Thunderbolts #103, 2006)",
        "current_members": "[[Bulldozer (Henry Camp)]], [[Piledriver (Brian Calusky)]], [[Thunderball]] (Dr. Eliot Franklin), [[Wrecker (Dirk Garthwaite)]]",
        "former_members": "",
        "other_members": "[[Excavator]] (Ricky Calusky), [[Ulik]]",
        "main_image": "Wreckcrew.jpg",
        "bio_text": "Dirk Garthwaite was the son of Burt Garthwaite, a loutish construction worker and abusive father. Dirk grew up to become a burglar, wielding a crowbar as his chief weapon to remind himself of the crowbar his father used. Dirk once broke into a hotel room and overpowered its occupant, the Asgardian god [[Loki]], who had just requested mystical enhancements from [[Karnilla]] the Norn Queen to oppose [[Thor (Thor Odinson)|Thor]]. Karnilla accidentally cast the spell upon Dirk instead. Becoming the [[Wrecker (Dirk Garthwaite)|Wrecker]], Dirk went on a rampage, battling Thor, but was finally beaten by the magical [[Destroyer (construct)|Destroyer]] construct, animated by the spirit of [[Sif]].",
        "bio": "Dirk Garthwaite was the son of Burt Garthwaite, a loutish construction worker and abusive father. Dirk grew up to become a burglar, wielding a crowbar as his chief weapon to remind himself of the crowbar his father used. Dirk once broke into a hotel room and overpowered its occupant, the Asgardian god [[Loki]], who had just requested mystical enhancements from [[Karnilla]] the Norn Queen to oppose [[Thor (Thor Odinson)|Thor]]. Karnilla accidentally cast the spell upon Dirk instead. Becoming the [[Wrecker (Dirk Garthwaite)|Wrecker]], Dirk went on a rampage, battling Thor, but was finally beaten by the magical [[Destroyer (construct)|Destroyer]] construct, animated by the spirit of [[Sif]].\n\nDuring a subsequent battle with Thor, the Wrecker struck the third rail of a subway track and the magic powering him was driven from his body into the crowbar. Without the crowbar, he was sent to Ryker's Island. There, he befriended fellow convicts Dr. Eliot Franklin, Brian Philip Calusky and Henry Camp, and arranged to spring them when he made his escape to retrieve the crowbar. Obtaining the crowbar, the Wrecker had his three friends grasp it with him in an electrical storm, and the storm transferred the power stored within it amongst the four of them. Franklin became [[Thunderball]]; Calusky became [[Piledriver (Brian Calusky)|Piledriver]]; and Camp became [[Bulldozer (Henry Camp)|Bulldozer]]. Together, they became known as the Wrecking Crew. \n\nThunderball had previously built a Gamma Bomb for [[Richmond Enterprises]], but executive J.C. Pennysworth had stolen it and Franklin had been sent to prison while trying to steal it back. He convinced his allies that they should capture the bomb and use it to ransom New York. They began to tear apart buildings owned by Richmond Enterprises to find the bomb, attracting the attention of the [[Defenders]], including [[Nighthawk (Kyle Richmond)|Nighthawk]]. The Crew was defeated by the Defenders and dispersed to different prisons.\n\nAfter regaining his crowbar, the Wrecker freed his allies and they decided to publicly defeat Thor in order to salvage their reputations. When they encountered [[Iron Fist (Danny Rand)|Iron Fist]] and threatened his girlfriend [[Knight, Misty|Misty Knight]], Iron Fist offered to gain them access to [[Avengers Mansion]] in order to save her. The Wrecking Crew invaded the mansion, finding only [[Captain America (Steve Rogers)|Captain America]] present; but he and Iron Fist managed to outfight the Wrecking Crew, and they were all sent back to prison. From his cell at Ryker's, the Wrecker concentrated upon his crowbar's power and used it to compel a guard to release him. He and the Wrecking Crew finally had their first shot at Thor as a team, but Thor bested them all, and only Thunderball escaped. Thunderball acted on his own for a while, battling [[Rhodes, James|Iron Man]], and later recovering the crowbar for himself and battling [[Spider-Man (Peter Parker)|Spider-Man]], but he was ultimately sent back to Ryker's.\n\n\nThe Wrecking Crew were freed by the [[Maker|Beyonder]] and transported to '[[Battleworld]]' to serve in [[Doctor Doom (Victor von Doom)|Doctor Doom]]'s army of super-villains against the heroes gathered there. They proved to be useful thugs for Doom's purposes, but they finally abandoned him after he gained the Beyonder's power, returning to Earth with the aid of the [[Molecule Man]]. The entire Wrecking Crew then joined [[Baron Zemo (Helmut)|Baron Zemo]]'s [[Masters of Evil]] and helped provide intelligence on [[Hercules (Heracles)|Hercules]], uncovering the [[Avengers|Avenger]]'s drinking problem. The Wrecking Crew joined with [[Atlas (Erik Josten)|Goliath]] and [[Mister Hyde]] in a savage assault on Hercules at Avengers Mansion that left him comatose. When Thor came to avenge his comrade, he used the power of his hammer to transfer all of the Wrecking Crew's energies back into the crowbar, and the Wrecker himself was beaten in combat by Captain America.\n\nThe Wrecker soon escaped prison and freed the Crew, and they continued to use Zemo's remaining resources while they prepared to regain their powers. Thunderball began rebuilding the Gamma Bomb in the hopes of another blackmail attempt, but his one-time use of the crowbar had left him craving its power, and he ultimately turned on the Wrecker, wanting all the power for himself. Faced with the combined powers of Spider-Man and [[Spider-Woman (Julia Carpenter)|Spider-Woman]], the divided Wrecking Crew fell. The Wrecking Crew participated in the so-called '[[Acts of Vengeance]]'. Thunderball fought the [[Fantastic Four]], the Wrecker fought Iron Man. The entire Crew fought [[Damage Control]], who were secretly aided by Thunderball (who was friends with Damage Control's [[Porter, John|John Porter]]). The Wrecker continued to resent Thunderball's attempts at claiming his power and mantle of leadership, and began to hunt the now-powerless Franklin. The Wrecker tracked Franklin to his Yancy Street safehouse, but encountered the [[Thing (Benjamin Grimm)|Thing]] there and was beaten. The entire Crew were imprisoned at the [[Vault]] for a time, participating in an uprising when [[Brock, Eddie|Venom]] staged a breakout. Thunderball opposed even Venom's leadership and led a splinter team of escapees against the Avengers when they tried to lockdown the facility, but he finally sided with the Avengers to help stop a core breach in the Vault.\n\nFinally escaping the Vault, the Wrecker and Thunderball were forced to establish a working relationship, but could never entirely trust one another again. The Crew faced Hercules again, and battling them helped Hercules overcome the fear of combat he had suffered since his beating at their hands. \n\nThey later fought the NYPD's special task force [[Code: Blue]] while holding a hostage, and lost their hostage to the police squad. Ultimately, Loki decided that he wanted the power of the Wrecker for himself, since it had been meant for him, and while the Crew were battling Thor and the [[Ghost Rider (Daniel Ketch)|Ghost Rider]], he had the [[Enchantress]] and [[Ulik]] bring down each member of the Crew, until only the Wrecker remained. Loki proceeded to torture the Wrecker, and finally cast him into another dimension.\n\nDeprived of the Wrecker's power, Thunderball worked with the [[Secret Empire]], and was outfitted with armor which mimicked some of his magical abilities. They attempted to harness the powers of [[Nova (Richard Rider)|Nova]], but were opposed by the combined forces of Spider-Man, [[Moon Knight]], [[Darkhawk]], [[Night Thrasher]] and the [[Punisher (Frank Castle)|Punisher]], and ultimately surrendered to them. \n\nThe Wrecker finally returned to Earth and was reunited with the Crew, but their powers began fading when many of [[Asgard]]'s links to Earth were separated after Odin attempted to evade Ragnarok, and they were defeated by Code: Blue. They were then hired by [[Zola, Arnim|Arnim Zola]] to battle the [[Thunderbolts]] (unaware that the Thunderbolts included many of their former allies in the Masters of Evil), receiving an artificial power boost from him, but the Crew once again lost. \n\nDefeated again by Spider-Man, the [[Sub-Mariner]] and the Thing, the Crew were next hired by the [[Doomsday Man]] to locate [[Ms. Marvel (Carol Danvers)|Warbird]], formally his enemy Ms. Marvel. They decided to start robbing banks to bring her out. They wound up battling the Avengers, and were accidentally sent to Polemachus by the [[Scarlet Witch (Wanda Maximoff)|Scarlet Witch]]. In [[Polemachus]], they set out to defeat [[Arkon]] and [[Thundra]] so that they could rule that dimension and claim its energies to repower themselves, but the Avengers followed them there and defeated them despite their use of Avenger Photon as a living power battery. \n\nThe Crew battled Thor and the [[Warriors Three]] next, and Thunderball nearly killed [[Hogun|Hogun the Grim]]. Thor caught up to the Crew and beat them all. After this, the Crew were shuffled to several prisons, including the [[Cage]], [[Seagate]] and the [[Big House]], making escapes along the way to battle the Fantastic Four. They were also made pawns by the sorceress [[Morgan Le Fay]], who replaced Thunderball with her magical agent the [[Knight]] in disguise, all as part of her plan to claim the enchanted arrows of [[Hawkeye (Clint Barton)|Hawkeye]]; but the Crew were defeated by the Avengers and [[Lionheart|Kelsey Leigh]], who was resurrected as the new Captain Britain after the Knight slew her.\n\nPiledriver decided that the Wrecking Crew should be preparing for their later years by training a new generation into the Crew, and brought his teenage son Ricky onboard as [[Excavator]]. Learning that the [[Pride]], one-time criminal masterminds of Los Angeles had apparently been slain, the Crew decided to hit banks there now that the Pride were no longer in control, and because of the smaller super-hero population. However, Excavator's presence had drawn the attention of the Pride’s [[Runaways|children]], the herioc Runaways, who came to return him to his grandparents. They beat the entire 5-man Wrecking Crew in battle, and left them for the police.\n\nThe Wrecking Crew were sent to the [[Raft]], but escaped during the mass breakout. The Wrecker and Piledriver set out to find the Wrecker's 'spare' crowbar which he had hidden in the Museum of Modern Art, and to steal the paintings there. However they were defeated by [[Toxin]]. The Wrecker managed to get away again, but was recaptured by the new team of Avengers which had formed in the aftermath of the Raft breakout. The other members of the Wrecking Crew are still at large.",
        "categories": [
            "Villains",
            "Thunderbolts",
            "Avengers",
            "Thor"
        ]
    }
}