{
    "id": 1010761,
    "name": "Sleepwalker",
    "description": "Sleepwalkers are guardians of the Mindscape -- they apprehended beings that invade the sleeping minds of humans.",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/f/30/4c0037640501a",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010761",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010761/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010761/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010761/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010761/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010761/sleepwalker?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Sleepwalker?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Unpronounceable",
        "identity": "Secret",
        "occupation": "Adventurer, Guardian of the Mindscape",
        "place_of_birth": "Dimension known as the Mindscape",
        "groups": "Formerly [[Defenders|Secret Defenders]], [[League of Losers]]",
        "citizenship": "(Sleepwalker) unknown, (Rick) U.S.A.",
        "education": "Unrevealed",
        "aliases": "Rick Sheridan, Sleepy",
        "relatives": "Unrevealed",
        "height": "",
        "weight": "",
        "eyes": "(as Sleepwalker) Red, (as Rick) Brown",
        "hair": "(as Sleepwalker) None, (as Rick) Brown",
        "powers": "Sleepwalker possesses super-strength and flotation-like flight. Sleepwalker's only offensive power is his warp gaze. With this vision-based power, Sleepwalker can alter the shape of physical objects and twist them to his purposes. Sleepwalker initially demonstrated this power by using it to distort a sidewalk to capture a criminal. He also used this ability once on air molecules to create a wind tunnel for faster aerial travel.",
        "abilities": "",
        "weapons": "None",
        "paraphernalia": "Members of his alien race use hi-tech devices called \"Imaginators\" which is what may be used to teleport a captured creature to another part of the Mindscape dimension, although Sleepwalker's device has been lost.",
        "debut": "Sleepwalker #1",
        "origin": "",
        "significant_issues": "",
        "main_image": "SleepWalker.jpg",
        "bio_text": "The Mindscape: the dimension which borders on the minds of all sentient creatures. The evil Mindscape entities often seek to enter the minds of sentient beings and drive them mad. Protection comes from the Sleepwalkers, other entities of the Mindscape sworn to prevent the evil beings from entering the minds of innocents. Sleepwalkers are guardians of the Mindscape-- they apprehended beings that invade the sleeping minds of humans. One of these guardians was tricked by his long time foe known as [[Cobweb (Mindscape)|Cobweb]] into entering the mind of one individual, New York college student Rick Sheridan. The two fought within Sheridan's dreams, but when Cobweb left, the Sleepwalker found himself trapped.",
        "bio": "The Mindscape: the dimension which borders on the minds of all sentient creatures. The evil Mindscape entities often seek to enter the minds of sentient beings and drive them mad. Protection comes from the Sleepwalkers, other entities of the Mindscape sworn to prevent the evil beings from entering the minds of innocents. Sleepwalkers are guardians of the Mindscape-- they apprehended beings that invade the sleeping minds of humans. One of these guardians was tricked by his long time foe known as [[Cobweb (Mindscape)|Cobweb]] into entering the mind of one individual, New York college student Rick Sheridan. The two fought within Sheridan's dreams, but when Cobweb left, the Sleepwalker found himself trapped.\n\nAs the Sleepwalker tried to leave Sheridan's mind, he found himself appearing in Sheridan's dreams, or, alternatively, into Earth when Sheridan was asleep. At first, Sheridan believed that the Sleepwalker was just a character in his dreams, until watching the evening news and seeing a report about an attempted robbery. The robbery had been broken up by someone who, according to a police sketch drawn from the description given to them by eyewitnesses, looked exactly like the being in Sheridan's dreams. Sheridan decided to avoid sleep as long as possible, in order to avoid releasing the being again.\n\nWhen he finally dreamt, Sheridan fought this strangely-dressed, haunting figure. Rick reacted by tearing off Sleepwalker's Imaginator (a badge-like device worn by Sleepwalkers used to teleport around the Mindscape.) This resulted in an odd situation, further trapping the two together: when Rick slept, Sleepwalker could materialize in reality or he could stay in Rick's mind and converse with him via his dreams. It was through these conversations that Sleepwalker was able to dispel Rick's initial fears that he was a malicious entity that wished him harm and work out agreeable terms of cohabitation.\n\nThe Sleepwalker learned that Earth was a place full of those who preyed upon the innocent, just like Cobweb and the malevolent entities of the Mindscape. He became a crimefighter, fighting against costumed villains such as [[8-Ball (Jeff Hagees)|8-Ball]], [[Bookworm]], the [[Chain Gang]], and [[Lullaby]]. He also teamed up with several of New York's heroes. Once, he joined [[Spider-Man (Peter Parker)|Spider-Man]], the [[Fantastic Four]], and a half-dozen others to defeat the [[Sinister Six]] when the villains were backed by the supernatural [[Gog]]. Another time, the Sleepwalker became one of [[Doctor Strange (Stephen Strange)|Doctor Strange's]] Secret Defenders against the demonic [[Roadkill]]. \n\nIt was later revealed that Sleepwalker's race was not one dedicated to protecting Earth but in fact secretly planned to conquer it. When the race tried to invade the world, Sleepwalker decided to rebel. This turned out to be a plot by Sleepwalker's old foe [[Cobweb (Mindscape)|Cobweb]] to spread mass insanity and thereby gain more power. Cobweb transformed his own minions to appear as the Sleepwalker race and sent them to Earth using Sleepwalker's long lost Imaginator. After reclaiming the Imaginator, Sleepwalker disappeared into the subconscious of his host, Rick.\n\nRecently, Sleepwalker reappeared, forming the [[League of Losers]] along with a combination of obscure superheroes [[Darkhawk]], [[Speedball (Robert Baldwin)|Speedball]], [[Dagger]], [[Arana (Anya Corazon)|Araña]], [[X-23]], [[Gravity]], [[Terror]], and [[Mutant 2099]]. The team was forced to seek refuge in the far future, to defeat the villain [[Chronok]]. At this time his link with Rick appeared severed. Sleepwalker remained in the future, as after they \"fixed\" their past, the heroes realized they were \"already there\" and therefore unable to return.",
        "categories": [
            "Heroes"
        ]
    }
}