{
    "id": 1010819,
    "name": "Texas Twister",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/2/d0/4c0035e44d390",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010819",
    "comics": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010819/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/15517",
                "name": "Marvel Super-Heroes (1992) #15"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/23418",
                "name": "Quasar (1999) #2"
            }
        ],
        "returned": 2
    },
    "series": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010819/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2301",
                "name": "Marvel Super-Heroes (1992 - 1993)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/6682",
                "name": "Quasar (1999 - 1994)"
            }
        ],
        "returned": 2
    },
    "stories": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010819/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/31610",
                "name": "Gaze Into My Eyes",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/51928",
                "name": "Destiny Amidst The Ruins",
                "type": "interiorStory"
            }
        ],
        "returned": 2
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010819/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010819/texas_twister?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Texas_Twister?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Drew Daniels",
        "aliases": "None",
        "identity": "Secret",
        "occupation": "Adventurer; former cattle hand, rodeo performer",
        "citizenship": "USA",
        "place_of_birth": "Amarillo, Texas",
        "relatives": "Unrevealed",
        "groups": "[[Rangers]]; formerly [[S.H.I.E.L.D. Super-Agents]], [[Thunderbolts|Thunderbolts Army]]",
        "education": "High school graduate",
        "height": "6' 5”",
        "weight": "245 lbs.",
        "eyes": "Blue",
        "hair": "Red",
        "powers": "The powerful winds mixed with the radioactive material from the waste site and radiation from the power plant, caused Daniels to be infused with radioactive air molecules, giving him the ability to generate tornadoes at will. He can use his powers to propel him into the air, giving him the ability to fly or hover. His skin is denser than normal and prevent unwanted heat loss from wind-chill factor. His skin is harder than human and resists friction and airborne particle abrasion.",
        "abilities": "The Texas Twister is an expert horse rider, lasso thrower, and sharpshooter.",
        "weapons": "None",
        "paraphernalia": "None",
        "debut": "Fantastic Four #177 (1976)",
        "origin": "Fantastic Four #177 (1976)",
        "significant_issues": "Answered ad to join Frightful Four (Fantastic Four #177, 1976); battled Human Torch (Fantastic Four #192, 1978); joined S.H.I.E.L.D. Super-Agents (Captain America #217-218, 1978); quit SHIELD Super-Agents (Captain America #228-229, 1979); Battled the Corruptor, joined Rangers (Incredible Hulk #265, 1981); viewed contest between Grandmaster and Death (Marvel Super Hero Contest of Champions #1-3, 1982); present for New York honoring Hulk (Incredible Hulk #279, 1983); battled Frightful Four in Calgary (Amazing Spider-Man: Chaos in Calgary #4,1992); fought Master Pandemonium (West Coast Avengers #8-9, 1986); battled West Coast Avengers (West Coast Avengers #31, 1988); possessed by demon, fought Hawkeye (Solo Avengers #18, 1989); held suspended over Earth by Graviton (Thunderbolts #57-58, 2001); joined Thunderbolts Army (Thunderbolts #106-107, 2006); Rangers became part of Fifty States Initiative (Civil War #7, 2007)",
        "main_image": "TexasTwister_Head.jpg",
        "bio_text": "Drew Daniels was rounding up stray cattle near the Reynolds Power Plant when a tornado touched down near the site's waste storage area. Daniels found himself in the path of the raging tornado and was soon swept up into it as it hit the power plant. Daniels was overcome by the nuclear winds and instinctively tried to escape and found that he was able to generate a tornado around himself and fly out of the nuclear tornado. Daniels decided to test his new found powers out by halting the nuclear tornado from doing any further damage and easily dissipated the storm. Now that he had powers, Daniel decided he was going to make something of himself instead of being a cattle handler, headed East to New York City to make his mark on the world.",
        "bio": "Drew Daniels was rounding up stray cattle near the Reynolds Power Plant when a tornado touched down near the site's waste storage area. Daniels found himself in the path of the raging tornado and was soon swept up into it as it hit the power plant. Daniels was overcome by the nuclear winds and instinctively tried to escape and found that he was able to generate a tornado around himself and fly out of the nuclear tornado. Daniels decided to test his new found powers out by halting the nuclear tornado from doing any further damage and easily dissipated the storm. Now that he had powers, Daniel decided he was going to make something of himself instead of being a cattle handler, headed East to New York City to make his mark on the world. \n\nWhen the [[Frightful Four]] placed an ad in the local paper for an opening on the team, the Texas Twister used the opportunity to check out the captured [[Fantastic Four]]. After displaying his powers to the Frightful Four, the Texas Tornado accomplished his goal and then turned down the offer to join stating he had a better offer elsewhere. When the Fantastic Four disbanded for a short period of time, the [[Human Torch (Johnny Storm)|Human Torch]] entered a cross country car race. The Texas Twister took the opportunity to scout out the Human Torch once again while putting on a show for the audience by testing the Human Torch's powers. As a crowd gathered, the Texas Twister used the opportunity to leave, telling the Human Torch that he could see why his employers were interested in him. \n\nWhen the criminal organization known as the [[Corporation]] began gathering super-powered individuals, [[Fury, Nick|Nick Fury]] decided to create their own group of super agents. [[S.H.I.E.L.D.]] contacted Daniels soon after he had foiled a bank robbery and offered him a position within S.H.I.E.L.D. as a member of the [[S.H.I.E.L.D. Super-Agents|Super-Agents]]. \n\nWhen the [[Corruptor]] forced [[Jones, Rick|Rick Jones]] to send a distress signal to the [[Avengers]] to lure them into a trap, the signal was unable to reach New York due to the mountain range, but instead was received by the [[Rangers]]. The Rangers discovered that the Corruptor had the [[Hulk (Bruce Banner)|Hulk]]  under his powers and was unable to overpower the gamma powered persona of Bruce Banner. Rick Jones managed to calm the Hulk down, allowing him to revert back to Bruce Banner. Without the aid of the Hulk, the Corruptor's plans were thwarted and was easily captured. \n\nWhile performing at a local rodeo show, the Texas Twister was enveloped in a glowing red energy field and teleported to a vast arena along with all other super-powered hero from every nation on Earth. They would soon learn that the cosmic gamesman known as [[Gamesmaster]] and [[Death (embodiment)|Death]] were playing a game of life and death, and the heroes where chosen to be the [[Contest of Champions|pawns in the game]]. The Texas Twister watched helplessly as each side chose twelve heroes to use as pawns. As one of the many not chosen to  be used, Texas Twister and the others remain behind in the arena and only watch. After the game was over, all the heroes were placed back where they were teleported from, finding that only an hour had elapsed.\n\nWhen the city of New York honored the Hulk for his heroic acts, the Texas Twister along with the rest of the Rangers were there to show their support. Shortly afterwards, the Texas Twister and  his fellow Rangers [[Shooting Star]] and [[Phantom Rider (Hamilton Slade)|Phantom Rider]] were working at a rodeo in Canada when it was attacked by the Frightful Four. [[Spider-Man (Peter Parker)|Spider-Man]] happened to be there to assist the trio in stopping the newly formed group. \n\nAfter celebrating one night too hard, the Texas Twister ended up getting drunk and causing damage to public property. In order to work off his sentence, he agreed to join the [[Thunderbolts|Thunderbolts Army]] and registered with the [[Civil War|Superhuman Registration Act]] in the process. In order to deal with the threat of thousands of civilians being empowered by Grandmaster and the [[Wellspring of Power]], the Thunderbolts Army was split up into various squads. Texas Twister was placed on the Beta Squad as its leader and covered the Los Angeles area. When [[Bloodstrike]] and [[Smiling Tiger]] turned on their squad, Texas Twister realized that they received their powers from the Wellspring itself and were now a liability to the squad's mission, however the core group of Thunderbolts managed to stop Grandmaster’s plans.\n\nIn the aftermath of the civil war between heroes, [[Iron Man (Anthony Stark)|Iron Man]] started the Fifty States Initiative and the Texas Twister joined his fellow Rangers to cover the Texas area.",
        "categories": [
            "Civil War",
            "Fantastic Four",
            "Heroes",
            "Initiative",
            "Thunderbolts"
        ]
    }
}