{
    "id": 1010830,
    "name": "Blazing Skull",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/8/d0/4ce5a37a830a3",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010830",
    "comics": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010830/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/1687",
                "name": "New Invaders (2004) #7"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/2046",
                "name": "New Invaders: To End All Wars (Trade Paperback)"
            }
        ],
        "returned": 2
    },
    "series": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010830/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/729",
                "name": "New Invaders (2004 - 2005)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1241",
                "name": "New Invaders: To End All Wars (2005)"
            }
        ],
        "returned": 2
    },
    "stories": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010830/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/3123",
                "name": "1 of 1",
                "type": "cover"
            }
        ],
        "returned": 1
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010830/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010830/blazing_skull?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Blazing_Skull_(Mark_Todd)?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Mark Anthony Todd",
        "aliases": "Steve Valiant, Richard Stetson, Ghost Rider, Skull, Koos",
        "identity": "Secret",
        "occupation": "Adventurer, former newspaper columnist, freelance reporter",
        "citizenship": "U.S.A.",
        "place_of_birth": "Cleveland, Ohio",
        "relatives": "Mother (name unrevealed, deceased), Victor (father), Unnamed Brother or Sister, [[Ion|Voletta Todd]] (Ion, niece)",
        "groups": "Formerly [[Defenders]], Initiative, [[Invaders]]",
        "education": "Presumed degree in journalism",
        "height": "6'",
        "weight": "198 lbs.",
        "eyes": "Brown; (as Skull) red",
        "hair": "None, formerly Brown; (as Skull) none",
        "powers": "The Blazing Skull has the ability to make his skin invisible, but cannot turn his bones invisible. He is also impervious to fire and the effects of flame. Over the course of years his powers increased giving him superhuman strength (at least enough strength to lift and throw a fully loaded tank), and the ability to project and expel flame. He has a healing factor that rivals that of [[Wolverine (James Howlett)|Wolverine]] and if a part of his body is cut off, he can reconnect it. He is also immune to all injury, but still feel's pain. His powers have either slowed or stopped his aging completely.",
        "abilities": "The Skull has advanced investigative and journalist skills and is an accomplished athlete and is excellent in hand-to-hand combat. He is also an accomplished pilot.",
        "weapons": "",
        "paraphernalia": "Early in his career the Skull wore a burning mask which were the apparent source of his powers. However over time the mask was absorbed into his face, making him able to activate his powers at will.",
        "debut": "Mystic Comics #5",
        "origin": "Mystic Comics #5, Midnight Sons Unlimited #9, Invaders Vol.2 #3",
        "significant_issues": "Mystic Comics #5-6, Invaders Vol.2 #2-4, Marvels #1, Midnight Sons Unlimited #9, Avengers Vol.3 #82-84, Invaders Vol.3 #0-9",
        "main_image": "Blazingskull.jpeg",
        "bio_text": "Mark Anthony Todd was born October 7, 1910 in Cleveland, Ohio. As he grew up he became a pacifist and went on to become a freelance reporter in the 30s. On his fist assignment Todd was sent to Japan were he found a race of super-intelligent [[Skull-Men]]. They accepted Todd and taught him occult secrets and gave him a burning mask. In return for their kindness and he vowed to the Skull-Men to be a beacon of hope and justice as the Blazing Skull. Todd then went to Germany where he joined an anti-[[Nazi Party|nazi]] movement. He however was captured by Nazi agents and was brought before [[Hate-Monger (Adolf Hitler)|Adolf Hitler]]. He somehow managed to escape and traveled to London where he saved [[Churchill, Winston|Winston Churchill]]'s life from Nazi mercenaries.",
        "bio": "Mark Anthony Todd was born October 7, 1910 in Cleveland, Ohio. As he grew up he became a pacifist and went on to become a freelance reporter in the 30s. On his fist assignment Todd was sent to Japan were he found a race of super-intelligent [[Skull-Men]]. They accepted Todd and taught him occult secrets and gave him a burning mask. In return for their kindness and he vowed to the Skull-Men to be a beacon of hope and justice as the Blazing Skull. Todd then went to Germany where he joined an anti-[[Nazi Party|nazi]] movement. He however was captured by Nazi agents and was brought before [[Hate-Monger (Adolf Hitler)|Adolf Hitler]]. He somehow managed to escape and traveled to London where he saved [[Churchill, Winston|Winston Churchill]]'s life from Nazi mercenaries.\n\nTodd then returned to the United States and resumed his reporter job with the [[Daily Globe]]. Still using the guise of Blazing Skull he continued to fight threats such as [[Big Joe]] and [[Doctor Fear]]. In 1942 he joined the [[Invaders]] to battle [[Battle-Axis]]. After the fight with Battle-Axis he joined the Invaders and other wartime heroes in a battle behind enemy lines. \n\nIn January of 1945 the Skull returned to New York and foiled a plot by Nazi agents as they tried to blow up the Statue of Liberty. Their leader, the [[Masked Raider]] fled the scene, but vowed to return to make the Skull pay for his interference. Wanting more information on the story his editor at the Daily Globe sent him to London where he encountered the [[Iron Cross]], who was filming a missile test. As the Skull and Iron Cross began to fight, [[Union Jack (Montgomery Falsworth)|Union Jack]] joined the Skull and the two managed to cause the Iron Cross to retreat to Germany. After the battle Union Jack helped the Skull by contacting the [[Destroyer (Keen Marlow)|Destroyer]] in Germany. After that Jack flew the Skull behind enemy lines where Skull parachuted into Germany. The Destroyer greeted the Skull, and the two were found by Nazi soldiers. To deceive the Nazis, the Destroyer knocked the Skull unconscious and handed him over to the Nazis. Todd was then brought before Iron Cross and Nazi scientists who revealed their plan to use homing beacons in order to tactically bomb the United States. During this time the Destroyer was caught sabotaging the missiles. He was brought before the Iron Cross and managed to free the Skull who along with the Destroyer managed to stop the Nazis and blow up the Iron Cross. Todd returned to America and gave his story to his editors, who couldn't believe how lucky he was. However the threat wasn't over yet when the Masked Raider returned and tried to bomb the White House. Todd stopped the Masked Raider, who turned out to be a radio show host. However the missiles had been launched and the Skull commandeered a prop plane and rammed it into a missile, saving the White House.\n\nAfter the war had ended Todd became a newspaper columnist and urged the American people to support more military action overseas. Realizing that he had not aged in decades he returned to being the Blazing Skull. He used various aliases such as Steve Valiant and Richard Stetson. There are little or no records of his activities during the following decades. Eventually he was declared dead.\n\nDuring the [[Kree/Skrull War]] [[Jones, Rick|Rick Jones]] powers manifested themselves and he manifested various golden age superheroes. Among them was the Blazing Skull. The Skull managed to fight off several [[Skrulls]] and [[Kree]] soldiers until Ricks' powers failed and the heroes were sent back to wherever they originated from. \n\nTodd then recently showed up in the Middle East and taken into custody of a terrorist known as Malik for years. He was ritualistically beaten and tortured each day by urinating on him and beating him senseless. One day [[U.S.Agent]] aka John Walker freed Todd from his prison and asked him to join the new [[Invaders]] alongside [[Spitfire]], [[Union Jack (Joseph Chapman)|Union Jack]], and [[Tara]]. Todd accepted and aided the Invaders in an attack involving [[Atlantis]]. The team aided [[Namor]] and added him to their ranks. Together the Invaders invaded Mazikhandar and came into conflict with the [[Avengers]]. The Skull recognized [[Captain America (Steve Rogers)|Captain America]] and greeted him as a fellow Invader, forming a somewhat steady alliance between the New Invaders and the Avengers. After the skirmish a cruel politician shot the current leader of Mazikhandar and took control of the country. However the [[Thin Man]] showed up and killed the politician. Mazikhandar became a protectorate of Atlantis and the Invaders added Thin Man to their ranks. The Two teams parted ways and left each other on semi-good terms.\n\nWeeks later several cloned terrorist creatures called [[Pterorist]]s attacked the [[Human Torch (Jim Hammond)|Jim Hammond]]. Luckily the Invaders arrived and saved Jim. However the true motive of the Invaders saving Jim was to ask for the [[V-Battalion]]s help. Jim accepted their help and along with the Thin Man's ship the [[Infiltrator]], its captain the [[Fin]] battled [[Axis Mundi]]. During the battle against Axis Mundi aboard the Infiltrator the Nazi the [[Gotteskrieger]] impaled the Skull with a spear and ripped off his head. During the battle fellow Invaders fought Axis Mundi agents, [[Baroness Blood]], [[Warrior Woman]], and [[Meranno]]. During the battle the Skull managed to pick himself up and revive himself even without his head. The Skull was a major factor in the Invaders winning the battle when the Skull took down the Gotteskrieger.\n\nDays later the [[Destroyer (Roger Aubrey)|Destroyer]] and his friend Nigel encountered Vampires in Germany who were sent after a small town by [[Baroness Blood]]. The Invaders learned of this and sent Union Jack, Spitfire, Tara, and Jim Hammond who eventually defeated Baroness Blood. Weeks later [[Baron Strucker]], the leader of [[Hydra]] sent a mind controlled [[Wolverine (James Howlett)|Wolverine]] to attack the Invaders. During their first clash the Skull apparently recognized Wolverine and called him \"Charlie\", whether they truly have met before or it is just the Skulls mental instability is unknown. However during a clash between the Skull and Wolverine, Logan sliced off the Skulls left arm and leg. U.S.Agent then told the Skull to heal and managed to stop Wolverine before he could kill Namor. As the Skull flew the injured Invaders away Logan was sent on another mission by Hydra.\n\nDays later the Thin Man managed to capture [[Agent Axis]] and started to psychically torture them in order to get information from them. While the Thin Man tried to get information from Agent Axis, U.S.Agent and Blazing Skull watched Union Jack sketch a nude Tara. Enraged at their attitude Hammond and Spitfire chewed out Skull and Union Jack. However in order to \"help\" Jack with his sketches the Skull started to strip, showing his naked skeleton body. Grossed out Hammond and Walker forced Todd to redress himself. Captain America then tried to shut the Invaders down by infiltrating the Infiltrator. The Captain and the Thin Man fought for a few minutes before becoming aware of a plot by Meranno. The team along with Captain America intercepted Meranno and a fight broke out on a secluded island. There the team learned that Tara was an Axis Mundi sleeper agent. During the fight that followed Jim Hammond sacrificed his life in order to save Tara. However Tara became comatose and the Invaders continue to search for a way to save Tara from her comatose state.\n\nRecently, the Skull joined the 50 State Initiative and was contracted by [[Iron Man (Anthony Stark)|Iron Man]] to work on the new [[Defenders]] team.",
        "categories": [
            "Avengers",
            "Golden Age",
            "Heroes",
            "Initiative",
            "Magic"
        ]
    }
}