{
    "id": 1010930,
    "name": "Hobgoblin (Jason Macendale)",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/40/image_not_available",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010930",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010930/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010930/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010930/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010930/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010930/hobgoblin_jason_macendale?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Hobgoblin_%28Jason_Macendale%29?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Jason Philip Macendale Jr.",
        "aliases": "\"Hoblin\"; formerly Jack O'Lantern",
        "identity": "Publicly known",
        "occupation": "Mercenary; former professional criminal, mob enforcer, government operative, fighter pilot, soldier",
        "citizenship": "U.S.A. (revoked)",
        "place_of_birth": "Boston, Massachusetts",
        "relatives": "Karen Vancolder (ex-wife), Jason \"Jay\" Macendale (son)",
        "groups": "None; formerly the [[Sinister Six]]",
        "education": "Masters degree in electrical engineering and physics",
        "height": "6'1\"",
        "weight": "210 lbs.",
        "eyes": "Brown",
        "hair": "Black",
        "powers": "As Jack O'Lantern and in his early time as the Hobgoblin, Macendale had normal human abilities for a man who engaged in intensive regular exercise. While possessed by Demogoblin, Macendale possessed superhuman strength (lifting up to 10 tons), speed and durability, resistance to some forms of magic, and the ability to create objects from demonic fire; he could use mystic energy to amplify his glove-blasts, alter the shape of his goblin-glider, and augment the range and effectiveness of his throwing weapons. Following his separation from Demogoblin, Macendale obtained superhuman strength (lifting up to 4 tons) via treatments provided by the Grim Hunter. As a cyborg, Jason Macendale was superhumanly strong (lifting up to 10 tons), with detachable claws and a bionic left eye capable of night vision and telescopic sight.",
        "abilities": "Macendale was highly skilled in hand-to-hand combat. His military experience included flight training. He could pilot most forms of airplanes and helicopters. Macendale was a veteran C.I.A. agent and pilot with exceptional skill in most forms of martial arts and hand-to-hand combat, as well as extensive training in electrical engineering and physical sciences.",
        "weapons": "As Jack O'Lantern, Macendale employed numerous types of custom-designed grenades including anaesthetic, lachrymatory, regurgitant gas, smoke, and concussion grenades. Jack O'Lantern was also equipped with wrist-blasters which incorporated high-frequency electric transducers that could deliver a shock with the effective range of 35 feet.",
        "paraphernalia": "Jack O'Lantern wore complete body armor made of metal-mesh covered, muiti-segmented kevlar panels, incorporating a rigid, articulated shell which could resist a 7-pound bazooka anti-tank warhead. Jack O'Lantern's head was covered by a bullet-proof helmet with an internal, 3-hour, compressed-air supply and is equipped with telescopic infrared image-intensifiers for seeing in the dark. The base of the helmet was equipped with a fine network of pinholes which maintained a low-temperature flame (\"stage-fire\": a low density flame used safely on stage to simulate fire) that formed a ring around his head at all times. The air supply cooled the interior of the helmet semi-adiabatically through expansion. He traveled via his \"pogo-platform\" hovercraft that could bounce off objects and float in the air.",
        "debut": "(as Jack O'Lantern) Machine Man #19 (1981); (as Hobgoblin) Amazing Spider-Man #289 (1987)",
        "origin": "Amazing Spider-Man #279 (1986); Spider-Man: Hobgoblin Lives #1 (1997)",
        "significant_issues": "For more detaled bibliography see [[OHOTMU:Bibliography-Spider-Man_2007#Macendale.2C_Jason|Official Handbook Bibliography]]; first encountered Spider-Man (Spectacular Spider-Man #56, 1981); arranged killing of Ned Leeds and took Hobgoblin title for himself (Amazing Spider-Man #289, 1987); fought Green Goblin (Amazing Spider-Man #312, 1989); acquired demonic powers (Spectacular Spider-Man #147, 1989); joined Sinister Six (Amazing Spider-Man #335, 1990); Demogoblin separated from Macendale (Web of Spider-Man #86, 1992); acquired Kraven's formula (Spider-Man #48, 1994); acquired cybernetic enhancements (Spider-Man #68, 1996); captured (Spider-Man #69, 1996); killed by Roderick Kingsley (Spider-Man: Hobgoblin Lives #1, 1997)",
        "main_image": "Hobgoblin (Jason Macendale) Head.jpg",
        "bio_text": "Jason Macendale worked for the CIA and was dismissed when his methods were getting too extreme. He decided to use his skills for profit as a mercenary, later adopting the costumed identity of the Jack O'Lantern adorned with a flaming pumpkin for a head, green body armor, and a bouncing pogo platform for transportation. His first target as Jack was to take control of a prototype super-embassy and people in it. He took over the building fast by infiltrating it in the middle of a Halloween party. His bad luck was that [[Machine Man]] was among the guests and he quickly foiled Jack's plans. Jack was taken to a hospital and seemed to be in coma. In reality he had taken a drug after he lost to Machine Man that made him fall in the coma, so he would be taken to a hospital rather than a prison. He quickly took the hospital over with his henchmen. When [[Spider-Man (Peter Parker)|Spider-Man]] learned about this. He immediately headed to the hospital. He soon found Jack and after a short fight. Jack O'Lantern realized that he wasn't any match for Spider-Man and decided to escape. Spider-Man stopped him in the hospital's yard, knocking him out with a single punch.",
        "bio": "Jason Macendale worked for the CIA and was dismissed when his methods were getting too extreme. He decided to use his skills for profit as a mercenary, later adopting the costumed identity of the Jack O'Lantern adorned with a flaming pumpkin for a head, green body armor, and a bouncing pogo platform for transportation. His first target as Jack was to take control of a prototype super-embassy and people in it. He took over the building fast by infiltrating it in the middle of a Halloween party. His bad luck was that [[Machine Man]] was among the guests and he quickly foiled Jack's plans. Jack was taken to a hospital and seemed to be in coma. In reality he had taken a drug after he lost to Machine Man that made him fall in the coma, so he would be taken to a hospital rather than a prison. He quickly took the hospital over with his henchmen. When [[Spider-Man (Peter Parker)|Spider-Man]] learned about this. He immediately headed to the hospital. He soon found Jack and after a short fight. Jack O'Lantern realized that he wasn't any match for Spider-Man and decided to escape. Spider-Man stopped him in the hospital's yard, knocking him out with a single punch.\n\n[[image:HobgoblinJason01.jpg|thumb|left|Jason Macendale as Jack O'Lantern]]\nHe tangled up with Spider-Man some time later and was again beaten, but this time was able to escape. After Spider-Man had gone missing Jack O'Lantern stumbled into [[Silver Sable]], and after a short fight she managed to destroy Macendale's pumpkin helmet forcing Macendale to retreat. Macendale then went to free [[Thompson, Flash|Flash Thompson]] from jail as he thought that he was the real Hobgoblin. When [[Hobgoblin (Ned Leeds)|Hobgoblin]] heard about this he went to find Jack. He crashed in Jack's hideout and attacked him blaming him for ruining his plan. The fight ended in a stalemate and both villains went their separate ways. Flash managed to escape when Jack and Hobgoblin were fighting.\n\nThese two later joined with the [[Kingpin]] to fight against [[Hammerhead]] and his troops. Jack and Hobgoblin, now allies were sent to fight against Hammerhead's troops, but their alliance didn't last long when they had a run-in with Spider-Man. Jack bailed out of the fight and left Hobgoblin to fight him alone. When Kingpin returned he fired Jack O'Lantern explaining that he \"didn't meet his standards.\" Hobgoblin hunted down Jack O'Lantern for revenge for his betrayal, but because of outside interference, the conflict ceased and Hobgoblin took off.\n\nNot long after last encounter with the Hobgoblin, Macendale hired the [[Foreigner]] to kill him. Foreigner pulled some strings and got hitmen to kill Ned Leeds. Macendale then acquired Hobgoblin's equipment and paid a visit to [[Fisk, Richard|Rose]] and Kingpin. He then attacked Spidey again and managed to give Spider-Man a hard landing. He was just about to finish him off with a pumpkin bomb when Flash Thompson intervened. He caught the bomb and threw it back at Hobgoblin. It exploded and Hobgoblin ended up with broken rips and retreated.\n\n[[image:Macendale-Hobgoblin-Garney.jpg|thumb|left|Jason Macendale as demonic Hobgoblin]] In the beginning of the [[Inferno (event)|Inferno]] incident Hobgoblin went after [[Green Goblin (Harry Osborn)|Harry Osborn]]. He wanted Osborn to tell him where the Green Goblin formula was located, threatening Osborn's family. Osborn gave Macendale false information, and later, as the Green Goblin, pursued him. Osborn, aided by Spider-Man, battled the Hobgoblin. Harry triumphed and pinned Macendale between a wall and himself, admitting to Macendale that the Goblin formula was destroyed years ago. The Hobgoblin managed to escape but didn't get far before he was attacked by a horde of demons. He decided to find the leader of the demons [[N'astirh]] to ask him to give him power. Macendale offered his soul to him. Amused, N'astirh rejected the offer but nonetheless gave him superhuman powers through the infusion of a demonic entity within Macendale's body. After, the demonic Hobgoblin engaged Spider-Man in combat within the sewers, but Spider-Man was victorious.\n\nNext time he surfaced he was hired to kill [[Doctor Strange (Stephen Strange)|Doctor Strange]]. They fought for sometime and Strange managed to trick Macendale into thinking that he had lost his powers, so he flew away. The next job to Hobgoblin was given by Hammerhead to kill [[Robertson, Joseph \"Robbie\"|Joe Robertson]]. Hobgoblin attacked Robertson at his home but didn't count on [[Puma]] being there and Spider-Man soon joined the fight. With a little help from [[Tombstone]] they managed to drive Hobgoblin away. He then decided to release [[Carrion (Malcolm McBride)|Carrion]] from prison and attacked the prison transport that was transporting him. He freed him and convinced him to ally with himself against Spider-Man. Carrion and Hobgoblin succeeded in capturing Spider-Man, but Spider-Man eventually escaped. Carrion then sacrificed himself to save his mother by taking Hobgoblin and himself out with one of Hobgoblin's pumpkin bombs.\n\nHobgoblin survived the explosion and was approached by [[Doctor Octopus (Otto Octavius)|Doctor Octopus]] to join his [[Sinister Six]]. He fought against Doctor Octopus and was impressed of his skill. He then agreed to join the group, but Doctor Octopus betrayed them all later and the other members ganged up against Doc Ock, but they weren't a mach for him. Hobgoblin had encounters with [[Ghost Rider (Daniel Ketch)|Ghost Rider]], [[Darkhawk]], [[Hulk (Bruce Banner)|Hulk]], [[Deathlok (Luther Manning)|Deathlok]], [[Nova (Richard Rider)|Nova]], [[Solo]], [[Sleepwalker]] and [[Fantastic Four]] who took him and rest of Sinister Six down. Soon after that the demonic side of Hobgoblin broke free of Macendale as a separate entity. The Hobgoblin and this new [[Demogoblin]] attacked Spider-Man again and eventually lost. Spider-Man managed to capture Hobgoblin with [[Venom (Eddie Brock)|Venom]] and Ghost Rider. Macendale later acquired a modified version of  [[Kraven (Sergei Kravinoff)|Kraven]]'s strength-enhancing formula and then killed Demogoblin. He also fought [[Green Goblin (Phil Urich)|Green Goblin]] (Phil Urich), [[Thing (Benjamin Grimm)|Thing]], [[Kaine]] and [[Scarlet Spider (Ben Reilly)|Scarlet Spider]] before he altered his body with cybernetic enhancements from [[Stromm, Mendel|Gaunt]]. He then framed Ben Reilly for torching his workplace, the [[Daily Grind]]. Spider-Man (Ben Reilly) captured Hobgoblin and turned him in. He was then put on trial for a series of crimes he committed as the Hobgoblin. During that trial it was revealed that Ned Leeds was the Hobgoblin before Jason Macendale. Soon after the original [[Hobgoblin (Roderick Kingsley)|Hobgoblin]] (Roderick Kingsley) broke in Macendale's jail cell and killed him, declaring himself the only Hobgoblin who deserved the title.",
        "categories": [
            "Deceased",
            "Spider-Man",
            "Spider-Man Villains",
            "Villains"
        ]
    }
}