{
    "id": 1010896,
    "name": "Lyja",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/3/40/4c003594c52e8",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010896",
    "comics": {
        "available": 3,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010896/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/16003",
                "name": "Fantastic Five (2007) #1"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17451",
                "name": "Fantastic Five: The Final Doom (Trade Paperback)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/16877",
                "name": "Incredible Hulk Annual (1976) #20"
            }
        ],
        "returned": 3
    },
    "series": {
        "available": 3,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010896/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2535",
                "name": "Fantastic Five (2007)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/3281",
                "name": "Fantastic Five: The Final Doom (2007)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2983",
                "name": "Incredible Hulk Annual (1976 - Present)"
            }
        ],
        "returned": 3
    },
    "stories": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010896/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/32679",
                "name": "5XLS - 1 of 5",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/35365",
                "name": "You're Invited!",
                "type": "interiorStory"
            }
        ],
        "returned": 2
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010896/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010896/lyja?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Lyja?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Lyja",
        "aliases": "Alicia Masters, Lyja The Lazerfist, Laura Green",
        "identity": "Secret",
        "occupation": "Former Skrull Liason Officer",
        "citizenship": "Skrull Homeworld",
        "place_of_birth": "Unrevealed",
        "relatives": "[[Human Torch (Johnny Storm)|Johnny Storm]] (ex-husband), [[Invisible Woman|Susan Storm]] (ex-sister-in-law)",
        "groups": "Former lover of [[Paibok]], Former ally of the [[Fantastic Four]], Former wife of the Human Torch",
        "education": "Training as a Skrull Liason Officer, Training to impersonate [[Masters, Alicia|Alicia Masters]]",
        "height": "Unrevealed",
        "weight": "Unrevealed",
        "eyes": "Green (as Lyja), Blue (as Alicia)",
        "hair": "Green (as Lyja), Red (as Alicia)",
        "powers": "None, though Lyja temporarily had the ability to fire blasts of energy from her fists that she could use to cause damage as well as propel herself through the air.",
        "abilities": "Lyja had the same natural Skrull ability to change her shape at will, until [[Mister Fantastic]] took these away from the race, presumably including Lyja herself.",
        "weapons": "",
        "paraphernalia": "",
        "debut": "Fantastic Four #265 (as Alicia), Fantastic Four #357 (as Lyja)",
        "origin": "Fantastic Four #358",
        "significant_issues": "Fantastic Four #265 (intro as Alicia), Fantastic Four #300 (marriage to Johnny Storm), Fantastic Four #357 (revealed as a Skrull spy), Fantastic Four #370 (given the powers of the lazerfist), Fantastic Four #386 (birth of her \"baby\")",
        "main_image": "Lyja.jpg",
        "bio_text": "In an effort to destroy the [[Fantastic Four]], the Skrull Emperor tried feverishly to come up with a plan to defeat them. The Skrull General, [[Kalamari]], suggested sending someone in as a spy, but the Emperor knew that they could not realistically duplicate any of the four’s powers. Then [[Paibok]] appeared and pointed out that they could make a duplicate of someone close to the four, picking [[Masters, Alicia|Alicia Masters]]. Out of a group of Skrull women, Paibok chose Lyja for the mission. The two had once had an affair that had ended badly, and Lyja was unsure if his choice was a privilege or a punishment. Either way, she was chosen and studied Alicia’s face, mannerisms, and spent countless hours being trained in everything the Skrulls knew about the Fantastic Four, the [[Thing (Benjamin Grimm)|Thing]], and Alicia herself. Lyja was even equipped with contact lenses that would render her blind in her human form and she learned to operate without sight.",
        "bio": "In an effort to destroy the [[Fantastic Four]], the Skrull Emperor tried feverishly to come up with a plan to defeat them. The Skrull General, [[Kalamari]], suggested sending someone in as a spy, but the Emperor knew that they could not realistically duplicate any of the four’s powers. Then [[Paibok]] appeared and pointed out that they could make a duplicate of someone close to the four, picking [[Masters, Alicia|Alicia Masters]]. Out of a group of Skrull women, Paibok chose Lyja for the mission. The two had once had an affair that had ended badly, and Lyja was unsure if his choice was a privilege or a punishment. Either way, she was chosen and studied Alicia’s face, mannerisms, and spent countless hours being trained in everything the Skrulls knew about the Fantastic Four, the [[Thing (Benjamin Grimm)|Thing]], and Alicia herself. Lyja was even equipped with contact lenses that would render her blind in her human form and she learned to operate without sight.\n\n\nThe Skrulls waited patiently for the right moment; then they found it as the Fantastic Four were beamed away by the mysterious, alien construct that appeared in Central Park. They acted quickly to replace Alicia, and Paibok took the original away. But when the three members of the Fantastic Four returned, Lyja was shocked to find [[She-Hulk]] in place of the Thing, who she had expected to return. The [[Human Torch (Johnny Storm)|Human Torch]] reluctantly told her that Ben had stayed behind and was replaced by She Hulk, thinking that Alicia was heart-broken over the loss of her love. Lyja’s plans were in shambles, but she reacted quickly and turned to Johnny, who she intended to get close to as a confidant. However, Lyja made a bigger mistake and fell in love with Johnny and the two were later married in a private ceremony that the [[Puppet Master]] nearly broke up until he realized how happy his niece - who he mistook Lyja for - seemed to be.\n\n\nThe couple spent many years happily wed; but one day, when the Thing prepared himself a midnight snack, he heard noises coming from [[Mister Fantastic|Mister Fantastic's]] laboratory. Lyja was there, attempting to destroy Reed’s Brain Analyzer before he could discover that she wasn’t really Alicia. Ben confronted her as an intruder, who appeared as a shadow, and continued to change into various forms to elude him until he rounded a corner and found Alicia there - who claimed she encountered nothing. Ben explained what he saw, though the rest of his team was skeptical. Later, Lyja discussed it with Johnny, who refused to believe that it was simply a hallucination. Lyja suggested that it could have been someone like the Puppet Master. Then, right on schedule, Ben slammed his way through the door alongside the Puppet Master and came after the woman disguised as Alicia. Johnny tried to stop him, but the Thing eventually snuffed his flame and threatened Lyja to reveal herself to the whole team, proving that she had duplicated Alicia.\n\n\nReed was forced to stop Johnny from killing Lyja before she could tell them the truth. Only when the [[Invisible Woman]] used her force field on him did he burn himself out and calm down. Lyja then told them all the details of her mission, explaining that she had been Alicia since before Johnny married her. The Torch refused to believe this, thinking that he had married the real Alicia, and Lyja had simply replaced her later. But Lyja insisted, explaining that she had shared his bed and his life, and was soon to have his baby. Then, together with the Fantastic Four, Lyja donned Sue’s original uniform (to differentiate her from other Skrulls) and agreed to help them rescue the real Alicia in exchange for her freedom. Again, Johnny was furious but he restrained himself. When they invaded the Skrulls’ hidden base, Lyja armed herself with a stun gun and fought alongside the four. Though once Paibok appeared and turned on Johnny for the imagined indignities he felt the human had made Lyja suffer, she was torn between the man she had lived with and her former lover. Then, before Paibok could fire a lethal beam at Johnny’s back, Lyja transformed into a giant, alien beast and threw herself in the way of the beam. The Thing dropped a massive pillar on Paibok, putting him out of commission.\n\n\nLyja was injured and lay dying. The Torch ran to her and asked her why she would do what she did. She told him that she wasn’t pregnant - she only wanted him to stay with her - and that she loved him, and would always love him. She seemingly died in his arms as he professed his own love for her. Mister Fantastic saved the real Alicia from her suspended animation and they were forced to leave Lyja’s body and escape as Paibok recovered and came after them. Later, when the Fantastic Four fought the [[Magnus]], Paibok joined up with [[Devos|Devos the Destroyer]], and together they revived Lyja and imbued her with her own superpowers. Calling her Lyja the Lazerfist, they plotted their revenge and soon attacked the Torch while he was attending Empire State University. Paibok and Devos chased him around, firing at him, until Lyja appeared. Feeling abandoned, Lyja hungered for revenge and used her new bio blasts to try and destroy the Torch. She again claimed to be pregnant, and together with her two allies, she poured fire upon the Torch until he lost control and used his ultimate weapon against them: his nova flame. Johnny turned white-hot and partially burned down Empire State University while Lyja and her cohorts fled.\n\n\nTogether they continued to taunt Johnny. Lyja and Paibok appeared in a crowd during his arrest, revealing themselves enough to send him into a frenzy, but acting as innocents once he turned on them; further damaging his image. But Lyja could not hate him as Paibok expected, and she snuck out of their orbiting ship and defended Johnny when he and his teammates stood off against [[Ghost Rider (Daniel Ketch)|Ghost Rider]], [[Wolverine (James Howlett)|Wolverine]], [[Hulk]], and [[Spider-Man (Peter Parker)|Spider-Man]]: the [[Secret Defenders]]. She stopped the Ghost Rider from killing him, claiming that as her right, but fought alongside of him when they were taken to the Moon shortly afterwards by [[Uatu The Watcher]]. Johnny saved her, as well, from an extra-powered [[Doctor Doom (Victor von Doom)|Doctor Doom]], before the [[Inhumans|Inhuman]] [[Black Bolt]] stopped Doom and they returned to Earth. She agreed to join Johnny when he was charged and imprisoned, and later accompanied the Thing to Alicia’s apartment where she met the woman she impersonated.\n\n\nLyja attended Johnny’s trial, which was shortly broken up by Paibok, Devos, [[Klaw]], and [[Huntara]], a future relative of the Richards’. Lyja fought the villains, and her former allies, until Paibok reminded her that her baby would not be born properly without a genefit of a Lacaroo. The fight went out of Lyja, and she slumped to the ground, but Johnny appeared to save her though he took a blast in the back from Klaw. Afterwards, while Reed worked to fix a mutated [[Ms. Marvel (Sharon Ventura)|Ms. Marvel]], Lyja left [[Four Freedoms Plaza]] and disguised herself as a woman named Laura Green and became angry when Johnny hit on her. She later collapsed in pain due to her pregnancy, but made the then-teenage [[Richards, Franklin|Franklin]] promise not to reveal it. She continued to vacillate between trusting Johnny and hating him, but finally revealed to him that if she didn’t have the Lacaroo birthing medicine their baby would die. Luckily, they were captured by Paibok and Devos and taken to the Skrull Homeworld, where Lyja and the remaining members of the Fantastic Four followed the lead of the Invisible Woman after the apparent death of Reed Richards, along with Doom. On the way off the planet, Susan grabbed a vial of birthing medicine.\n\n\nDuring a mission undersea alongside [[Sub-Mariner|Namor]] and the Inhuman [[Triton]], Lyja went into labor. Triton swam both Lyja and Johnny away and back to a hospital while the rest continued on. With very little time left, Lyja entrusted herself to a human doctor, and Johnny handed him the birthing medicine she needed. The doctor discovered that the medicine put Lyja in a spongy state, and he searched the mass for the baby. He pulled out the implant that gave her the energy powers, and tossed it away. Then he finally found the baby, which turned out to be an egg. Lyja and Johnny spent the next few days coming back to their incubated egg. Johnny even considered quitting the team, as he feared for the life of his baby with all the dangerous things going on at the time. He had finally decided to remain behind while the rest went out on a portentously fatal mission to stay with his child. A man appeared named [[Suarez, Raphael|Raphael Suarez]] who showed up as the [[Collector]] appeared to take their very unique child, and Raphael helped fight off a robot sent by the Collector with the lazerfist powers he accidentally received from Lyja’s implant. Moments before, Lyja herself discovered that her own powers were gone. After analyzing the egg, the Collector pronounced it a sham and disappeared. Lyja revealed that Johnny was not the egg’s father, but it was actually an artificial implant. She explained that she had tried to tell him, but couldn’t. As the egg began to hatch Johnny was whisked away to fight alongside his teammates.\n\n\nThe egg then hatched and a huge, tentacled monster sprang forth. Lyja and Raphael fought it, with the help of [[Ant-Man (Scott Lang)|Ant-Man]] and Namor, but only when Lyja used her Skrull abilities to transform into a twin of the creature was it finally beaten. Johnny and the rest of his team reappeared and Lyja explained that the creature was a Sha’Barri, implanted in her to destroy the Fantastic Four. She tried to make it up to him and offered to start their life over, but Johnny refused to trust her again and they both went their separate ways. Lyja continued to keep tabs on Johnny as Laura Green, but stayed estranged from him. She eventually decided to stay on Earth and assume a human life, as she no longer felt connected to her Skrull heritage.\nLyja has revealed to Jonny Storm that she was inpersonating his sister and has lock the Baxter Building with them, the Thing, and Franklin and Val in it, in the Negative Zone.",
        "categories": [
            "Heroes",
            "Fantastic Four",
            "Cosmic",
            "Women",
            "Reformed Villains"
        ]
    }
}