{
    "id": 1010906,
    "name": "Baron Zemo (Helmut Zemo)",
    "description": "",
    "modified": "2011-02-24T13:21:20-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/5/a0/4c0035890fb0a",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010906",
    "comics": {
        "available": 8,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010906/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/7739",
                "name": "Captain America (1968) #358"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/7740",
                "name": "Captain America (1968) #359"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/7741",
                "name": "Captain America (1968) #360"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/7742",
                "name": "Captain America (1968) #361"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/7743",
                "name": "Captain America (1968) #362"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/33346",
                "name": "Captain America (2004) #606 (HEROIC AGE VARIANT)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/35416",
                "name": "Captain America (2004) #609 (WOMEN OF MARVEL VARIANT)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/38153",
                "name": "Hawkeye: Blind Spot (2011) #2"
            }
        ],
        "returned": 8
    },
    "series": {
        "available": 3,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010906/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1996",
                "name": "Captain America (1968 - 1996)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/832",
                "name": "Captain America (2004 - 2011)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/13731",
                "name": "Hawkeye: Blind Spot (2011)"
            }
        ],
        "returned": 3
    },
    "stories": {
        "available": 8,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010906/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/17986",
                "name": "Captain America (1968) #358",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/17989",
                "name": "Captain America (1968) #359",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/17992",
                "name": "Captain America (1968) #360",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/17995",
                "name": "Captain America (1968) #361",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/17998",
                "name": "Captain America (1968) #362",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/85243",
                "name": "Hawkeye: Blind Spot #2 ",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/94772",
                "name": "Captain America (2004) #606, HEROIC AGE VARIANT",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/94774",
                "name": "Captain America (2004) #609, WOMEN OF MARVEL VARIANT",
                "type": "cover"
            }
        ],
        "returned": 8
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010906/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010906/baron_zemo_helmut_zemo?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Baron_Zemo_(Helmut_Zemo)?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Helmut Zemo",
        "aliases": "Iron Cross, Citizen V, Mark Evanier, Phoenix",
        "identity": "Publicly known",
        "occupation": "Adventurer, mastermind, would-be world savior with world conquest inclinations; former professional criminal, assassin, engineer",
        "citizenship": "Germany, international criminal record, legally dead, formerly worked with various U.S.A. authorities",
        "place_of_birth": "Leipzig, Germany",
        "relatives": "[[Baron Zemo (Heinrich)|Heinrich Zemo]] (father, deceased), [[Zemo, Hilda|Hilda Zemo]] (mother, deceased), [[Baroness|Heike Zemo]] (Baroness, wife, reportedly deceased), [[Baron Zemo (Harbin Zemo)|Harbin Zemo]] (ancestor, deceased)",
        "groups": "None; formerly [[Thunderbolts]], [[Masters of Evil]]; former [[Secret Empire]] financier",
        "education": "College graduate",
        "height": "5'10\"",
        "weight": "183 lbs.",
        "eyes": "Blue",
        "hair": "Blond, mostly burned away",
        "powers": "Zemo's aging has been slowed by periodic immersion in Compound X.",
        "abilities": "He is a gifted scientist. Though not an inventive genius, he is a capable engineer and a talented problem-solver, highly adept at understanding, modifying, and manipulating existing technologies. He is a fine marksman with handguns and an expert swordsman.",
        "paraphernalia": "He sometimes wears circuitry in his hood guarding against [[Glossary:P#psychic|psychic]] assault, and occasionally uses weapons or traps incorporating his father's Adhesive X, which forms an unbreakable bond with any substance unless it is subjected to a special solvent. Zemo has recently usurped [[Moonstone (Karla Sofen)|Karla Sofen]]'s moonstones, [[Glossary:A#alien|alien]] power gems which enable him to manipulate energy on a massive scale for effects such as strength/durability augmentation, [[Glossary:S#space warp|space warp]] creation, gravity manipulation, light manipulation, molecular phasing, and more.",
        "debut": "Captain America #168 (1973)",
        "origin": "",
        "significant_issues": "",
        "main_image": "HelmutZemo_Head.jpg",
        "bio_text": "Helmut Zemo was born to greatness-and great darkness. Both legacies began with [[Baron Zemo (Harbin Zemo)|Harbin Zemo]], a minor official in the small town of Zeulniz who single-handedly fought off a band of Slav raiders in 1480. Rewarded with a title as the first Baron Zemo, Harbin became legendary for his bravery, but he also became infamous for his grandiose ego and bloodthirsty temper. In the early 20th Century, scientific genius [[Baron Zemo (Heinrich Zemo)|Heinrich Zemo]] became the twelfth Baron Zemo. Heinrich and his wife [[Zemo, Hilda|Hilda]] had a son, Helmut. Born in the 1930s, Helmut spent at least part of his youth in Berlin, developing a fondness for American popular culture imports such as horror films, comic books and movie serials.",
        "bio": "Helmut Zemo was born to greatness-and great darkness. Both legacies began with [[Baron Zemo (Harbin Zemo)|Harbin Zemo]], a minor official in the small town of Zeulniz who single-handedly fought off a band of Slav raiders in 1480. Rewarded with a title as the first Baron Zemo, Harbin became legendary for his bravery, but he also became infamous for his grandiose ego and bloodthirsty temper. In the early 20th Century, scientific genius [[Baron Zemo (Heinrich Zemo)|Heinrich Zemo]] became the twelfth Baron Zemo. Heinrich and his wife [[Zemo, Hilda|Hilda]] had a son, Helmut. Born in the 1930s, Helmut spent at least part of his youth in Berlin, developing a fondness for American popular culture imports such as horror films, comic books and movie serials. \n\nMeanwhile, Heinrich became a leading scientist and special agent in [[Hitler, Adolf|Hitler]]'s Nazi regime, inventing an early laser beam (his \"death ray\"), the super-durable [[Adhesive X]], the age-retarding [[Compound X]], and more. While his loving family worshipped him, Heinrich quickly became one of the most despised enemies of the Allied powers, and was also widely disgraced in his own country after a defeat by America's [[Howling Commandos]]. Hated and feared both at home and abroad, Heinrich began wearing a hooded disguise almost constantly; he also began going mad, especially after his hood was permanently glued to his head by Adhesive X during a battle with the Allied super-agent [[Captain America (Steve Rogers)|Captain America]]. As Heinrich grew more unstable, he became abusive toward his family. Hilda died helping Captain America thwart Zemo's Medusa Effect scheme, but Helmut remained loyal, helping his father battle the Captain and the hero's young partner [[Winter Soldier|Bucky Barnes]] during that same incident. \n\nIn 1945, Baron Zemo seemingly slew Captain America and Bucky and went into hiding in the Amazon, carving out his own private kingdom with the aid of a mercenary army (including [[Atlas (Erik Josten)|Erik Josten]] in recent years) and an enslaved native population. In Heinrich's absence, Helmut led a more normal life for decades, studying science and becoming an engineer. Summoned to visit Heinrich's Amazon stronghold, Helmut watched his father ruthlessly crush a native uprising, saw Josten's fanatical devotion to the Baron, and heard Heinrich boast of killing the World War II freedom fighter [[Citizen V (John Watkins)]]; Helmut was disturbed yet intrigued. Roughly one year later, news of Captain America's survival led to a series of clashes between the Captain (backed by the [[Avengers]]) and the Baron (backed by his [[Masters of Evil]]). After Heinrich accidentally killed himself during a battle with Captain America, Helmut blamed the Captain for destroying their family. Studying and replicating some of Heinrich's inventions and undergoing combat training, Helmut eventually attacked Captain America in the costumed guise of the Phoenix, also battling the Captain's new partner the [[Falcon (Sam Wilson)|Falcon]]. In the end, Zemo was accidentally knocked into a vat of Adhesive X. \n\nHelmut survived, but with hideous facial scars. As the new Baron Zemo, he targeted Captain America with the aid of his android ally [[Primus (android)|Primus]] and various [[Glossary:M#mutate|mutates]] created by Zemo's mad geneticist associate [[Zola, Arnim|Arnim Zola]], such as the rat-man [[Vermin (Edward Whelan)|Vermin]]. Zemo also began menacing the Captain's friends, notably [[Roth, Arnie|Arnie Roth]]. Barely escaping with his life after Vermin turned on him, Zemo formed an alliance with Nazi mastermind the [[Red Skull (Johann Shmidt)|Red Skull]] and his daughter [[Mother Night]], allowing them to mentor him in the ways of evil as they launched a series of attacks on Captain America and his friends. Zemo soon wearied of both his subordinate status and his mentors' indiscriminately hateful worldview, so he turned against his allies. Narrowly surviving a psychic assault from Mother Night, the Baron decided to avenge the loss of his family by destroying Captain America's adopted family, the Avengers. Zemo recruited the largest Masters of Evil team yet and led them in occupying [[Avengers Mansion]], capturing and torturing several of the occupants. The Avengers soon retook the Mansion, and Zemo suffered a crippling fall in battle with Captain America. \n\nLater, aided by the mercenary [[Batroc's Brigade]], Zemo battled Captain America and others on a futile quest to resurrect Heinrich with the [[Bloodstone]]. Further injured in another fall while escaping, Zemo subsequently tried to press Vermin and the other mutates back into his service, but [[Spider-Man (Peter Parker)|Spider-Man]] opposed him, and Vermin ultimately turned on him viciously again. Sometime thereafter, Helmut married the Zemo-inspired terrorist known as the [[Baroness]], who had once claimed to be Heinrich Zemo resurrected in female form. As the Baron and Baroness Zemo, the couple abducted a host of neglected and abused children to create an instant family for themselves, but Captain America freed the children and captured the Zemos with the aid of [[Diamondback (Rachel Leighton)|Diamondback]] (Rachel Leighton) and [[Free Spirit]]. \n\nAfter Heike reportedly died in prison, Zemo had begun to reassemble his Masters when the Avengers (including Captain America) were seemingly slain by [[Onslaught (entity)|Onslaught]]. Deprived of his greatest foes and his guiding obsession, Zemo finally began to accept the fact that his father had destroyed himself, and that his own obsession with destroying Captain America was ultimately pointless. Shifting his focus from vengeance to power, Zemo led his Masters in masquerading as the [[Thunderbolts]], a new [[Glossary:S#super-hero|heroic]] super-team replacing the Avengers, accumulating public trust and resources until they were ready to strike. Zemo himself posed as the new Citizen V in a mockingly ironic nod to Heinrich's old victim. The deception lasted for months, until Zemo used a mind-influencing bio-modem to subjugate much of the planet. Most of the Thunderbolts had grown to like their roles as heroes, though, so they turned against Zemo and foiled his plot, despite his use of the Avengers and the [[Fantastic Four]] as mind-controlled pawns. Savagely beaten by his teammate [[Moonstone (Karla Sofen)|Moonstone]] (Karla Sofen), who resented Zemo for squandering the potential of their heroic pose, Helmut escaped with the reluctant aid of Thunderbolts member Atlas (Erik Josten), paying his debt to the Zemo family). \n\nPartnered for a time with the [[Glossary:R#robot|robotic]] [[Fixer (Paul Norbert Ebersol)|Techno]], Zemo repeatedly sought revenge on the Thunderbolts. However, he gradually realized that Moonstone was right about his having wasted the group's early potential, and decided it might be better to manipulate the world rather than openly rule it. Stalked by the new Citizen V ([[Riordan, Dallas|Dallas Riordan]]), who sought to destroy him for tainting the Citizen V legacy, Zemo escaped her but was later killed in his own headquarters by the government assassin [[Nomad (Jack Monroe)|Scourge]] (Jack Monroe).  \n\nHowever, Zemo's consciousness survived thanks to a failsafe device engineered by Techno, transplanting Zemo's consciousness into the comatose body of adventurer [[Citizen V (John Watkins III)|John Watkins III]], the previous Citizen V (true heir to the original). Posing as a revived Citizen V, Zemo reluctantly served the [[V-Battalion]], helping to foil [[Baron Strucker]]'s mind control conspiracy (of which Scourge had been an unwilling agent). When Strucker's daughter [[Strucker, Andrea|Andrea]] realized who Citizen V really was, Zemo slew her. For a time, Citizen V led a government-sponsored team of super-agents known as the [[Redeemers]]. When [[Graviton]] slaughtered the Redeemers, Citizen V teamed with the Thunderbolts to save the world from Graviton, though the battle hurled almost all the Thunderbolts into the [[Richards, Franklin|Franklin Richards]]-created [[Counter-Earth (Franklin Richards)|Counter-Earth]]. Zemo's disembodied consciousness went with them, now inhabiting the tech-pack of Fixer (Techno reborn in his original human form), then usurped the body of [[Iron Cross (Counter-Earth)|Counter-Earth's Helmut Zemo]] with the Fixer's aid.\n\nReborn in an unscarred facsimile of his original body, Zemo at first hoped to conquer Counter-Earth, but reluctantly joined the team's efforts to save the world rather than rule it, slowly coming to regard the business of world-saving as an intriguing and rewarding challenge. Already influenced by his stints with the Thunderbolts and the Redeemers, as well as his time within the brain of John Watkins III, Zemo had begun to show tiny sparks of nobility. He and the other Thunderbolts were soon regarded as beloved heroes by the people of Counter-Earth. \n\nZemo's Thunderbolts were thrown back to their native Earth while saving both worlds from an all-consuming void. They accomplished this with the aid of a new team of Thunderbolts that [[Hawkeye (Clint Barton)|Hawkeye]] and [[Songbird]] had organized on Earth in their absence, and the two factions of Thunderbolts soon assembled to decide their collective future. Though deeply suspicious of Zemo, Hawkeye was soon convinced that Zemo at least had the desire and potential to reform, and Hawkeye believed he could trust the other Thunderbolts to keep an eye on him. With this in mind, Hawkeye and several others left the group, and the remaining Thunderbolts reorganized under Zemo's leadership. Zemo even began to develop a romantic interest in Moonstone, though whether it was ever mutual is unclear. \n\nZemo's new Thunderbolts soon became internationally celebrated heroes. However, none of the team fully trusted Zemo, and the Avengers regarded him with even greater suspicion, planting [[Iron Man (Anthony Stark)|Tony Stark]] in the [[Cobalt Man (Ralph Roberts)|Cobalt Man]] suit as a spy within his group. When the Thunderbolts created the global energy-absorbing [[Project Leberator|Liberator project]], the Avengers uncovered evidence of a secret failsafe designed to steal its power, and assumed it was Zemo's handiwork. However, when the Avengers interfered in the Liberator's test run, the failsafe turned out to be created by Moonstone. He accidentally absorbed the Liberator energies and went on a power-mad rampage stopped by the combined efforts of both teams, though not before Zemo's face had been horribly scarred again - ironically, while shielding Captain America from Moonstone. In the end, Zemo's Thunderbolts broke up, Moonstone was left comatose, and Zemo absconded with Moonstone's vastly powerful alien gemstones. He has since worked behind the scenes to manipulate the new Thunderbolts without their knowledge, pursuing goals as yet unknown.",
        "categories": [
            "Cosmic",
            "International",
            "Villains",
            "People who used to be dead but aren't anymore",
            "Reformed Villains",
            "Thunderbolts"
        ]
    }
}