{
    "id": 1010895,
    "name": "Sharon Ventura",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/40/image_not_available",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010895",
    "comics": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010895/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/16003",
                "name": "Fantastic Five (2007) #1"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17451",
                "name": "Fantastic Five: The Final Doom (Trade Paperback)"
            }
        ],
        "returned": 2
    },
    "series": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010895/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2535",
                "name": "Fantastic Five (2007)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/3281",
                "name": "Fantastic Five: The Final Doom (2007)"
            }
        ],
        "returned": 2
    },
    "stories": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010895/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/32679",
                "name": "5XLS - 1 of 5",
                "type": "cover"
            }
        ],
        "returned": 1
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010895/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010895/sharon_ventura?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Ms._Marvel_%28Sharon_Ventura%29?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Sharon Ventura",
        "identity": "Publicly known",
        "aliases": "She-Thing, Shar, Shary, Double-M",
        "occupation": "Adventurer; former wrestler, stunt woman, professional stunt cyclist, circus performer and animal trainer, scuba diver",
        "place_of_birth": "Pullman, Washington",
        "groups": "Formerly [[Frightful Four]], [[Fantastic Four]], [[Unlimited Class Wrestling Federation]], [[Thunderiders]]",
        "citizenship": "U.S.A.",
        "education": "Military Academy, expelled",
        "relatives": "Jack Ventura (father, deceased), unidentified mother (deceased)",
        "height": "(Sharon) 5'8\"; (\"She-Thing\") 6'0\"",
        "weight": "(Sharon) 135 lbs.; (\"She-Thing\") 340 lbs.",
        "eyes": "Blue",
        "hair": "(Sharon) Red; (\"She-Thing\") None",
        "powers": "Sharon Ventura's natural abilities were boosted to their highest levels, and she was also granted [[Glossary:S#superhuman|superhuman]] strength and durability through radiation treatments. When she was exposed to cosmic rays and transformed into a She-Thing, her strength and durability were increased to the levels of the [[Thing (Benjamin Grimm)|Thing]] before he was mutated into his spiky-hided version. In her She-Thing form, Sharon had increased resistance to sensory and temperature extremes.",
        "abilities": "Sharon Ventura is an accomplished gymnast, martial artist, a skilled wrestler, an expert motorcycle stunt rider, mountain climber, scuba and sky diver, and stunt woman",
        "weapons": "None",
        "paraphernalia": "None",
        "debut": "Thing #26 (Sharon Ventura, on poster), Thing #27 (as Sharon Ventura, 1985), Thing #35 (1986, as Ms. Marvel)",
        "origin": "Thing #35 (1986)",
        "significant_issues": "",
        "main_image": "Ms_ Marvel.jpg",
        "bio_text": "<br>",
        "bio": "<br>\n\n== Unresolved Issues ==\n\nRaised solely by her father, a strict military man who demanded the absolute best from his daughter, Sharon Ventura had a hard time pleasing him and his impossibly high standards. She was expelled from military school for not turning her roommate in for cheating, and her father would not tolerate her anymore. The two became estranged for nearly a year, and her father died during their time apart. Sharon felt an extreme amount of guilt over his passing, but she was determined to show him that she could be the best at whatever she set out to do without all his rules and regulations. She spent the next several years of her life still looking for approval from her father by taking on incredible challenges, and dangerous physically active professions, hoping all the while that if her father were alive he would say he was proud of her. It was a moment she knew would never come.\n\n== Stunt Rider ==\n\n[[Image:Ms_Marvel_Thunder_Riders.jpg|left|155px|thumb|Sharon Ventura as a Thunderider]]After temporarily working at a circus, Sharon joined up with the professional motorcycle stunt team, the [[Thunderiders]]. When the [[Thing (Benjamin Grimm)|Thing]] showed up looking for her, as Sharon was a physical twin to an \"ideal woman\" he fell in love with on a distant planet called [[Battleworld]], he made a play to join the team. The Thunderiders had to decide between Thing and another rider called the Champ, and Sharon was the final vote. She thought a personality of his dimensions would be the perfect choice to replace her in the group.  Leaving the Thing and the Thunderiders behind, Sharon went on to chase other pursuits. \n\n== Rise to Power ==\n\nSharon found out Thing left the Thunderiders soon after she did to join the [[Unlimited Class Wrestling Federation]], and she secretly attended his matches. It wasn’t until he had a match against the [[Maker|Beyonder]] that she showed herself, stopping him from killing the being he blamed for all his recent problems; a choice he would have regretted for the rest of his life. She took the Thing on a vacation to watch her as a stunt woman on the set of [[Devil Dinosaur]], the movie, and the two of them grew close, but Sharon only wanted a friendship where he wanted more. Still, she was by his side every chance she got including a time when the female brawlers of the U.C.W.F., the Grapplers, thought he was responsible for murdering one of their members. Sharon tried to help Thing against the super powered women, and her feisty attitude got her noticed by Auntie Freeze, caretaker to the U.C.W.F.'s women wrestlers. Auntie gave Sharon the name of a man called the [[Power Broker]] and told her that he could make her strong enough to join the Grapplers and the U.C.W.F. When Sharon told Thing about the Power Broker he told Sharon not to go, fearful for her safety. Sharon ignored his advice and again resisted his romantic advances.\n\n== Pawns of the Power Broker ==\n\nSharon decided to see the Power Broker and be made physically better, but she was attacked outside his offices by three thugs. Sharon was almost able to handle things on her own, but when Lieutenant Michael Lynch showed up, he finished what she started and chased the goons away. Continuing on her chosen path, Sharon agreed to the Power Broker’s terms and completed her phase one radiation treatments given by [[Malus, Karl|Dr. Karl Malus]]. When it was time for phase two's chemical injections (which would have addicted her to a drug the Power Broker supplied, thus placing her under his control, as he had previously done to most of the U.C.W.F. wrestlers), Sharon changed her mind and used her new found strength to break free from her restraints. She fled throughout the compound looking for an escape, and if not for the timely arrival of the Thing and Lt. Lynch, she might have been recaptured. Thing stayed behind to hold off the Power Broker’s men while Sharon and Lynch made their way back to Auntie Freeze’s hotel room. Auntie made a costume for Sharon resembling the costume of Ms. Marvel, so that is the name Sharon adopted for herself, but soon Auntie and the Grapplers turned on Sharon when the Power Broker put a price on her head. The Thing found out from [[Demolition Man|Demolition Dunphy]], another U.C.W.F. wrestler who got his powers from the Power Broker, that Sharon was in big trouble, and the Thing had to save her one more time.\n\n== Cat Fight ==\n\n[[Image:Ms_Marvel_She-Hulk_2.jpg|center|350px|thumb|Ms. Marvel versus She-Hulk]]\nAfter she was rescued from the Power Broker, Sharon noticed Thing was beginning to mutate further during a wrestling match and took him to the hospital. The [[She-Hulk]] eventually found out about Thing's recent problems and went to help, but Sharon tried to stop her, knowing how bitter he felt towards the [[Fantastic Four]] at this time in his life. Even though she had super strength, Ms. Marvel was no match for the She-Hulk, but her athletic prowess and wrestling skills kept her from being beaten. The two women decided to call a truce, but it was too late to help Thing as he ran away from the hospital only wanting to be left alone. Sharon felt guilty thinking it was partly her fault he left like that.\n\n== Emotional Scars ==\n\nSharon and her new boyfriend, Lt. Lynch, had set out to destroy the Power Broker for getting so many people addicted to his drug-related experiments which she had been lucky to avoid all together, but Lynch sold her out. Again a prisoner of the Power Broker's mad scientist, Karl Malus, Sharon was not only a victim to his experiments in an attempt to take her powers away, but she became a victim to his henchmen who subjected her to unspeakable tortures while in captivity. However, [[Captain America (Steve Rogers)|Captain America]] soon rescued her, and together they brought the Power Broker to justice. Even though she accomplished what she set out to do, the nightmares of her abuse would stay with her forever. \n\n== Man-Hater ==\n\nTraveling to New York, Ms. Marvel happened to be in the right place at the right time to save the Fantastic Four from being killed at the hands of [[Diablo (Esteban De Ablo)|Diablo]] and his Elementals. With her new hatred of men, she almost killed the villain, but Thing stopped her and offered her a place on his team. Diablo used a potion to heal himself, and turned the hospital he was brought to into a castle full of deathtraps to slay the Fantastic Four. With [[Mister Fantastic]] and the [[Invisible Woman]] on sabbatical, it was up to the Thing’s new team including Ms. Marvel, [[Crystal]], and the [[Human Torch (Johnny Storm)|Human Torch]] to take care of business. The Fantastic Four held their own, but it was Ms. Marvel who defeated the villain once again. \n\n== Too Much Television is Bad for You ==\n\nThe team's next threat was a living television image named [[Fasaud]], and this new villain would be indirectly responsible for a new change in Sharon Ventura's life. Traveling into space to destroy a satellite necessary for Fasaud's teleportation abilities, the Thing and Ms. Marvel used a shuttle that was damaged by an attack from their new foe. Rocketing uncontrollably toward Earth, the shuttle was bombarded with the same cosmic rays that gave the Fantastic Four their powers and upon crash landing in [[Wakanda]], both Ms. Marvel and the Thing mutated. She now resembled the Thing when he first mutated so many years ago, and she was horrified by her transformation. The couple was attacked by a [[Throb|Trans-Human Robot]], and Ms. Marvel tried to get it to kill her, but the Thing wouldn't allow that to happen. The [[Black Panther (T'Challa)|Black Panther]] showed up and shut the android down, stopping the fight and preventing further injury to any of the combatants.\n\n== Facing Doom ==\n\n[[Doctor Doom (Victor von Doom)|Doctor Doom]] was also in Wakanda after being expelled from his country of [[Latveria]] by the imposter [[Doctor Doom (Kristoff Vernard)|Kristoff Vernard]], and he offered Ms. Marvel a chance to join him in destroying Reed Richards and the Fantastic Four in exchange for curing her, but she violently refused. Returning home, the Fantastic Four soon found themselves at odds with Doom, but with the combined help of the Black Panther and [[X-Factor]], Doom was defeated and Ms. Marvel accepted her new form.\n\n== Fierce Competition ==\n\n[[Image:Ms_Marvel_She-Thing.jpg|left|150px|thumb|She-Thing versus Titania]] Standing side by side with the Four, she found herself battling such menaces as the [[Frightful Four]], [[Master Pandemonium]], [[Graviton]], and [[Kang]]. She’s been to distant planets, subterranean lands, and even to the [[Negative Zone]]. Sharon rethought her position about starting a relationship with the Thing now that they had similar forms, and they finally found love. Eventually, Ms. Marvel became the only “Thing” on the team, when the original was transformed back to his human self, Ben Grimm. Sharon went to Dr. Doom for a cure but Ben followed, and ironically she was cured while Ben was again transformed into a Thing.  Sharon remained with Ben as a normal woman for some time until his old girlfriend, [[Masters, Alicia|Alicia Masters]], returned and attempted to rekindle that relationship. Uncomfortable, Sharon left. \n\n== Everything Comes With a Price ==\n\nDoom contacted Sharon, demanding she serve him in exchange for the cure she'd been given, and she agreed, hoping to convince Doom to cure Ben as well. She was sent to spy on the Fantastic Four, and the trusting heroes welcomed her once more into their lives. Doom and the Four inevitably fought, and during a key moment in battle with the Fantastic Four, he commanded Sharon to turn on the team who treated her as family. Sharon refused and attacked Doom instead, and he swore revenge before meeting defeat. With her secret out in the open Ben had a hard time forgiving her, but when Sharon went missing, his feelings for her compelled him to find her. He discovered her in an alley; her will to live left her again, because Doom mutated her into a grotesque form more monstrous than that of the She-Thing. Sharon decided to end her hopeless existence by throwing herself onto the third rail of the subway tracks, electrocuting herself, but her new hide was tough enough for the jolt to only render her unconscious. Mister Fantastic placed Sharon in suspended animation until he could find a way to cure her. When Reed was presumed killed not long after, the [[Wizard]] freed Sharon and recruited the confused she-brute into his new Frightful Four.  In her second fight against the Fantastic Four, [[Wingfoot, Wyatt|Wyatt Wingfoot]] talked her back to her senses and she quit both groups, staying with Wyatt on his Keewazi reservation while she came to grips with who and what she was inside and out.\n\n== Tumultuous Life ==\n\n[[Image:Ms_Marvel_CW.jpg|right|205px|thumb|Skrull impostor]]Under undetermined circumstances, Sharon eventually evolved back into her rocky She-Thing form and even attended a \"girl's night out\" with the Invisible Woman and She-Hulk.  In this form, she amicably attended Ben Grimm's bar mitzvah on the thirteenth anniversary of his becoming a Thing. Years later, a human-looking Sharon Ventura, was seen with a group of individuals who refused to register with the [[Civil War|Superhuman Registration Act]] right before [[Iron Man (Anthony Stark)|Iron Man]] and [[S.H.I.E.L.D.]] raided their underground base. At a later date, this individual was exposed as a [[Skrulls|Skrull]] impostor and killed. After the [[Secret Invasion|war with the Skrulls]] ended, Sharon was returned to Earth.",
        "categories": [
            "Heroes",
            "Women",
            "Fantastic Four",
            "Civil War"
        ]
    }
}