{
    "id": 1010952,
    "name": "Mysterio (Francis Klum)",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/40/image_not_available",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010952",
    "comics": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010952/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/5083",
                "name": "Friendly Neighborhood Spider-Man (2005) #12"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/6163",
                "name": "Friendly Neighborhood Spider-Man Vol. 2: Mystery Date (Trade Paperback)"
            }
        ],
        "returned": 2
    },
    "series": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010952/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/877",
                "name": "Friendly Neighborhood Spider-Man (2005 - 2007)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1895",
                "name": "Friendly Neighborhood Spider-Man Vol. 2: Mystery Date (2007)"
            }
        ],
        "returned": 2
    },
    "stories": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010952/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/4676",
                "name": "2 of 5",
                "type": "cover"
            }
        ],
        "returned": 1
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010952/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010952/mysterio_francis_klum?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Mysterio_%28Francis_Klum%29?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Francis Klum",
        "aliases": "None",
        "identity": "Secret",
        "occupation": "Professional criminal; former drug dealer",
        "citizenship": "U.S.A",
        "place_of_birth": "Red Bank, New Jersey",
        "relatives": "[[Mr. Brownstone|Garrison Klum]] (Mr. Brownstone, brother, deceased), unidentified mother (deceased)",
        "groups": "None",
        "education": "High school graduate",
        "height": "5'9\"",
        "weight": "150 lbs.",
        "eyes": "Brown",
        "hair": "Brown",
        "powers": "Francis is a teleporter and with limited telepathic abilities. Use of his teleportation abilities may require a rest after a long jump.",
        "abilities": "Francis has quite extensive knowledge of different drugs and poisons.",
        "weapons": "None",
        "paraphernalia": "Francis wears the original Mysterio costume containing boots with chemical smoke ejectors to produce a concealing mist, magnetic plate springs allowing him to leap great heights, an acid spray in his gloves, enabling him to dissolve Spider-Man's webbing, and a one-way helmet with a built-in sonar device that jammed Spider-Man's spider-sense and allowed Mysterio to see through his mist. It also has \"psychedelic power\" to his helmet, knock-out gas, an electrically charged cloak, hypnogens in his cloaking mist, and electric bolts from his gloves, tranquilizer dart gun, an electro-magnetic disrupter beam, automatons, holographic projectors, and a stolen Digital Imagery Transmission chip.",
        "debut": "(as Francis) Spider-Man & Black Cat: The Evil That Men Do #2 (2002), (as Mysterio) Friendly Neighborhood Spider-Man #11 (2006)",
        "origin": "Spider-Man & Black Cat: The Evil That Men Do #4 (2006)",
        "significant_issues": "killed his brother (Spider-Man & Black Cat: The Evil That Men Do #3, 2006); fought Spider-Man and Daniel Berkhart; stabbed in the chest by Miss Arrow (Friendly Neighborhood Spider-Man #13, 2006);",
        "main_image": "Mysterio (Francis Klum) Head.jpg",
        "bio_text": "Francis was born in a Jewish family. At school, he didn't really have any friends and his brother [[Mr. Brownstone|Garrison]] apparently also abused him sexually. His abilities manifested for the first time just after his mother had died (killed by his brother, who also had teleport abilities, though much weaker than his little brother). His brother soon found out about Francis' powers and forced him to use them for his own benefit. A couple of years later Garrison had started to build his illegal drug business and made good use of his brother's freshly discovered telepathic powers by making him prompt people to use his drugs. They were popular among the high-class citizens' children, because their drug delivering method using teleportation didn't leave any signs of drug use. His brother soon adopted the alias of Mr. Brownstone and gained a reputation, high place clients and a lot of money. He also made significant connections to underground high players like the [[Kingpin]].",
        "bio": "Francis was born in a Jewish family. At school, he didn't really have any friends and his brother [[Mr. Brownstone|Garrison]] apparently also abused him sexually. His abilities manifested for the first time just after his mother had died (killed by his brother, who also had teleport abilities, though much weaker than his little brother). His brother soon found out about Francis' powers and forced him to use them for his own benefit. A couple of years later Garrison had started to build his illegal drug business and made good use of his brother's freshly discovered telepathic powers by making him prompt people to use his drugs. They were popular among the high-class citizens' children, because their drug delivering method using teleportation didn't leave any signs of drug use. His brother soon adopted the alias of Mr. Brownstone and gained a reputation, high place clients and a lot of money. He also made significant connections to underground high players like the [[Kingpin]].\n\nFive years later, they ran a legitimate organization that they used as a front for their illegal drug business. Soon after this, Francis started to despise how his brother used his power and the last straw was when his brother tried to rape [[Black Cat|Felicia Hardy]] (a.k.a. Black Cat). Francis killed his brother by teleporting himself inside his body. Police later arrested Felicia accusing her of the murder, but Francis soon abducted her from jail and transported them to the top of Queensboro Bridge. After Francis revealed his past to Felicia and she had almost persuaded him to turn himself in [[Spider-Man (Peter Parker)|Spider-Man]] and [[Daredevil (Matthew Murdock)|Daredevil]] arrived. The scene stirred up Peter's memories of [[Stacy, Gwen|Gwen Stacy]]'s death and he attacked Francis, but Francis managed to get away from him after a short struggle. Francis then accused Felicia of betraying him and tried to kill her. Spider-Man managed to save her by jamming Francis' gun with his web fluid and it exploded in Francis hand knocking him off the bridge. Both Peter and Felicia tried to save him, but he teleported away just before they got hold of him. He damaged his face so badly that the doctors couldn’t do anything about it and they had to amputate his left leg. When he was still recovering from his injuries, he bought a warehouse full of old equipments, weapons and one of [[Mysterio (Quentin Beck)|Quentin Beck]]'s old Mysterio costumes from Kingpin. He swears to avenge his brothers' death that he now blamed on Spider-Man and Black Cat.\n\nAfter he had healed from his injuries, he decided to go after Spider-Man first. He surrounded the school where Peter worked with knockout gas and started to terrorize people caught inside. He soon realized that he wasn't the only Mysterio at the scene and briefly met his costumes original owner Quentin Beck himself. He also later fought [[Mysterio (Daniel Berkhart)|Daniel Berkhart]] and Spider-Man, but didn't manage to beat either one of them. After Spider-Man took care of Daniel, Francis tried to make Spider-Man kill himself with a knife, but [[Thompson, Flash|Flash Thompson]] intervened and plunged the knife into Francis' shoulder. Francis then revealed to the duo that he had planted a bomb in the building. As Peter and Flash, left to defuse the bomb Francis tried to slip away, but ran into [[Arrow|Miss Arrow]] the schools new nurse. He was going to use Miss Arrow as a hostage, but as he tried to snatch her. He suddenly felt something pierce his chest and saw that Miss Arrow had hit him with a stinger much like Spider-Man's own stingers. Francis barely managed to teleport away before she hit him again.",
        "categories": [
            "Spider-Man",
            "Villains"
        ]
    }
}