{
    "id": 1010718,
    "name": "Asgardian",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/40/image_not_available",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010718",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010718/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010718/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010718/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010718/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010718/asgardian?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Lorelei_%28Asgardian%29?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "identity": "Secret on Earth, Public on Asgard",
        "real_name": "Lorelei",
        "occupation": "Sorceress, Seductress",
        "place_of_birth": "[[Asgard]]",
        "groups": "[[Asgardians]]",
        "citizenship": "Asgard",
        "education": "Sorcery",
        "aliases": "Melodi, Icequeen",
        "relatives": "Amora, ([[Enchantress]], sister)",
        "height": "5' 5\"",
        "weight": "320 lbs",
        "eyes": "Blue-green",
        "hair": "Reddish Blonde",
        "abilities": "Lorelei's great beauty and seductive manner enable her to persuade virtually any male god or mortal to do whatever she wants.   Lorelei has some knowledge of sorcery, mostly pertaining to love charms and potions.",
        "powers": "Lorelei possesses the conventional attributes of an Asgardian woman. Like all Asgardians, she is extremely long-lived, aging at an extremely slow rate upon reaching adulthood, superhumanly strong, immune to all Earth diseases, and resistant to conventional injury.  Asgardian flesh and bone is about three times denser than similar human tissue, contributing to the gods' superhuman strength and weight. Lorelei's Asgardian metabolism gives her superhuman endurance at all physical activities. Lorelei may have the potential for having mystical powers like her sister, but she has chosen not develop it.",
        "debut": "Thor #337",
        "origin": "",
        "significant_issues": "Thor #337-350, 354-355, 357-359, 363, 367-368, 383, 398-400, 402, 437-441, 476, 485-488, Journey Into Mystery #509-511, Defenders #2-4",
        "main_image": "Lorelei Head.jpg",
        "bio_text": "Lorelei is the younger sister of the sorceress, Amora the Enchantress. The two sisters share an interest in using their beauty and wiles to dominate any male that either desires. However, unlike Amora, Lorelei has had no interest in mastering sorcery apart from learning certain skills to aid her in her amatory pursuits. Both sisters are natives of Asgard.",
        "bio": "Lorelei is the younger sister of the sorceress, Amora the Enchantress. The two sisters share an interest in using their beauty and wiles to dominate any male that either desires. However, unlike Amora, Lorelei has had no interest in mastering sorcery apart from learning certain skills to aid her in her amatory pursuits. Both sisters are natives of Asgard.\n\n[[Loki]], the Asgardian god of evil, chose Lorelei to seduce his longtime enemy, his stepbrother [[Thor (Thor Odinson)|Thor]], god of thunder. Lorelei, who was strongly physically attracted to Thor, needed no persuasion to agree to Loki's scheme. Lorelei prepared a love potion which, if Thor drank it, would cause him to fall madly in love with the first woman he saw. Loki hoped that Thor's passion for Lorelei would distract him from interfering in Loki's schemes for gaining power. Thor had not seen Lorelei since she was a child, and so would not recognize the adult Lorelei. \n\nShe went to New York City on Earth, where she claimed to be a mortal human being named Melodi. There she confronted Thor's old enemy, the dragon [[Fafnir]], who used his hypnotic abilities to overpower her. Fafnir took her captive and used her as bait to lure Thor into a trap at the construction site where he worked in his secret identity of Sigurd Jarlson. As Jarlson Thor saved Lorelei from death, and then fought the dragon in his godly identity. Hence Thor and Lorelei first met in their false identities as the humans Jarlson and Melodi. Jarlson and Melodi became friends, and Melodi was clearly attempting to deepen the relationship into a romance. Circumstances, however, prevented her from getting Jarlson to drink the golden mead she had prepared using the love potion. Lorelei was then kidnapped by Thor's foe [[Malekith]] the Accursed, leader of the Dark Elves. Malekith used sorcery to cause a stock of wood to take on the appearance of Melodi, and this magically animated false Melodi gave Jarlson the mead to drink. Under the mead's spell, Thor fell uncontrollably in love with Melodi (since the first \"woman\" he saw bore her appearance). Malekith then revealed to Thor that the real Melodi was his prisoner. Thor, enraged, rescued Melodi from the Dark Elves. Soon afterward the demonic [[Surtur]] began his war against Asgard. Amora was infuriated by Lorelei's refusal to join in fighting Surtur's demonic hordes, and decided to take vengeance on her. [[Odin]], monarch of Asgard, vanished along with Surtur at the war's end. \n\nLoki then planned to use Lorelei to influence Thor to throw his support behind Loki's bid to become Asgard's new ruler. Loki gave Lorelei the elixir of Lofn, which, when Thor inhaled its vapors, would make Thor fall so deeply in love with her that he would do whatever she asked. In effect, Thor would become Lorelei's slave. Loki instructed Lorelei to then persuade Thor to support Loki's bid for the throne. Lorelei was tiring of Thor, but agreed to Loki's scheme since she planned to have Thor become monarch himself, and to make her his queen. She subjected Thor to the vapors of the Elixir of Lofn, and he fell under her control. To take revenge on Lorelei, the Enchantress cast a spell on Odin's scepter of power, knowing that Loki would pick it up, as indeed he did. Due to the spell, when Lorelei next saw Loki, she fell madly in love with him. \n\nThe Enchantress believed that loving the heartless Loki would eventually destroy Lorelei emotionally. Loki naturally responded to Lorelei's new interest in him. Thor's friend [[Heimdall]] realized that Thor was under Lorelei's control, and devised a plan to save him. He had the Enchantress urge Thor to visit Loki when she knew that Loki and Lorelei were in each other's arms. Thor's rage at seeing them together made him realize he himself was under a spell. He forced Loki to release him from the spell on pain of death, and left the two of them together. As the Enchantress predicted, Loki has since grown tired of Lorelei.\n\nIn a battle between [[Seth]] and [[Balder]], Lorelei was interposed among them and the servants of Seth to save Balder, shortly after, she died for the injuries. Further on, Lorelei returned to life by the power of Seth to face the Asgardians that had lost their godly status and their powers. Amora killed Lorelei to free her from Seth's control. In undisclosed circumstances, Lorelei returned to life. Using the alias Ice Queen and allied with [[Pluto]], she created a new Valkyrie, but she and Pluto were defeated by the [[Defenders]]. She appears to be the only survivor of Asgard due to her absence from Asgard during the Ragnarok that destroyed the Asgardian world. Her current location is unknown.",
        "categories": [
            "Women",
            "Villains",
            "Gods",
            "Magic",
            "Thor"
        ]
    }
}