{
    "id": 1010790,
    "name": "Scorpion (Carmilla Black)",
    "description": "Carmilla Black is a genetically engineered human, created by Advanced Idea Mechanics (A.I.M.).",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/6/40/4c0037366fae7",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010790",
    "comics": {
        "available": 5,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010790/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/1880",
                "name": "Amazing Fantasy (2004) #7"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/2083",
                "name": "Amazing Fantasy (2004) #9"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/2515",
                "name": "Incredible Hulk (1999) #87"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/15925",
                "name": "Incredible Hulk (1999) #108"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/3007",
                "name": "Scorpion: Poison Tomorrow (Digest)"
            }
        ],
        "returned": 5
    },
    "series": {
        "available": 3,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010790/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/769",
                "name": "Amazing Fantasy (2004 - 2006)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/465",
                "name": "Incredible Hulk (1999 - 2008)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1450",
                "name": "Scorpion: Poison Tomorrow (2005)"
            }
        ],
        "returned": 3
    },
    "stories": {
        "available": 4,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010790/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/1252",
                "name": "1 of 1 -",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/3640",
                "name": "1 of 6 - Poison Tomorrow",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/3644",
                "name": "3 of 6 - Poison Tomorrow",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/32516",
                "name": "World War Hulk 3 of 4; WWH SLUG",
                "type": "cover"
            }
        ],
        "returned": 4
    },
    "events": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010790/events",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/events/277",
                "name": "World War Hulk"
            }
        ],
        "returned": 1
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010790/scorpion_carmilla_black?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Scorpion_%28Carmilla_Black%29?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Thasanee Rappuccini; legally changed to Carmilla Black",
        "identity": "Secret",
        "occupation": "Unofficial freelance operative for S.H.I.E.L.D.; former runaway and student",
        "place_of_birth": "Lowtown, Madripoor",
        "groups": "[[Hydra]], [[A.I.M.]]; formerly [[S.H.I.E.L.D.]], the “Wakers”",
        "citizenship": "Kingdom of Madripoor and U.S.A. (juvenile criminal record sealed)",
        "education": "High school educated (incomplete)",
        "aliases": "\"Carm\", \"Greenie\"",
        "relatives": "Monica Rappucini (mother), Tim and Julia Black (adoptive parents, deceased)",
        "height": "5'6\"",
        "weight": "120 lbs",
        "eyes": "Blue",
        "hair": "Green (formerly black)",
        "powers": "Scorpion's body was genetically engineered by [[A.I.M.]] to be immune to all known toxic effects of biological, chemical and nuclear weapons. An unexpected mutation has caused a gland to have grown inside Scorpion’s left arm - her \"Stinger\" -  that naturally generates a powerful toxin that can stun or even kill an adult human when released through her fingertips. She can control the concentration of toxins, killing her target outright or simply making them ill. However, she can never turn off the ability. Carmilla's stinger takes effort to control, and even when she is subduing its affects to the best of her ability, being in close proximity to the arm for more than a week or two can sicken most people. Numerous side effects from this ability abound; for example, Carmilla’s body will spontaneously grow nictating membranes over her eyes to allow her to see normally in the middle of a tear gas attack.",
        "abilities": "Carmilla has apparently developed a formidable set of fighting and acrobatic skills in her life as a runaway. Most likely she has been traded in physical combat as well as other aspects by [[S.H.I.E.L.D.]] Scorpion has picked up a wide range of criminal skills, including the fundamentals of breaking and entering.",
        "paraphernalia": "The S.H.I.E.L.D. Directorate of Technology has outfitted Scorpion with a synthetic polymer gauntlet that can completely cover her left arm, protecting others from her powers’ side effects. Outfitted with a Stark Enterprises Neural Interface Link, Scorpion can mentally retract the gauntlet from her hand under one second to execute immediate stinging attacks. Scorpion can also retract both ends of the gauntlet into an innocuous-looking (if large and bulky) bracelet she can wear inconspicuously with civilian clothes. In any of its three states (fully sheathed, hand unsheathed, bracelet), the gauntlet boasts a pinhole video camera, a GPS tracking system and a 3 GB hard drive for storing A/V data. S.H.I.E.L.D. technologists have designed the gauntlet without a single metal part (substituting advanced superhard plastics throughout), rendering it invisible to metal detectors. Research and Development has suggested future versions may even allow her to convert her stinger into a formidable ranged attack.",
        "debut": "Amazing Fantasy #7 (2005)",
        "origin": "Amazing Fantasy #7 (2005)",
        "significant_issues": "",
        "main_image": "Scorpion.jpg",
        "bio_text": "Carmilla Black is a genetically engineered human, created by Advanced Idea Mechanics  ([[A.I.M.]]). Though A.I.M. Scientist Supreme Monica Rapuccini considers her a daughter, she grew up with adoptive parents, who were also agents of A.I.M., never knowing of her or their involvement with the organization. Carmilla considered herself a normal teen until her latent powers manifested on the night of her prom. Her mutated arm, which she has taken to calling her stinger, discharged a highly concentrated dosage of toxins, killing her boyfriend. Scared of the social and legal backlash she would suffer, she fled her small home town. For years, She lived on the streets, surviving however she could, constantly roaming from place to place. When she learned her adoptive parents had been murdered, she returned home.",
        "bio": "Carmilla Black is a genetically engineered human, created by Advanced Idea Mechanics  ([[A.I.M.]]). Though A.I.M. Scientist Supreme Monica Rapuccini considers her a daughter, she grew up with adoptive parents, who were also agents of A.I.M., never knowing of her or their involvement with the organization. Carmilla considered herself a normal teen until her latent powers manifested on the night of her prom. Her mutated arm, which she has taken to calling her stinger, discharged a highly concentrated dosage of toxins, killing her boyfriend. Scared of the social and legal backlash she would suffer, she fled her small home town. For years, She lived on the streets, surviving however she could, constantly roaming from place to place. When she learned her adoptive parents had been murdered, she returned home.\n\nShe came to suspect that [[S.H.I.E.L.D.]] may have had her parents killed, and found a birth certificate suggesting she was a princess of the Madripoor Royal Family. After she was captured by S.H.I.E.L.D., she learned that her parents were actually A.I.M. agents, and she herself became an agent of S.H.I.E.L.D. under the code name Scorpion.\n\nFollowing information leading to her biological mother, Carmilla learned her mother was 'Scientist Supreme' of A.I.M., Monica Rapuccini. Scorpion infiltrated the organization, learning that she was engineered to survive disease and even nuclear fallout, and that there were others like her.\n\nThese teens were designed to survive any situation they may encounter, from a global plague intended to collapse industrial society to nuclear fallout. While the other teens were chemically-induced to be completely loyal to A.I.M., Scorpion discovered the mutation which gave her stinger also made her immune. Carmilla lost her cover in the organization when she stopped an assassination attempt on the Vice President.\n\nRecently, Carmilla and her S.H.I.E.L.D. handler, agent Derek Khanata, had been sent to New York under orders to track down and capture the Uni-Power before it could fall into the hands of the terrorist organization A.I.M., watching over the spot where a [[Captain Universe]] empowered [[Daredevil (Matthew Murdock)|Daredevil]] fought four Class Three A.I.M. Commandos. Scorpion and Khanata waited to see if A.I.M. would find anything. A group of kids interrupted the A.I.M. Agents work and were nearly killed until [[X-23]] stepped in. The A.I.M. Commandos who fought Daredevil before began to assault X-23 when she became Captain Universe. Scorpion entered the fray helped X-23/Captain Universe defeat the Commandos. Afterwards X-23 began to search for a hidden base. Scorpion joined her so that she could obtain and capture the Uni-Power and get the information on it from A.I.M.; however, X-23 convinced Scorpion to see the light and let the Uni-Power go. X-23 took the Uni-Power to a safe hiding place while Scorpion captured an A.I.M. scientist back to S.H.I.E.L.D. for interrogation.\n\nThere exists a possibility that Bruce Banner (the [[Hulk]]) is her biological father, but this speculation has not been confirmed.",
        "categories": [
            "Heroes",
            "Women",
            "Initiative"
        ]
    }
}