{
    "id": 1010857,
    "name": "Timeslip",
    "description": "As a young child, Rina Patel experienced visions of her future, though she eventually learned to control this, triggering visions of specific times, and she realized she was swapping her consciousness across time.",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/40/image_not_available",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010857",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010857/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010857/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010857/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010857/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010857/timeslip?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Timeslip?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "blurb": "",
        "real_name": "Rina Patel",
        "aliases": "None",
        "identity": "Publicly known",
        "occupation": "College student",
        "citizenship": "USA",
        "place_of_birth": "Palo Alto, California",
        "relatives": "Unidentified mother (deceased)",
        "groups": "Formerly [[New Warriors]]",
        "education": "Studied history at U.S.C., formerly at Hunter College",
        "height": "5'4\"",
        "weight": "100 lbs.",
        "eyes": "Blue",
        "hair": "Black",
        "powers": "",
        "abilities": "",
        "weapons": "",
        "paraphernalia": "",
        "debut": "New Warriors #59 (1995)",
        "origin": "",
        "significant_issues": "[[OHOTMU:Bibliography-AZ11#Timeslip|See Handbook Bibliography]]",
        "main_image": "Timeslip.jpg",
        "bio_text": "As a young child, Rina Patel experienced visions of her future. She eventually learned to control this, triggering visions of specific times. She realized she was swapping her consciousness across time — if she sent her fifteen year old mind back into her ten year old self, then the mind of her ten year old self would be displaced into the fifteen year old Rina Patel. Though this swap initially took extreme focus (the more she concentrated, the more accurate she was on the time destination), it eased as she matured.",
        "bio": "As a young child, Rina Patel experienced visions of her future. She eventually learned to control this, triggering visions of specific times. She realized she was swapping her consciousness across time — if she sent her fifteen year old mind back into her ten year old self, then the mind of her ten year old self would be displaced into the fifteen year old Rina Patel. Though this swap initially took extreme focus (the more she concentrated, the more accurate she was on the time destination), it eased as she matured.\n\nIn the year 2092, scientist Kyle Grobe altered the past to recreate himself as the armored conqueror [[Advent]]. To oppose this, his son Darrion Grobe duplicated the New Warrior Speedball, who was then trapped outside the timestream in a kinetic dimension. Darrion submerged his own consciousness within the Speedball duplicate, programmed to awaken at the proper time and disrupt his father's plans, and he went back in time to Earth's modern era. The Warriors unwittingly accepted the Speedball impostor as their teammate while Darrion waited beneath Speedball's unconscious. These time-alterations would lead to Rina's joining the New Warriors.\n\nNow a freshman history student at New York's Hunter College, Rina had a vision of the future, where she found herself in costume with the New Warriors. After another vision showed future teammate Speedball (secretly Darrion Grobe) being killed, Rina contacted him to warn him, but Speedball brushed her off. Approaching New Warriors member Hindsight (Carlton LaFroyge), Rina convinced him of her sincerity when she used her powers in a new way to slow time around her and knock Carlton out of the path of an oncoming truck. LaFroyge brought her to the New Warriors' Crash Pad headquarters and provided Rina with a superhero costume, and she adopted the alias Timeslip. After she recognized Alex Power's smartship Friday from one of her visions, the Warriors finally became convinced she was legitimate.\n\nWhen the time-traveling [[Guardians of the Galaxy]] claimed one of the Warriors was causing geometrically increasing stress to the multiversal time continuum, they identified Speedball as the culprit, but Darrion Grobe acted from within Speedball's unconscious to create a temporal inversion so that the Guardians were never there. Determined to prevent Advent's disastrous alterations of the timeline, the Sphinx (the merged Anath-Na Mut and Meryet Karim) then appeared and slew Speedball in front of Rina in order to retroactively cause the earlier timestream changes which led to Rina's Warriors membership; when the dying Darrion sent a portion of his memories into Rina, she realized the truth about Speedball, Darrion and Advent, With Speedball dead, Advent appeared and apparently killed the remaining Warriors, actually transporting them to 2092. Rina witnessed the detonation of Advent's nuclear weapon in New York City; slowing time, she fled the explosion but proved unable to outrun it, Desperate, she sent her mind back in time and fought Advent herself while sending [[Spider-Man]] to stop the bomb. The time-twisting effects of Advent, his son and the Sphinx allowed Rina to alter time, and allowed her to defeat Advent when her time powers shorted out his armor. Rina used her powers to reclaim the New Warriors from the future and rescue the original Speedball.\n\nTimeslip joined the New Warriors, aiding the team against [[Hydra]]'s [[Pearl Sect]] and the [[Dire Wraith]] [[Volx]], whose depowering neo-neutralizer temporarily negated Rina's own powers. Rina eventually moved to Los Angeles to continue her schooling at U.S.C., but when the public turned against the Warriors, Carlton LaFroyge revealed the civilian identities of Rina and several other ex-Warriors. A mob attacked her in Los Angeles, but she escaped.",
        "categories": [
            "International",
            "Women"
        ]
    }
}