{
    "id": 1010884,
    "name": "Wrecker",
    "description": "Dirk Garthwaite, the son of a construction worker and abusive father and husband, grew up filled with resentment and anger toward his father, who abandoned the family, and quickly turned to crime, in which he used a crowbar as a reminder of his father, destroying each place he robbed.",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/40/image_not_available",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010884",
    "comics": {
        "available": 6,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010884/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17496",
                "name": "Avengers (1998) #15"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17497",
                "name": "Avengers (1998) #16"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17498",
                "name": "Avengers (1998) #17"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17499",
                "name": "Avengers (1998) #18"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/1795",
                "name": "Avengers Assemble Vol. 2 (Hardcover)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/38182",
                "name": "Marvel Point One (Trade Paperback)"
            }
        ],
        "returned": 6
    },
    "series": {
        "available": 3,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010884/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/354",
                "name": "Avengers (1998 - 2004)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1496",
                "name": "Avengers Assemble Vol. 2 (2005)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/13745",
                "name": "Marvel Point One (2011 - Present)"
            }
        ],
        "returned": 3
    },
    "stories": {
        "available": 6,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010884/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/37350",
                "name": "The Three-Fold Path",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/37352",
                "name": "Mistaken Identity",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/37354",
                "name": "Cage of Freedom",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/37355",
                "name": "Avengers (1998) #18",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/37356",
                "name": "The Battle for Imperion City!",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/85265",
                "name": "Interior From Marvel Point One Postcard",
                "type": "interiorStory"
            }
        ],
        "returned": 6
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010884/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010884/wrecker?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Wrecker_%28Dirk_Garthwaite%29?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Dirk Garthwaite",
        "identity": "Publicly known",
        "occupation": "Criminal; former laborer",
        "place_of_birth": "New York City, New York",
        "groups": "[[Wrecking Crew]]; (formerly) [[Masters of Evil]]",
        "citizenship": "U.S.A.",
        "education": "Unrevealed",
        "aliases": "None",
        "relatives": "Burt Garthwaite (father, deceased), Ann Garthwaite (mother, deceased)",
        "height": "6’3”",
        "weight": "320 lbs.",
        "eyes": "Blue",
        "hair": "Brown",
        "powers": "Having been transformed by Asgardian magic, the Wrecker originally possessed power that made him the equivalent of an Asgardian god—vast superhuman strength and a high degree of invulnerability with some resistance to cold, heat, fire, corrosives and toxins. He later shared this enchantment with three others, sacrificing some of his own power but remaining none the less formidable. (When he believed his enchantment was fading, the Wrecker sought augmentation by geneticist Arnim Zola, who used scientific means to restore his power.)",
        "abilities": "Dirk is a brutish street brawler.",
        "weapons": "The Wrecker carries a 4-foot long steel crowbar that was also affected by Karnilla’s magical enchantment, becoming virtually indestructible. It is able to store and release the Wrecker's enchantment, enabling him to share it among the Wrecker and the rest of his Crew.",
        "paraphernalia": "None",
        "debut": "Thor #148",
        "origin": "Thor #148; Thor #431",
        "significant_issues": "",
        "main_image": "Wreckerdirk.jpg",
        "bio_text": "Burt Garthwaite, construction worker and abusive father and husband, left his family when his son Dirk was at an early age (although his mother believed him to have later died and led her son to believe so as well).  Dirk grew up filled with resentment and anger, becoming a laborer for a demolitions company, but he was fired for his disruptive and violent behavior. Turning to crime, he used a crowbar as a reminder of this father, destroying each place he robbed. Called the Wrecker, he managed to continually elude the police.",
        "bio": "Burt Garthwaite, construction worker and abusive father and husband, left his family when his son Dirk was at an early age (although his mother believed him to have later died and led her son to believe so as well).  Dirk grew up filled with resentment and anger, becoming a laborer for a demolitions company, but he was fired for his disruptive and violent behavior. Turning to crime, he used a crowbar as a reminder of this father, destroying each place he robbed. Called the Wrecker, he managed to continually elude the police.\n\nOne day, the Wrecker happened to attempt a robbery at a hotel room used by [[Loki]], who was then stripped of his magical powers. Loki had just requested mystical enhancements from [[Karnilla]] the Norn Queen to oppose [[Thor (Thor Odinson)|Thor]]. Karnilla cast the spell upon Dirk instead, since he was playfully trying on Loki’s hat. Flushed with his new superhuman power, he began a rampage in the city but was confronted by Thor. The battle raged for hours, but the Wrecker was eventually stopped by the [[Destroyer (construct)|Destroyer]] automaton, animated by the spirit of [[Sif]]. He was kept imprisoned under heavy sedation, but he eventually overcame the sedation to seek revenge. This time, Thor proved more than a match. The Wrecker was thrown against the third rail of a subway track, and Thor’s hammer was able to draw the Wrecker’s power away.\n\nWhile in prison, Dirk kept tabs on the location of his crowbar. With his fellow convicts Dr. Eliot Franklin, Brian Calusky and Henry Camp, he managed to break out and retrieve the crowbar. Correctly assuming the crowbar housed the powers that had been drained from him, the Wrecker had his three friends grasp the bar with him in an electrical storm, and the storm transferred the power amongst the four of them. Franklin became [[Thunderball]]; Calusky became [[Piledriver (Brian Calusky)|Piledriver]]; and Camp became [[Bulldozer (Henry Camp)|Bulldozer]]. Together, they became known as the [[Wrecking Crew]].\n\nAfter their first foray against the [[Defenders]], the Wrecker and the Wrecking Crew were inseparable, including their abduction to [[Battleworld]] by the [[Maker|Beyonder]] and joining with [[Doctor Doom (Victor von Doom)|Doctor Doom]]'s army of super-villains. The Crew also joined [[Baron Zemo (Helmut Zemo)|Baron Zemo]]'s [[Masters of Evil]] and the Wrecker was instrumental in helping bring down [[Hercules (Heracles)|Hercules]]. After this, Thor used his hammer to draw the Wrecker’s away from the others who divided it, and the all-powerful Wrecker was brought down by [[Captain America (Steve Rogers)|Captain America]]. \n\nWhen [[Spider-Woman (Julia Carpenter)|Spider-Woman]] was on the trail of the Wrecker at large, [[Spider-Man (Peter Parker)|Spider-Man]] also appeared to help. The heroes learned that nearly all of the Wrecker’s crimes were meant to fund his mother’s medical expenses, as she had laid bed-ridden for many years. Spider-Woman visited her, and she revealed that she never took his money, knowing where it came from and how he came about it. She interrupted Spider-Man and the Wrecker’s fight to show him a letter she had written moments before passing away, He read it and then left, distraught. \n\nMonths later, the Wrecker freed his Crew, and they performed many other acts of villainy, although they had to deal often with the treachery of Thunderball, who craved the Wrecker’s power all for himself. Eventually, the Crew reconciled, seeking out Hercules once more. But battling them helped Hercules overcome the fear of combat he had suffered since the  beating at their hands, and they were defeated. Ultimately, Loki decided that he wanted the power of the Wrecker for himself, since it had been meant for him, and while the Crew were battling Thor and the [[Ghost Rider (Daniel Ketch)|Ghost Rider]], he had the [[Enchantress]] and [[Ulik]] bring down each member of the Crew, until only the Wrecker remained. Loki proceeded to torture the Wrecker, and finally cast him into another dimension.\n\nThe Wrecker found out how to appear on Earth during periods of concentration and sought out his long-lost father, Burt, who was discovered to be alive and living in a retirement home. [[Thunderstrike]] and Code: Blue managed to track the Wrecker and arranged a trap for him at his fathers’. During the encounter, Burt continued to browbeat his son and, suddenly, suffered a heart attack. The Wrecker was denied his chance of revenge and snapped back to his exile. \t \n\nThe Wrecker somehow finally returned to Earth and was reunited with the Crew, but their powers began fading when many of [[Asgard]]'s links to Earth were separated. Leaving the Crew to find the source of his fading powers, he found the god [[Set]], who beat him so severely as to remand him to the hospital. Later, the entire Crew received a power boost when hired by [[Zola, Arnim|Arnim Zola]] to battle the [[Thunderbolts|Thunderbolts]] (unaware that the Thunderbolts included many of their former allies in the Masters of Evil).  Although this power boost was successful, it was based on science, not magic, and the Wrecker came to believe later that he lost the “edge”\nAsgardian power gave him.\n\nOnce again, the Wrecking Crew appeared as a whole in their subsequent endeavors, hired by the likes of the [[Doomsday Man]], battling heroes such as the Avengers and the [[Warriors Three]], used as lackeys by [[Le Fay, Morgan|Morgan le Fay]], among others. When the Crew was imprisoned in the [[Raft]], they joined the massive breakout and escaped, but the Wrecker was apart from the Crew when he was recaptured by a new version of the Avengers.",
        "categories": [
            "Thunderbolts",
            "Avengers",
            "Villains",
            "Magic",
            "Thor"
        ]
    }
}