{
    "id": 1010764,
    "name": "Stardust",
    "description": "As Herald for the world devourer, Galactus, Stardust found suitable worlds for her master to consume.",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/40/image_not_available",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010764",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010764/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010764/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010764/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010764/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010764/stardust?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Stardust?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Lambda-Zero",
        "identity": "Secret",
        "aliases": "None",
        "occupation": "Herald of [[Galactus]]",
        "place_of_birth": "Unspecified location in the primordial universe",
        "groups": "[[Heralds of Galactus]]; Formerly [[United Front]]",
        "citizenship": "Ethereal World",
        "education": "Unrevealed",
        "relatives": "Unrevealed",
        "height": "7'",
        "weight": "Unrevealed",
        "eyes": "Glowing energy (color variable)",
        "hair": "None",
        "powers": "Stardust is made entirely of cosmic particles and energy and it is possible that she may be indestructible as she can survive planetary explosions and being sucked into a black hole. She can produce devastating eye and hand blasts, re-form herself at will, fly at the speed of light and faster using the power cosmic, and survive indefinitely in space because she does not need air, food, or water. Stardust can also create dimensional portals and black holes, does not age and is immune to all conventional diseases.",
        "weapons": "Stardust uses a staff with an axe-blade at one end and a curved spear at the other. She can use the staff to focus her energy blasts.",
        "paraphernalia": "None",
        "debut": "Stormbreaker: The Saga of Beta Ray Bill #1 (2005)",
        "origin": "Unrevealed",
        "significant_issues": "Stormbreaker: The Saga of Beta Ray Bill #1-4 (fought Beta Ray Bill and then aided him against Asteroth, 2005) Silver Surfer: Annihilation #2-3 (dismissed as herald and joined with Firelord and Red Shift against Annihilus, 2007), Annihilation #1-3 (joined United Front under the command of Nova (Richard Rider), 2007), Annihilation: Heralds of Galactus (sacrifices the last of her people to become herald to Galactus once more, 2007)",
        "main_image": "Strdst.jpg",
        "bio_text": "As [[Glossary:H#Herald|Herald]] for the world devourer, [[Galactus]], Stardust found suitable worlds for her master to consume. She performed above her master's expectations as she would track down and destroy any inhabitants of a world that happened to escape the destruction, wiping out any trace of their civilization.",
        "bio": "As [[Glossary:H#Herald|Herald]] for the world devourer, [[Galactus]], Stardust found suitable worlds for her master to consume. She performed above her master's expectations as she would track down and destroy any inhabitants of a world that happened to escape the destruction, wiping out any trace of their civilization.\n\nStardust first met [[Beta Ray Bill]] as Bill was trying to defend his people, the Korbinites, who happened to be the next target of Galactus. Their planet was eventually lost, but the remaining survivors had transferred their life essences into an orb that Beta Ray Bill would protect until he could find a new world for his people to inhabit. Stardust, however, had other plans as she hunted Beta Ray Bill. [[Image:Stardustvictory.jpg|left|250px|thumb|Stardust and a defeated Alpha Ray]] She was determined to wipe out the Korbinite's existence forever. The two engaged in battle and Bill would not fall knowing that he was the last hope for his people. Eventually, Stardust called upon his powers to open a dimensional gateway to banish Beta Ray Bill and his people into, but instead she unwittingly released a foe greater in power and evil than either have ever confronted. [[Asteroth]] was now let loose upon the universe, and it was up to both of them to stop her. Galactus, meanwhile, had repaired the damage done to a fallen Korbonite, [[Alpha Ray]], and sent him to intercept Stardust and Beta Ray Bill. Stardust, knowing that Asteroth had to be banished from this plane of existence, used her immense cosmic abilities to create a black hole. Alpha Ray arrived just in time to deal a major blow to Asteroth and drove her into the black hole removing Asteroth as a threat. Stardust became a victim of her own creation as she could not escape the black hole's gravity and was consumed as well. \n\nStardust eventually returned to her master's side and was present at the time of the [[Annihilation|Annihilation Wave]]. Galactus sent Stardust to join two other former heralds, [[Firelord (Pyreus Kril)|Firelord]] and [[Red Shift]], in opposing the forces of [[Annihilus]] before taking the [[Silver Surfer]] as his herald once more. While in battle with Anihilus's forces on the planet Daedalus 5, Stardust and Red Shift detected the presence of Galactus, who had been turned into a weapon by [[Thanos]]. Stardust saved [[Gamora]] during her battle with another former herald, [[Terrax]], and reunited her with the rest of the rebellion. In order to give [[Nova (Richard Rider)|Nova]] and his remaining forces time to evacuate, Stardust and Red Shift seemingly sacrificed themselves by delaying the destruction of Daedalus 5 by temporarily holding back the cosmic energies of Galactus before they could consume the planet. \n\nStardust, in time, was able to reform herself in the Andromeda Galaxy unclear of what drew her there. While traveling back to the side of her former master, Galactus, Stardust intercepted a cluster of alien life forces she recognized to be of her race, the [[Ethereals]]. The fifty three entities that formed the group explained that the Annihilation Wave wiped out their civilization, and they were the last of their kind. They branded Stardust as a traitor since she was off helping the Corporeals, the Solid Ones, in fighting their war instead of aiding her people and attacked her. Stardust was unwilling to listen to the accusations and struck back using the [[Glossary:P#power cosmic|Power Cosmic]] to obliterate the entities. However, horrified at her rash actions, Stardust siphoned their essence into her and was willing to use them as her conscience as they now shared a destiny. Finally, Stardust reached Galactus who was in a weakened state because of the energies he used to defeat Aniihilus' forces. Asking to be taken back as herald once more, Stardust was asked by Galactus for a show of loyalty. Knowing exactly what Galactus wanted, no matter how monstrous it may have seemed, Stardust obliged and willingly gave the fifty three beings residing within her to Galactus to feed upon and partially replenish him. Galactus took Stardust back as a second herald and showed her a glimpse of the future where the Silver Surfer will turn on Galactus once more, and Stardust will be called upon to stand at his side. It is then that Stardust revealed that both corporeal and ethereal beings are equally useless to him and only one being in the universe commands her allegiance and her love – Galactus!",
        "categories": [
            "Villains",
            "Cosmic",
            "Annihilation",
            "Women"
        ]
    }
}