{
    "id": 1010866,
    "name": "Aqueduct",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/5/50/4c0035b3630cd",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010866",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010866/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010866/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010866/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010866/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010866/aqueduct?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Aqueduct?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Peter van Zante",
        "identity": "Known to the authorities",
        "occupation": "Criminal; (formerly) eco-terrorist, soldier",
        "place_of_birth": "Chicago, Illinois",
        "groups": "[[Force of Nature]]; formerly [[Thunderbolts|Thunderbolts Army]], agent of [[Hammer, Justin|Justin Hammer]]; (formerly) ally of the [[Enforcer]], [[Moondark]], the Mole",
        "citizenship": "U.S.A.",
        "education": "Unrevealed; some military training",
        "aliases": "Water Wizard",
        "relatives": "Unrevealed",
        "height": "5’10”",
        "weight": "210 lbs.",
        "eyes": "Brown",
        "hair": "Reddish-brown",
        "abilities": "Skilled military soldier",
        "weapons": "None",
        "paraphernalia": "None",
        "powers": "Van Zante has the ability to mentally control and shape water and other liquids, such as oil, and can manipulate tens of thousands of gallons at a time. He has mastered several uses of this power, including the ability to direct a firehose-like jet of water, to create watery monsters and humanoid servants, to create fists and objects out of nearby water, to suck moisture out of a victim to leave a dehydrated husk, to create boxing gloves of solidified water to enhance his strength, to increase the pressure of water even in shallow areas, and to ride on waves of controlled water. Van Zante is somewhat limited to operate his powers far from the vicinity of large quantities of water or in a moisture-deficient environment.",
        "debut": "Ghost Rider #23",
        "origin": "",
        "significant_issues": "",
        "main_image": "WaterWizard.jpg",
        "bio_text": "Badly wounded in American military engagements in Southeast Asia, Peter van Zante was being transported back home in an experimental life-support unit when a violent storm struck his transport ship with lightning. Not only was he miraculously healed by the power surge, he found he had the ability to mentally control water and other liquids. Returning to America, he was at first undecided on just what to do with these strange new powers, but he was soon convinced by a small-time hood, Jerry “Mole” Moulinski, to use his powers for personal gain. As the Water Wizard, van Zante became a notorious criminal on the West Coast.",
        "bio": "Badly wounded in American military engagements in Southeast Asia, Peter van Zante was being transported back home in an experimental life-support unit when a violent storm struck his transport ship with lightning. Not only was he miraculously healed by the power surge, he found he had the ability to mentally control water and other liquids. Returning to America, he was at first undecided on just what to do with these strange new powers, but he was soon convinced by a small-time hood, Jerry “Mole” Moulinski, to use his powers for personal gain. As the Water Wizard, van Zante became a notorious criminal on the West Coast.\n\nThe criminal [[Enforcer]] contacted the Water Wizard, offering him a million dollars to kill his enemy, [[Ghost Rider (John Blaze)|Ghost Rider]]. Although van Zante failed, the Enforcer continued to use his services in his feud with Ghost Rider, until the Enforcer’s apparent demise. The Water Wizard continued his small-time crime with the Mole, until he fled to Chicago, where he joined the sorcerer [[Moondark]] in another futile attack against Ghost Rider. Van Zante was seriously burned by Blaze's mystic flames, sending him into shock, and he was placed in a mental institution.\n\nIronically, it was Ghost Rider who freed him, and in return, van Zante was persuaded to help a town ravaged by drought. He was then kidnapped by criminals from Saudi Arabia who wanted to use his powers over liquids to attack rival oil companies. Van Zante created huge monsters out of oil to terrorize his victims, until the [[Arabian Knight (Abdul Qamar)|Arabian Knight]] and Ghost Rider put an end to the scheme. As van Zante was being extradited to America, he was freed by the criminal mastermind [[Hammer, Justin|Justin Hammer]]. Hammer had van Zante be part of a raid on an installation owned by [[Iron Man (Anthony Stark)|Tony Stark]]. Having little stomach to fight Iron Man, however, van Zante fled during the battle, much to Hammer's displeasure.\n\nOnce again in the U.S., van Zante laid low for some time to avoid both Hammer and the law. He was considering a return to crime when he was attacked by the villain-killers of the [[Scourge of the Underworld]]. Barely escaping death, van Zante was so shaken that he surrendered to [[Captain America (Steve Rogers)|Captain America]].\n\nWhen he got out of jail, van Zante was recruited by Project: Earth, an ecological direct action group based in Geneva, Switzerland, that regularly uses violence and deceit in retribution against those who damage the earth's ecosystem. They gave him a new costume and identity as Aqueduct, making him a member of [[Force of Nature]], a team of superhuman mercenaries posing as defenders of the environmental issues while working as ecological terrorists. Perhaps recalling his previous attacks on oil companies, van Zante settled happily into his new persona. However, after his two recorded missions with Force of Nature were thwarted by the [[New Warriors]], van Zante returned to being a freelance mercenary.\n\nHe later appeared as one of the [[Masters of Evil]] led by the [[Crimson Cowl (Justine Hammer)|Crimson Cowl]]. The Masters' attempt to blackmail the world into giving them billions of dollars through climate-controlling machines was thwarted by the [[Thunderbolts]], and Aqueduct was incarcerated once more. \n\nMore recently, Aqueduct was rounded up again by the Thunderbolts, this time on behalf of the United States government’s attempt to capture super-villains in the wake of the [[Civil War|Superhuman Registration Act]]. Like the other captured villains, van Zante was offered a choice to go to prison or to register himself with the SHRA and join the team, and he opted for the latter.",
        "categories": [
            " Villains",
            " Thunderbolts",
            "Civil War"
        ]
    }
}