{
    "id": 1010977,
    "name": "Lieutenant Marcus Stone",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/5/30/4c0032b127cf1",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010977",
    "comics": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010977/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/11779",
                "name": "Thor (1966) #451"
            }
        ],
        "returned": 1
    },
    "series": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010977/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2083",
                "name": "Thor (1966 - 1996)"
            }
        ],
        "returned": 1
    },
    "stories": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010977/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/17247",
                "name": "Thor (1966) #451",
                "type": "interiorStory"
            }
        ],
        "returned": 1
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010977/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010977/lieutenant_marcus_stone?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Stone%2C_Lieutenant_Marcus?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Marcus Stone",
        "identity": "Known",
        "aliases": "None",
        "occupation": "New York Police Lieutenant",
        "place_of_birth": "Unrevealed",
        "groups": "[[Code: Blue]]",
        "citizenship": "U.S.A.",
        "education": "Presumably a college degree",
        "relatives": "Unidentified ex-wife, unidentified children, unidentified father (deceased)",
        "height": "Unrevealed",
        "weight": "Unrevealed",
        "eyes": "Brown",
        "hair": "Black moustache",
        "powers": "None",
        "abilities": "Marcus Stone is a skilled fighter and a brilliant tactician",
        "weapons": "Lieutenant Stone is trained in the use of most firearms including handguns, various types of rifles and even heavy weaponry such as grenades and grenade launchers",
        "paraphernalia": "Lieutenant Stone normally wears the standard issue body armor and communicator issued to all Code: Blue members, but he has also been equipped with thermal body armor when opposing the Thermal Man",
        "debut": "Thor #404 (1989)",
        "origin": "Unrevealed",
        "significant_issues": "Thor #404, Thor #409, Thor #414, Thor #426-428, Thor #432-433, Thor #448-450, Thor #456, Thunderstrike #1, Thunderstrike #3-8, Thunderstrike #11, Thunderstrike #13-16, Thunderstrike #22-23, Thor #492-494, Journey into Mystery #505, The New Thunderbolts #3, The New Thunderbolts #9, The New Thunderbolts #10",
        "main_image": "Stone.jpg",
        "bio_text": "",
        "bio": "Lieutenant Stone had his first run in with the super powered community after [[Thor (Thor Odinson)|Thor]] had just defeated two other [[Asgardians]], the [[Enchantress]] and the [[Executioner (Skurge)|Executioner]]. He wanted to question the Thunder god, but Thor had already been whisked away to [[Asgard]] to tend to other matters. Upon Thor’s return, Stone would get his opportunity to not only meet him, but also to narrowly escape death as [[Doctor Doom (Victor von Doom)|Doctor Doom]] unleashed one of his robot minions to steal Mjolnir, the hammer of Thor. It wasn’t long after that instance that Lieutenant Stone had an important decision to make. He was given an ultimatum by his wife to either leave his job or she would leave him. Stone opted to retire from police work, but as luck would have it his last day on the job would be his most perilous. \n\nDuring the event referred to as the [[Acts of Vengeance]] which was orchestrated by the Asgardian God of mischief, [[Loki]], Lieutenant Stone was on hand when the [[Glossary:T#troll|rock troll]] [[Ulik]] attacked both Thor and his companion, [[Hercules]]. Stone watched as the Gods waged war on one another, but a magic talisman worn by Ulik gave him the power to best both opponents. As the magic wore off, Ulik attempted to retreat, but Stone would not allow him to escape. Pursuing his target to a rooftop high above the city streets, Stone challenged the mighty warrior, much to Ulik’s amusement. Inspired by recent events where Thor refused to surrender to Ulik, Lieutenant Stone was persistent in his quest to stop the maddened troll despite the reality that the weapon he used could not do any serious harm to the monster. Suddenly, a lucky shot gave way to a miscalculation on Ulik’s part, and he toppled off the roof falling several stories to the unforgiving ground below. Thor, finally recovered, arrived on the scene just in time to witness the first major victory for Lieutenant Stone over a foe far more powerful than he. It was at that moment Marcus Stone put his retirement on hold, and was back on duty. \n\nIt was some time after Ulik’s defeat and the reemergence of the [[Wrecking Crew]] that Lieutenant Stone decided to propose an idea for a special police task force to handle super powered criminals. During an episode where the [[Wrecker (Dirk Garthwaite)|Wrecker]] and his cronies were hold up in a building with a hostage that Stone’s team, [[Code: Blue]], got their first assignment. While the Wrecker was occupied with other concerns, the members of Code: Blue were able to secure positions around the building, mount a successful rescue attempt, and claim a victory over a major menace to the entire community. The action didn’t stop just then for the Wrecking Crew became involved in an altercation with [[Excalibur]] and Thor in which Lieutenant Stone and his squad intervened. In this instance, they managed to arrest [[Bulldozer (Henry Camp)|Bulldozer]], one of the Wrecking Crew’s members. After that the Asgardian god of mischief, [[Loki]], decided to kidnap the Wrecker and the son of architect, Eric Masterson, in a plot to get back at his hated half-brother, Thor. During their confrontation, Stone led his men into a virtual war zone in order to get the boy, Kevin Masterson, to safety and then remained behind to assist the Thunder god despite the risks to his own welfare. Stone witnessed Thor kill Loki, and expressed his disapproval claiming that no one was above the law, even a Thunder god.\n\nThor was judged and punished for his crime by his father, [[Odin]], and that action left a new Thor to defend the Earth. Lieutenant Stone and Code: Blue got the opportunity to meet the new hero when they attempted to arrest the [[Absorbing Man]] and [[Titania (Mary MacPherran)|Titania]] during a battle with Thor and [[Spider-Man (Peter Parker)|Spider-Man]]. The lawbreakers were eventually taken into custody, but a jailbreak at Ryker’s Island demanded Code: Blue’s immediate attention. The Asgardian menace, [[Uroc]], liberated a recently incarcerated Ulik and the two were wreaking havoc at the penitentiary. Stone and the others arrived too late to stop the escape, and the rock troll almost took Stone's life. Already bad blood between the two because of Ulik’s initial defeat at the hands of a mere mortal, Stone’s hatred increased after Ulik seriously injured [[Mother Majowski]], a valued Code: Blue member and friend. Still in peril, Stone owed his life to the new Thor who arrived just in time to lend a helping hand. Uroc and Ulik retreated back to Asgard, but Stone was determined to give chase and persuaded Thor to allow Code: Blue passage to the realm of the gods. In Asgard, Stone pursued Ulik on his own while his team attended to Uroc, but he could not recapture the escaped felon as Ulik seemingly fell of a cliff to his doom because he did not want to be put in a mortal prison again. \n\nThroughout Code: Blue’s various assignments, Lieutenant Stone has been face to face with both super villains and superheroes in his quest for justice. One such call had him and his team ally with the group [[Earth Force]] in order to confront the vigilante known as [[Bloodaxe]] and free his hostage. Other such encounters led him to partner on several occasions with the hero formerly known as Thor, [[Thunderstrike]], to take on foes like [[Carjack]], [[Pandara]] and even [[S.H.I.E.L.D.]] He has suffered the loss of a respected teammate, [[Jock Jackson|Andrew “Jock” Jackson]], and even risked his marriage because of his devotion to the job, but Lieutenant Stone was determined to make a difference. He met his greatest test after Code: Blue was sent to observe a new weapon for law enforcement that was supposed to be the cop of the future. An android police officer dubbed [[Officer Z.E.R.O.]] was going to make dangerous police work a thing of the past, and save the lives of many in the process. That was until the robot raged out of control and almost ended the lives of Code: Blue. The robot was defeated, but the real challenge came when the politicians wanted to cut funding which would effectively shut Code: Blue down. Outraged by the news, Stone still didn’t shirk his duties when it came to stopping a suddenly resurfaced Wrecker, a rogue [[Doombot]], a homicidal [[Thermal Man]], or the vengeful electronic entity of [[Kronin Krask]]. Through his perseverance and his actions, Stone and Code: Blue was saved from being terminated. Unfortunately, he could not save his marriage as he was served with divorce papers after these events.\n\nLieutenant Stone soon found himself in the middle of a mystery concerning the newly returned Thor, an army of bio-mechanical monsters, and the Norse gods. He and temporarily assigned Code: Blue operative, [[Detective Curazon]], were delegated to get to the bottom of it, but Thor averted tragedy without the aid of local law enforcement. More recently, Stone and his team were at the site of the United Nations when a devastating explosion threatened to collapse the entire building, but the combined efforts of the [[Thunderbolts]], Spider-Man, [[Reed Richards]] of the [[Fantastic Four]], and even the [[Sub-Mariner]] prevented the catastrophe. Code: Blue also fell under the maniacal manipulations of the [[Purple Man]] when he brainwashed the city of New York and turned everyone he could against the Thunderbolts. However, once the Purple Man was beaten, Code: Blue was free of his influence. Whether on his own or with Code: Blue, Lieutenant Stone remains vigilant in his pursuit of justice and will tackle any situation that requires his attention.",
        "categories": [
            "Heroes"
        ]
    }
}