{
    "id": 1010944,
    "name": "Magneto (Age of Apocalypse)",
    "description": "",
    "modified": "2014-03-05T13:40:56-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/d/70/53176f5026364",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010944",
    "comics": {
        "available": 5,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010944/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/38523",
                "name": "Age of X: Universe (2011) #2"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/32578",
                "name": "Uncanny X-Force (2010) #12"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/40018",
                "name": "Uncanny X-Force (2010) #12 (I Am Captain America Variant)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/40102",
                "name": "Uncanny X-Force (2010) #12 (Kubert Variant)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/12370",
                "name": "X-Men: Omega (1995) #1"
            }
        ],
        "returned": 5
    },
    "series": {
        "available": 3,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010944/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/13896",
                "name": "Age of X: Universe (2011)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/9976",
                "name": "Uncanny X-Force (2010 - 2012)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2101",
                "name": "X-Men: Omega (1995)"
            }
        ],
        "returned": 3
    },
    "stories": {
        "available": 5,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010944/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/67135",
                "name": "X-MEN: OMEGA 1 cover",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/73562",
                "name": "Interior #73562",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/84589",
                "name": "Cover #84589",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/90807",
                "name": "Interior #90807",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/90993",
                "name": "Interior #90993",
                "type": "interiorStory"
            }
        ],
        "returned": 5
    },
    "events": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010944/events",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/events/227",
                "name": "Age of Apocalypse"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/events/303",
                "name": "Age of X"
            }
        ],
        "returned": 2
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010944/magneto_age_of_apocalypse?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Magneto_%28Age_of_Apocalypse%29?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Age of Apocalypse]]",
        "real_name": "Erik Lensherr",
        "identity": "Known to the general public",
        "occupation": "Adventurer, freedom fighter",
        "place_of_birth": "Someplace in Europe",
        "groups": "Formerly X-Men",
        "citizenship": "Unknown",
        "education": "College",
        "aliases": "None",
        "relatives": "Rogue (wife), Charles (son), Pietro Maximoff (Quicksilver, son), Wanda Maximoff (Scarlet Witch, daughter, deceased), Magda (wife, deceased)",
        "height": "6'2\"",
        "weight": "215 lbs.",
        "eyes": "Blue",
        "hair": "White",
        "powers": "Magneto is a mutant with the ability to shape and manipulate magnetic fields. He uses his powers in many different ways, including creating a personal force field, flight, and energy blasts.",
        "debut": "unknown",
        "creators": "this has not been updated yet",
        "main_image": "magnetoApocalypse442.jpg",
        "bio_text": "Erik Lensherr's life changed the day his good friend Charles Xavier was murdered by Legion, a time-traveling madman. Legion, who was actually the future son of Charles Xavier, traveled back in time to murder the man who would become his father's nemesis in the future, Magneto. When Xavier sacrificed his life to save Magneto reality changed. And it appeared Xavier's dream of coexistence between mutants and humans would die with him.",
        "bio": "Erik Lensherr's life changed the day his good friend Charles Xavier was murdered by Legion, a time-traveling madman. Legion, who was actually the future son of Charles Xavier, traveled back in time to murder the man who would become his father's nemesis in the future, Magneto. When Xavier sacrificed his life to save Magneto reality changed. And it appeared Xavier's dream of coexistence between mutants and humans would die with him.\n\n\nXavier's death profoundly changed Lensherr's life. He made a promise on that day to carry on Xavier's dream: to take mutantkind by the hand and create a world where homo sapiens and homo superior would live together peacefully. This dream would never come to pass. The mutant known as [[Apocalypse (Age of Apocalypse)|Apocalypse]] made his presence known over a decade earlier than he would have if not for Legion's interference in the past.\n\n\nAs Apocalypse made his play for world domination, Magneto gathered a mutant army of his own. He began with his children, [[Quicksilver (Age of Apocalypse)|Pietro]] and [[Scarlet Witch (Age of Apocalypse)|Wanda]]. He learned of their existence while traveling through Germany and invited them to help him create a team of mutants to protect those who could not protect themselves. Both Quicksilver and Scarlet Witch embraced their father's cause and helped him gather his team.\n\n\nDuring this time Apocalypse grew stronger. He gathered a legion of mutant followers who believed in his survival-of-the-fittest mantra.  By the time Magneto had gathered his [[X-Men (Age of Apocalypse)|X-Men]] team together, Apocalypse had grown too strong and had gained control of a substantial section of North America. The X-Men, named after Xavier and his dream, went into hiding and used guerrilla tactics against Apocalypse's army.\n\n\nIn the early days of the X-Men's existence, Magneto provided a place for young mutants to learn how to use their powers and fight for genetic equality. Hidden in the Wundagore Mountains, this would be the X-Men's base of operations for years. \n\n\nSurrounded by a team he knew he could trust, Magneto began to counterattack Apocalypse. When Magneto learned Apocalypse had sent his Horsemen to Florida to launch the United States nuclear arsenal, he and his team rushed to stop them. He left his daughter, the Scarlet Witch, in charge of the young mutants not yet ready to fight for the X-Men. One of these young mutants, a girl named [[Rogue (Age of Apocalypse)|Rogue]], had just been delivered to Wundagore by [[Mystique (Age of Apocalypse)|Mystique]].\n\n\nThe X-Men were successful in Florida but that success came with a price. Apocalypse's son, [[Holocaust (Age of Apocalypse)|Nemesis]], attacked Wundagore and killed Magneto's daughter. Ravaged with guilt, Magneto considered giving up. The X-Men rallied around him and convinced him to go on. The young girl Rogue, who had promised Scarlet Witch she would care for her father, told Magneto his daughter believed in what they were doing and would have wanted him to carry on. Magneto did just that, but he swore he would have his revenge on Nemesis. \n\n\nThat revenge would come years later in Japan. Attempting to prevent Apocalypse and Nemesis from turning Japan into a wasteland, Magneto led a team of X-Men into Tokyo. Apocalypse and Nemesis were recovering from a gigantic plasma explosion unleashed by a captured [[Sunfire (Age of Apocalypse)|Sunfire]]. Nemesis absorbed the plasma energy and believed that power would be substantial enough to defeat Magneto and his X-Men. He was wrong. The enraged Magneto used his powers to tear Nemesis apart leaving him for dead on the battlefield. \n\n\nAs time passed, Magneto grew closer to Rogue. Unfortunately, Magneto's close friend [[Gambit (Age of Apocalypse)|Gambit]] also cared for her. Magneto expressed his growing feelings for Rogue when he told her that since both of them possessed magnetic powers they actually cancelled each other out. And the two kissed. Gambit witnessed this and was enraged. Moments later, during a sneak attack by an evil mutant named [[Wolverine (Age of Apocalypse)|Wolverine]], Rogue chose to save Magneto instead of Gambit. The Cajun mutant left the X-Men, and Magneto and Rogue carried on their romance.      \n\n\nMagneto and Rogue would marry and have a son, [[Lensherr, Charles (Age of Apocalypse)|Charles]]. They would continue their war against Apocalypse, doing what they could to stop the madman's plans. But it became clear to them that they were fighting a losing battle. Not until the reappearance of [[Bishop (Age of Apocalypse)|Bishop]], an X-Man from the true Marvel Universe timeline and a man Magneto had not seen since the murder of Xavier twenty years, did Magneto realize there was truly hope.\n\n\n[[image: magnetoApol02.jpg|thumb|right|200px]]Magneto learned another reality existed, one in which Apocalypse was not ruler of America. One in which Xavier was not killed and he created the X-Men. Seeing the desperate nature of the world he currently lived in, Magneto took the chance to change the past for the better. He sent [[Nightcrawler (Age of Apocalypse)|Nightcrawler]], [[Colossus (Age of Apocalypse)|Colossus]] and [[Shadowcat (Age of Apocalypse)|Kitty Pryde]], and Gambit to retrieve the necessary items and people to travel back in time to save Charles Xavier. He then sent the rest of his X-Men team, including his wife Rogue and son Quicksilver, on missions to save as many humans as they could from the upcoming genetic war in case Bishop was truly mad. \n\n\nWhile his X-Men were scattered across the globe, Magneto stayed in Westchester with Bishop and his young son, Charles. The three of them were ambushed by Apocalypse there. Magneto, Bishop, and eventually his young son, were all captured. Magneto was taken to the New York City capital of Apocalypse's kingdom and tortured. He was eventually freed by the genetic clone named Nate Grey, known as the [[X-Man]]. \n\n\nWith all elements now in place, Magneto was able to send Bishop back in time to prevent Legion from murdering Charles Xavier. The original Marvel Universe timeline was restored. And Charles Xavier was saved. With Bishop safely sent back in time, Magneto turned his efforts back towards Apocalypse. Using all of his magnetic powers Magneto tore Apocalypse apart. \n\n\nMagneto was able to reunite with his wife and son as the nuclear weapons launched by the Human High Council rained down on New York City. How the Age of Apocalypse survived not only Bishop saving Xavier in the past but also the nuclear holocaust which was going to obliterate them all is unknown. All that is known is Magneto and his X-Men stand ready to rebuild the earth and face any threats that may come their way.",
        "categories": [
            "Age of Apocalypse"
        ]
    }
}