{
    "id": 1010929,
    "name": "Green Goblin (Ultimate)",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/2/c0/4c003439f081b",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010929",
    "comics": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010929/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17213",
                "name": "Ultimate Spider-Man (2000) #116"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/20719",
                "name": "Ultimate Spider-Man Vol. 19: Death of a Goblin (Trade Paperback)"
            }
        ],
        "returned": 2
    },
    "series": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010929/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/466",
                "name": "Ultimate Spider-Man (2000 - 2009)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/3854",
                "name": "Ultimate Spider-Man Vol. 19: Death of a Goblin (2008)"
            }
        ],
        "returned": 2
    },
    "stories": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010929/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/36079",
                "name": "Death of the Goblin 5 of 6",
                "type": "cover"
            }
        ],
        "returned": 1
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010929/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010929/green_goblin_ultimate?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Green_Goblin_%28Ultimate%29?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Ultimate]]",
        "real_name": "Norman Osborn",
        "identity": "Known to the authorities",
        "occupation": "Criminal; former CEO and founder of Oscorp, scientist",
        "place_of_birth": "Unknown",
        "groups": "Osborn's unnamed \"six\"",
        "citizenship": "U.S.A. with criminal record",
        "education": "PhD in various sciences",
        "aliases": "None",
        "relatives": "Cher Osborn (half-sister), Harry Osborn (son), unidentified wife (deceased), Amberson (father), unidentified brother or brother-in-law",
        "height": "5'9 (as Osborn); variable, usually 7' (as Goblin)",
        "weight": "150 lbs (as Osborn); variable, usually 1000 lbs (as Goblin)",
        "eyes": "Blue (as Osborn); green (as Goblin)",
        "hair": "Brown (as Osborn); none (as Goblin)",
        "powers": "Norman’s goblin form is superhumanly strong, and can leap hundreds of feet at a time;He can run very fast: as the goblin, he also possesses clawed hands that facilitate climbing, durable (but not bulletproof) skin, and accelerated healing. He can generate fiery bolts of energy from his hands.",
        "features": "Green skin",
        "debut": "(as Osborn) Ultimate Spider-Man #1; (as Goblin) Ultimate Spider-Man #4",
        "origin": "",
        "significant_issues": "",
        "main_image": "Ultimategoblin-markbagley.jpg",
        "bio_text": "",
        "bio": "Norman Osborn was a scientific genius who founded his own company, Oscorp, over thirty years ago. It developed new technologies and innovative materials for the manufacturing, construction, automotive and chemical-processing industries, among others. Osborn also liked to keep his company at the forefront of new sciences, such as bioengineering; when Colonel [[Fury, Nick (Ultimate)|Nick Fury]] of S.H.I.E.L.D. made it quietly known they wanted to tender contracts to the private sector to develop new “Super Soldier Serums”, Oscorp took on competitors such as Hammer Industries to win the corporate bidding war; however, it rapidly became clear that Norman had misled S.H.I.E.L.D. as to how ready his company was to produce results. They had rushed the research process to win the bid, their formula was messy, and their presentation had been largely “smoke and mirrors”. After two and a half years without results, Fury severed ties between S.H.I.E.L.D. and Oscorp. Losing the contract left Oscorp shaky; to bolster their reputation and share price, Norman publicly declared that he had discovered a miracle compound, Oz, with undisclosed, “closely guarded” properties. With the breathing space this provided, Norman tried to rush the development of the compound he had told everyone he already had.\n\nWorking with scientists such as [[Doctor Octopus (Ultimate)|Otto Octavius]], Norman began testing Oz on animals. Disaster seemed to strike when a spider exposed to the compound escaped and bit visiting student [[Spider-Man (Ultimate)|Peter Parker]], a friend of Norman’s son Harry. Fearing exposure of his illegal research should Peter die from the effects of the bite, Osborn had his hired gun Shaw observe the boy, and was prepared to have him murdered; but instead of becoming ill, Peter developed arachnid-like super-powers. Believing he had stumbled upon exactly what he needed to save his company, Norman decided to test direct application of the Oz Compound on a human guinea pig – himself. Doctor Octavius supervised this process, but something went horribly wrong; an explosion destroyed the lab, killing most of those present. Octavius and bystander Harry both survived, though both were changed as a result; but the most obvious and immediate effect was on Norman, who was transformed into a gargoyle-like strongman. The monstrous, mentally muddled Norman wandered the streets in a haze before destroying his own mansion home in a fireball that killed his wife; Harry barely escaped. Norman next attacked Harry’s school, hunting for Peter, who had adopted the costumed persona of Spider-Man. As Spider-Man, Parker tried to subdue the monster, their fight carrying them towards the city and climaxing atop a bridge, where police marksmen riddled Norman with gunfire. Badly injured, Norman lunged at Spider-Man, missed, and plunged into the waters below, apparently drowning. Informing the police that the goblin was his mutated father, a distraught Harry was taken away for questioning and his own protection. \n\n[[image:GreenGoblinUlt01.jpg|thumb|left|200px]]Norman survived, regaining human form. Using injections of Oz to transform again, Norman gradually gained full use of his speech and mental faculties in his monstrous form. Continued exposure to the drug also drove him insane, and he began to see tiny creatures that would provide him with conflicting advice on what to do. He remained in hiding at first, using his contacts to recover Harry from protective custody and have the investigations into the lab explosion and his mansion fire dropped. He hired a psychiatrist, Doctor Warren, who hypnotized Harry into believing his father had not been the creature he had seen. \n\nWhen Norman’s old rival, Justin Hammer, was slain by an equally insane Otto Octavius (now calling himself Doctor Octopus), Norman decided to come out of hiding. He concocted a cover story claiming Hammer had been behind the attacks, acts of sabotage which had forced Norman to go into seclusion to protect his son, and which had now ended with Hammer’s demise. Not believing this for a second, Nick Fury had S.H.I.E.L.D. illegally spy on Norman. Harry returned to school, inviting Peter Parker to visit him and his father; not knowing what else to do, the terrified youth reluctantly accepted. As soon as Peter and Norman were alone, Norman assumed his goblin form and told Parker that he would work for Norman or see his loved ones suffer. At school the next day, Fury confided in Peter, explaining that S.H.I.E.L.D. knew of Norman’s threats but could do nothing until Osborn made a public move. That night, Norman tried to tighten his hold on Peter by inviting Peter’s Aunt May to his skyscraper; angrily, Peter went alone to confront him. Norman met him on the roof in his goblin form, and when Peter refused to meet his demands, Norman snatched the arriving Mary Jane Watson, Peter’s girlfriend, who had likewise been lured to the building. Osborn carried the terrified girl to the Queensboro Bridge, then threw her off it. As Spider-Man leapt to her rescue, S.H.I.E.L.D. attack helicopters moved in. Attacked by both Peter and the gunships, Norman fled back to his skyscraper, intending to inject himself with even more Oz. When Harry interrupted, Norman used a post-hypnotic suggestion to render him unconscious, then took more of the serum, mutating further. Spider-Man arrived seconds later, but was swiftly overpowered. Harry awoke to see his father strangling the unmasked hero, backlit by the lights of the approaching attack copters. Peter managed to kick free and bury Norman under a heavy stone desk, which Norman shrugged off, throwing it out the window. Spider-Man grabbed it with his webbing to stop it smashing down into the busy street below, but left himself exposed; as Norman tried to rip his head off, Harry rammed a large piece of jagged metal through his father’s back. Norman rounded on his son, and seeing an opening, the S.H.I.E.L.D. choppers opened fire. Injured beyond the limits of his endurance, Norman collapsed and reverted to a comatose human form.\n\nNorman was taken into S.H.I.E.L.D. custody and stored alongside other genetically mutated criminals in a secure research facility, where he was studied and interrogated by [[Giant-Man (Ultimate)|Dr. Hank Pym]] (Giant-Man). Fury said they would remain imprisoned until they either co-operated or died. When Pym asked Norman in a group session why he had destroyed his life by deliberately mutating himself, Norman accused him of simply wanting to steal the secret of the Oz formula. [[image:GreenGoblinUlt02.jpg|thumb|right|200px]]Enraged to learn that S.H.I.E.L.D. already had the formula, as they had confiscated everything he owned, Norman began to transform, proving he no longer needed injections of Oz, before security measures brought him down. A few months later, fellow inmate Doctor Octopus engineered a breakout, and the criminals slaughtered their way out the facility, hiding out together. Norman became de facto leader of their group, which included Doctor Octopus, Electro, Kraven and Sandman. Osborn called the White House, demanding amnesty, one hundred million dollars, his company and his son back, and Fury fired; otherwise, he would make public the story of their illegal imprisonment and bring the President down. Fixated on the idea that Peter Parker was his son, Norman had Octopus hack into S.H.I.E.L.D. systems and shut down security at its main base, the Triskelion, allowing the escaped villains to kidnap Spider-Man, who had been taken there into protective custody. With a blackmailed Spider-Man increasing their numbers to six, the group assaulted the White House, but was intercepted on the front lawn by S.H.I.E.L.D. and the Ultimates. Norman battled both [[Captain America (Ultimate)|Captain America]] and Spider-Man (who had learned his loved ones were safe in S.H.I.E.L.D. custody), but was then confronted by Harry, who had been brought in by Fury. As his son pleaded with him to stop, Norman began to revert to human form until Iron Man shot him from behind, deliberately overloading his genetic sequence; Norman’s transformation went out of control and he collapsed, stuck midway between forms. Fury had the unconscious villain cryogenically frozen and removed for further tests; however, it seems inevitable that he will break free someday and return to plague Fury and Spider-Man again.",
        "categories": [
            "Ultimate Marvel"
        ]
    }
}