{
    "id": 1010876,
    "name": "Mongoose",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/9/20/4c00359f53bde",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010876",
    "comics": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010876/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/11719",
                "name": "Thor (1966) #391"
            }
        ],
        "returned": 1
    },
    "series": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010876/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2083",
                "name": "Thor (1966 - 1996)"
            }
        ],
        "returned": 1
    },
    "stories": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010876/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/17082",
                "name": "Thor (1966) #391",
                "type": "interiorStory"
            }
        ],
        "returned": 1
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010876/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010876/mongoose?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Mongoose?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Unrevealed",
        "identity": "Secret",
        "aliases": "None",
        "occupation": "Former agent of the [[High Evolutionary]], agent of [[Seth]], partner of [[Quicksand]] and [[Bison]]",
        "place_of_birth": "Unrevealed",
        "groups": "[[Thunderbolts]]",
        "citizenship": "Citizen of [[Wundagore]]",
        "education": "Unrevealed",
        "relatives": "None",
        "height": "6’",
        "weight": "230 lbs.",
        "eyes": "Brown",
        "hair": "Bald (Thor #391), Black cornrows (Thunderstrike #14)",
        "powers": "Mongoose has superhuman strength, enabling him to lift at least 10 tons, speed, agility, and a high resistance to injury. The full limits of all these abilities have yet to be revealed.",
        "weapons": "Mongoose uses devices, built into his gauntlets, to either dispense a sedative gas, or employ a laser weapon that the citizens of Wundagore normally use to drill through rock and earth. Mongoose also has razor sharp teeth, but it is unknown if they are natural or implanted.",
        "paraphernalia": "None",
        "debut": "Amazing Spider-Man #283 (1987, shadowed), Thor #391 (1987, full appearance)",
        "origin": "Unrevealed",
        "significant_issues": "Thor #391, Thor #406, Thor #408, Thunderstrike #13-14, Thunderstrike #22,  Thunderbolts #104",
        "main_image": "Mongoose_2.jpg",
        "bio_text": "",
        "bio": "After months of waiting for the mighty [[Thor (Thor Odinson)|Thor]] to return to Earth, Mongoose finally got his chance to hunt him down. Tracking him to a construction site, the merciless Mongoose first attacked Thor while in his civilian identity of Sigurd Jarlson. Using his surprise entrance to his advantage, Mongoose quickly gained the upper hand and caused Jarlson to fall from a height that may have even killed the [[Asgardians|Asgardian]] if not for the timely intervention of [[Spider-Man (Peter Parker)|Spider-Man]]. As Spider-Man kept the cold blooded killer busy, Jarlson made his stunning transformation into Thor and joined the battle once more. Returning the web-slinger’s good deed, Thor stopped Mongoose from ripping Spider-Man’s throat open with his razor sharp teeth, but the speed of Mongoose enabled him to slip away from the Thunder god’s grasp. Once the two heroes regrouped, Mongoose didn’t stand a chance of victory, so he gave his opponents something else to worry about by knocking out the support columns of the building so he could make his escape. Spider-man and Thor prevented the building from falling, but Mongoose was nowhere to be found. Thor had to rush the injured architect, Eric Masterson, to the hospital after he saved contractor, Jerry Sapristi, from falling debris.\n\nSome time later, Mongoose returned but with Thor nowhere to be found, he tracked Masterson to his home and attacked him in hopes of getting Thor’s attention. Kidnapping the architect and leaving a message behind, Mongoose lured the Thunder god to [[Wundagore]], home of the [[High Evolutionary]], and ordered its citizens to attack. All except for [[Count Tagar]], one of the Evolutionary’s [[New Men]], did as Mongoose commanded. Confiding in their newly acquired prisoner, Tagar told Masterson about his master’s works, but included that Mongoose is not truly a New-Man although he serves the same master. As Thor contended with Wundagore’s forces, Count Tagar located his absent creator as well as the mighty [[Hercules]] somewhere in the [[Black Galaxy]], and ordered the army to cease all hostilities. Mongoose hid as apologies were made, and Thor agreed to journey to the Black galaxy and rescue the High Evolutionary and his long-time ally. Upon their return, Thor, Hercules and Masterson departed Wundagore, but Mongoose would not let them leave so peacefully. Using an Asteroid Blaster that he stole from Wundagore, Mongoose would have surely destroyed them if not for the power within Thor’s hammer, Mjolnir, which reduced the craft to rubble. With Hercules dazed and Masterson injured, Mongoose pressed his attack on Thor and would have killed him if not for the sacrifice of Thor's ally. Leaping in the way of a laser blast meant for the Asgardian, Masterson sacrificed his life so that Thor could live. Hercules recovered as did Thor, and Mongoose, knowing he was overpowered again, decided to flee the field of battle. Thor begged his father to save the mortal’s life, and [[Odin]] merged their two life forces into one being. \n \nMongoose would return yet again, but this time he served a new master in the Egyptian God of death, [[Seth]]. Together with his partners, [[Quicksand]] and [[Bison]], they were to steal a secret compound called Inferno-42 from the government agency, [[S.H.I.E.L.D.]]. Their plan went awry, however, when the combined forces of S.H.I.E.L.D., [[Cage, Luke|Luke Cage]] and Eric Masterson, now [[Thunderstrike]], opposed them. Masterson had been controlled by his fear as he remembered what Mongoose did to him the last time they met, and this allowed Mongoose to nearly finish what he started back in Wundagore. Recovering quickly from his panic attack, Thunderstrike fought back without giving Mongoose any time to recover, and beat his rival into submission. When the S.H.I.E.L.D. installation was flooded and all those inside had to evacuate, Mongoose was able to slip past the authorities once again. Soon after, Mongoose and Quicksand were sent on another errand for their master, but only ended up in conflict with Thunderstrike and [[Bloodaxe]]. Masterson saved the life of Mongoose, but the favor was unappreciated as Mongoose attacked Thunderstrike in the name of revenge. Mongoose was defeated, and while Thunderstrike was battling Bloodaxe, Mongoose ran away to lick his wounds.\n\nRecently, Mongoose was apprehended by the [[Thunderbolts]], and after being given little options, he agreed to join them.",
        "categories": [
            "Villains",
            "Reformed Villains",
            "Thunderbolts",
            "Civil War"
        ]
    }
}