{
    "id": 1010862,
    "name": "Unicorn",
    "description": "Milos Masaryk, a Soviet intelligence agent assigned as a security guard for Anton Vanko, a Soviet inventor who developed the Crimson Dynamo armor, was tasked by the Soviet government to retrieve Vanko after he defected to the United States.",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/40/4c0035bc1dcf1",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010862",
    "comics": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010862/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/9613",
                "name": "Iron Man (1968) #58"
            }
        ],
        "returned": 1
    },
    "series": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010862/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2029",
                "name": "Iron Man (1968 - 1996)"
            }
        ],
        "returned": 1
    },
    "stories": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010862/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/95104",
                "name": "Iron Man (1968) #58",
                "type": "cover"
            }
        ],
        "returned": 1
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010862/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010862/unicorn?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Unicorn?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Milos Masaryk",
        "identity": "Secret",
        "occupation": "Criminal; (formerly) espionage agent, subversive",
        "place_of_birth": "Bratislava, Slovakia",
        "groups": "[[Thunderbolts Army]]; (formerly) [[Remont-4]], [[Stockpile]]; (formerly) agent of [[Count Nefaria]], [[Red Ghost]], [[Mandarin]], [[Titanium Man (Boris Bullski)|Titanium Man]]",
        "citizenship": "Slovakia",
        "education": "Unrevealed",
        "aliases": "None",
        "relatives": "Unrevealed",
        "height": "6’2”",
        "weight": "220 lbs.",
        "eyes": "Brown",
        "hair": "Red",
        "abilities": "Skilled intelligence agent and hand-to-hand combatant",
        "weapons": "The Unicorn’s signature weapon is his high-tech battle harness, the helmet of which contains an energy projector that can fire several very powerful types of blasts, from infrared and ultraviolet lasers to electron and neutron beams.",
        "paraphernalia": "The battle harness also has a rocket belt so the Unicorn can fly.",
        "powers": "The Unicorn's body underwent an experimental \"hyper-activator\" process that augmented his strength and endurance, and his body was toughened enough to resist powerful physical damage.",
        "debut": "Tales of Suspense #56",
        "origin": "",
        "significant_issues": "",
        "main_image": "Unicorn.jpg",
        "bio_text": "Milos Masaryk was a [[Communist Party (Soviet Union)|Soviet intelligence agent]] who was assigned as a security guard for [[Crimson Dynamo (Anton Vanko)|Anton Vanko]], a Soviet inventor who developed the Crimson Dynamo armor. Vanko managed to defect to the United States, and Milos’s superiors ordered him to retrieve the inventor, outfitting him with another of Vanko’s inventions: a helmet capable of projecting destructive blasts. As the Unicorn, Milos tracked down Anton Vankoa and confronted [[Iron Man (Anthony Stark)|Iron Man]], who was in fact responsible for Vanko's defection. The Unicorn forced Iron Man to return to Europe, but Iron Man escaped.",
        "bio": "Milos Masaryk was a [[Communist Party (Soviet Union)|Soviet intelligence agent]] who was assigned as a security guard for [[Crimson Dynamo (Anton Vanko)|Anton Vanko]], a Soviet inventor who developed the Crimson Dynamo armor. Vanko managed to defect to the United States, and Milos’s superiors ordered him to retrieve the inventor, outfitting him with another of Vanko’s inventions: a helmet capable of projecting destructive blasts. As the Unicorn, Milos tracked down Anton Vankoa and confronted [[Iron Man (Anthony Stark)|Iron Man]], who was in fact responsible for Vanko's defection. The Unicorn forced Iron Man to return to Europe, but Iron Man escaped. \n\nThe Unicorn later became a free agent, appearing as an agent to [[Count Nefaria]] claiming the need to raise funds for subversive activities. However, when Nefaria was defeated by the [[X-Men]], the Unicorn escaped. \n\nAfter this, he returned to Slovakia, where his superiors performed experimental conditioning on him to augment his powers. In addition to superhuman powers, he found himself free of the psychological conditioning the government had given him. He fled, destroying the “hyper-activator” device as he left. Unfortunately, he was also left with \"accelerated cellular deterioration,\" a side-effect of the experiment. He immediately tried to raise funds by posing as a scientist and fooling the United States Congress into giving him a grant, but he was exposed by Iron Man. He then sought help from another former Soviet villain, the [[Red Ghost]], only to be used as a henchman. \n\nHe then sought help from the [[Mandarin]], but again was merely used as a pawn, once again against Iron Man. The Mandarin had used a device to mentally control the Unicorn in battle, and a later tussle with Iron Man actually trapped Mandarin’s mind in the Unicorn’s body, although they later recovered. \n\nThe Unicorn next sought the [[Titanium Man (Boris Bullski)|Titanium Man]], who would agreed to find a cure for Milos in return for various \"favors.\" Iron Man, during one such Titanium Man-\"favored\" battle, captured the Unicorn. He managed to cure the disease, but unfortunately, the process finally unhinged the Unicorn’s already-unstable mind; he had become insane. He battled Iron Man again but escaped, walking into the waves of the sea, claiming the Titanium Man was waiting for him.\n\nAt some point, Milos Masayrk was discovered by Valentin Shatalov, the then-current [[Crimson Dynamo (Valentin Shatalov)|Crimson Dynamo]], and recruited for a secret project: the “Remont” plan to restore Russia to the glory days of Stalin. The Unicorn, clearly insane and beyond rationality, was defeated by the People's Protectorate and placed in another Soviet lab, where his eyestalk/third eye was revealed. Going on a subsequent berserk rampage, he was defeated by [[Synthesizer]] and Titanium Man and impressed into the service of Shatalov’s [[Remont-4]].\n\nThe Unicorn apparently recovered, and in his next appearance was wearing his headpiece again. He was recruited into the [[Stockpile]], a group of super-powered villains hired by [[Stark, Morgan|Morgan Stark]], Tony Stark's \"evil cousin.\" After a battle with Iron Man (during the time when he was replaced by an alternate version of his younger self), the group was basically wiped out, with the Unicorn being the only member of the group who definitely escaped to parts unknown.\n\nMore recently, the Unicorn was rounded up by the [[Thunderbolts]], who were acting on behalf of the United States government to capture super-villains in the wake of the [[Civil War|Superhuman Registration Act]]. Like the other captured villains, the Unicorn was offered a choice to go to prison or to register himself with the SHRA and join the team. The Unicorn opted for the latter.",
        "categories": [
            " Villains",
            " International",
            " Thunderbolts",
            " Civil War"
        ]
    }
}