{
    "id": 1010835,
    "name": "Asylum",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/40/image_not_available",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010835",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010835/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010835/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010835/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010835/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010835/asylum?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Asylum_(Henrique_Gallante)?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Henrique Manuel Gallante",
        "identity": "Publicly known",
        "occupation": "Adventurer; (formerly) mental patient",
        "place_of_birth": "Unrevealed",
        "groups": "[[Thunderbolts Army]]; (formerly) [[Psionex]]",
        "citizenship": "U.S.A.",
        "education": "High school dropout",
        "aliases": "Darkling, Henry Gallante, Manny Gallante",
        "relatives": "Unrevealed",
        "height": "(as Asylum) variable",
        "weight": "(as Asylum) variable",
        "eyes": "Brown, (as Asylum) White",
        "hair": "Black, (as Asylum) None",
        "powers": "Gallante has the mutant ability to tap into the dimension of the Darkforce, an energy based on darkness. So powerful his is access that Gallante was able to open a rift the size of Manhattan between his dimension and the Darkforce's. Although initially Gallante could not consciously control the Darkforce he released, it would often act as a part of his subconscious desire, such as flooding and destroying the world or releasing the dark impulses of others. He could surround himself in Darkforce, creating a separate, giant-sized body, and could manipulate masses of Darkforce as he desired, creating shapes, tendrils, and blasts of energy. After regaining some control over his abilities, Gallante could even teleport himself and others by using his body as a portal to the Darkforce Dimension. Once inside the dimension, Gallante’s victims would be confronted with their greatest fears as the Darkforce heightened and fed off the “darkness” within their psyches.",
        "abilities": "No significant abilities",
        "weapons": "None",
        "paraphernalia": "None",
        "debut": "(as Darkling) New Warriors #32 (1993); (as Asylum) New Warriors Annual #4 (1994)",
        "origin": "New Warriors #32 (1993)",
        "significant_issues": "",
        "main_image": "AsylumDarking.jpg",
        "bio_text": "Henrique \"Henry\" Gallante was a drug-addicted youth left abused and abandoned from his home and whose burgeoning mutant powers were driving him insane. He was placed in the Smythers drug rehabilitation clinic, but the doctors held little hope for him. Unknown to the doctors, Gallante's mutant powers allowed him access to the dimension of Darkforce, an extradimensional energy resembling tar. Although the energy possessed no true sentience, Gallante displaced his feelings of darkness and despair to it and allowed it to mimic an empathic sentience that fed off and perpetuated Gallante's dark feelings.",
        "bio": "Henrique \"Henry\" Gallante was a drug-addicted youth left abused and abandoned from his home and whose burgeoning mutant powers were driving him insane. He was placed in the Smythers drug rehabilitation clinic, but the doctors held little hope for him. Unknown to the doctors, Gallante's mutant powers allowed him access to the dimension of Darkforce, an extradimensional energy resembling tar. Although the energy possessed no true sentience, Gallante displaced his feelings of darkness and despair to it and allowed it to mimic an empathic sentience that fed off and perpetuated Gallante's dark feelings.\n\nThrough Gallante, the Darkforce was able to access his dimensional plane, as its natural tendency was to fill the relative vacuum of darkness such a dimension of light created. Soon, the Darkforce began to use Gallante to allow it to seep into his world, kidnapping those who could access Darkforce, such as [[Cloak]], [[Shroud]], and [[Quagmire]], and trapping them within its dimension. It also began to flood New York City and envelope those with dark or violent tendencies, unleashing that side of them. Gallante grew mad as the power of the darkness increased, and he succumbed wholeheartedly to the Darkforce, desiring to destroy the world.\n\nWith an army of Darkforce-controlled individuals, Gallante, calling himself Darkling, was confronted by an assemblage of Earth's heroes, including the [[New Warriors]], [[Spider-Man (Peter Parker)|Spider-Man]], and [[Doctor Strange (Stephen Strange)|Doctor Strange]]. The New Warriors' [[Firestar]] and [[Dagger]] were able to use their powers to disrupt Gallante's access to the Darkforce, and the heroes were ultimately able to convince Gallante of the error of his ways. Deciding that to understand himself meant to live with his darkness, Gallante disappeared into the Darkforce dimension, taking its residual energies with him.\n\nGallante was able to return to Earth by way of a mask once used by the villain [[Asylum (unrevealed)|Asylum]]. A gang member found the mask and donned it, overwhelmed by the perception it gave him into the darkness within the psyche of those around him. As the Darkforce exuded from the mask and consumed him, Gallante had taken his place. Taking the identity of Asylum for himself, Gallante sought out the former Asylum’s teammates, [[Psionex]], and took on the role of their new leader. The team was determined to use their abilities to clean up New York City as their newest superhuman champions. \n\nUnfortunately, Asylum led Psionex to attack a group of supposed gang members that merely turned out to be youth playing with toy guns. Before realizing this mistake, Asylum forced a child into the Darkforce Dimension to face the darkness within him, and the boy emerged dead. Distraught that his powers would accidentally cause the death of an innocent, Gallante fled and was pursued by this teammates, who were determined to make Gallante face justice (although most were pursuing him so that they themselves would not be implicated in the charges). During their conflict, they were confronted by the New Warriors, who managed to disrupt Gallante’s connection to the Darkforce Dimension in order to capture him. They convinced him that vigilantes shouldn’t be above the law, and he needed to be accountable even for an accidental death. Asylum was remanded to the police, and Psionex was given over to its creators, the company Genetech, for custody.  \n\nMonths later, [[Baron Zemo (Helmut Zemo)|Baron Zemo]] sought out Gallante in his mental ward, sending members of the [[Thunderbolts]] to recruit Asylum so that they could use his access to the Darkforce Dimension to rescue the [[Smuggler (Conrad Josten)|Smuggler]]. Since the Thunderbolts support of the [[Civil War|Superhuman Registration Act]], Asylum remained with the team.",
        "categories": [
            " Villains",
            " Mutants",
            " Thunderbolts"
        ]
    }
}