{
    "id": 1010874,
    "name": "Slyde",
    "description": "A scientist at Beemont Manufacturing, Jalome Beacher created a chemical that could be used to coat a surface and thereby eliminate all friction between it and any other object, which he used, after being downsized, to rob banks and his former employers.",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/2/90/4c0035a51844b",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010874",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010874/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010874/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010874/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010874/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010874/slyde?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Slyde?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Jalome Beacher",
        "identity": "Secret",
        "occupation": "Former criminal, chemical engineer",
        "place_of_birth": "",
        "groups": "Former agent of [[Hydra]], formerly [[Masters of Evil]], [[Thunderbolts Army]]",
        "citizenship": "U.S.A.",
        "education": "Unrevealed",
        "aliases": "None",
        "relatives": "Matt Beacher (Sluyde, half brother, deceased)",
        "height": "5’11”",
        "weight": "170 lbs.",
        "eyes": "Brown",
        "hair": "Black",
        "powers": "None",
        "abilities": "Beacher is a skilled chemist.",
        "weapons": "Slyde briefly used conventional weaponry, such as a katana blade and throwing stars, though he was not particularly skilled with either.",
        "paraphernalia": "The Slyde costume is covered with an experimental, friction-less substance which provides its wearer with protection against grappling attacks or against ensnarement (such as Spider-Man's webbing). It also provides him with some degree of protection against physical attacks. Beacher can use his friction-less shoes to run at upwards of 30 m.p.h. with extreme maneuverability. During the brief time he was resurrected as an agent of Hydra, Slyde used rocket boots in order to fly.",
        "debut": "Amazing Spider-Man #272 (1986)",
        "origin": "Amazing Spider-Man #272 (1986)",
        "significant_issues": "Created costume to become thief and gain revenge on Rockwall, double-crossed the D.A. (Amazing Spider-Man 272, 1986); fought Spider-Man in Atlantic City (Web of Spider-Man 23, 1987); hired Luke Cage to help rescue brother from Maggia (Spider-Man Unlimited #6, 1994); appeared with Masters of Evil (Thunderbolts #24-25, 1998); apprehended by Spider-Man during mid-life crisis (Spider-Man Unlimited #1, 2004); Matt in Slyde costume killed and resurrected by Hydra, killed again by Wolverine (Wolverine 26-27, 2005); Jalome killed by Underworld (Civil War: War Crimes, 2006)",
        "main_image": "slyde555.jpg",
        "bio_text": "A scientist at Beemont Manufacturing, Jalome Beacher created a chemical that could be used to coat a surface and thereby eliminate all friction between it and any other object. Unfortunately, his department was closed after a larger corporation bought out Beemont, and Beacher found himself downsized by the new management, Mr. Rockwall. Since his invention was never unveiled, Beacher decided to open his own manufacturing plant based on the non-stick chemical, but he needed funds for a sizable down payment. He used his chemical to create a costumed identity for himself and began robbing banks as Slyde. Not even [[Spider-Man (Peter Parker)|Spider-Man]] nor the police could stop him! Perhaps he could even steal from the new management of Beemont, forcing Rockwall out of business?",
        "bio": "A scientist at Beemont Manufacturing, Jalome Beacher created a chemical that could be used to coat a surface and thereby eliminate all friction between it and any other object. Unfortunately, his department was closed after a larger corporation bought out Beemont, and Beacher found himself downsized by the new management, Mr. Rockwall. Since his invention was never unveiled, Beacher decided to open his own manufacturing plant based on the non-stick chemical, but he needed funds for a sizable down payment. He used his chemical to create a costumed identity for himself and began robbing banks as Slyde. Not even [[Spider-Man (Peter Parker)|Spider-Man]] nor the police could stop him! Perhaps he could even steal from the new management of Beemont, forcing Rockwall out of business? \n\nInstead of stealing money, Slyde stumbled upon evidence that proved Rockwall was using the company as a money laundering operation. Slyde blackmailed Rockwall for a sizable amount of money, and the two agreed to meet. On one side, Rockwall stood with his hired goons in ambush. On the other, Slyde had secretly contacted the District Attorney to turn Rockwall in. On yet another side, Spider-Man was on hand, having discovered the plan. In the resulting confusion, Slyde swooped in, taking the ransom money and sliding away, leaving Rockwall, Spider-Man, and the authorities behind. \n\nSpider-Man next tangled with Slyde months later in Atlantic City. Slyde was on the trail of money exchanges brokered by financier Carl Jenkins, and he stole a sizable amount. Spider-Man inadvertently encountered him, as he was in the area helping his [[Parker, May (Aunt May)|Aunt May]] and her friend [[Lubensky, Nathan|Nathan Lubensky]] at the time. He forced Slyde to abandon the money in order to flee.\n\nOnce, Slyde ran afoul of the [[Maggia]]. He learned the hard way not to steal from their associates: the Maggia had his brother Matt kidnapped! Slyde sought help from [[Cage, Luke|Luke Cage]], Hero for Hire, paying him to help save his brother. The two were also joined by Spider-Man, who happened upon them, and they were successful in rescuing his brother.   \n\nSlyde also appeared as a member of the [[Crimson Cowl (Justine Hammer)|Crimson Cowl]]'s [[Masters of Evil]], in their plot to get rich through a blackmail scheme using global weather control. The team was defeated and apprehended by the [[Thunderbolts]], and Slyde was among those remanded to custody.\n\nSpider-Man caught Slyde robbing banks once again, and quickly apprehended the villain. However, even as he was being remanded, Slyde considered this a victory for himself, as he felt he did well for a man of his age, over forty. \n\nWith Jalome in jail, Matt \"borrowed\" the Slyde costume. The [[Spot]] contacted Slyde, and arranged a meeting. However, when the Spot arrived, he found a brainwashed [[Elektra]] and ninja of the Hand standing over Matt’s dead body, and he was quickly captured as well. The Spot and Slyde were resurrected by the Hand to join Hydra’s army of superhumans, all orchestrated by the [[Gorgon (Tomi Shishido)|Gorgon]]. Slyde was among the sixty to seventy agents led by Elektra against [[S.H.I.E.L.D.]], but he was felled by S.H.I.E.L.D.’s ally, [[Wolverine (James Howlett)|Wolverine]]. \n\nJalome was recently seen being recruited by [[Hammerhead]] to join a new criminal movement to take down the heroes and usurp the imprisoned [[Kingpin]]'s criminal empire at the height of Civil War. After refusing to follow Hammerhead's lead and inferring that he would inform the Kingpin of Hammerhead's plans, Slyde was shot and killed by [[Underworld]].",
        "categories": [
            "People",
            "Spider-Man",
            "Villains",
            "Deceased",
            "Thunderbolts"
        ]
    }
}