{
    "id": 1010855,
    "name": "Solo (James Bourne)",
    "description": "James Bourne was drafted to a top-secret special forces operation where he endured ten months of hard and brutal training to earn his place in the new counter-terrorist group Omega Strike.",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/2/f0/4c7c641408c12",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1010855",
    "comics": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010855/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/10172",
                "name": "Marvel Comics Presents (1988) #88"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/10038",
                "name": "Marvel Comics Presents (1988) #124"
            }
        ],
        "returned": 2
    },
    "series": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010855/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2039",
                "name": "Marvel Comics Presents (1988 - 1995)"
            }
        ],
        "returned": 1
    },
    "stories": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010855/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/22840",
                "name": "Death Flight",
                "type": ""
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/23631",
                "name": "Hero of the People",
                "type": ""
            }
        ],
        "returned": 2
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1010855/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1010855/solo_james_bourne?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Solo_(James_Bourne)?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "James Bourne",
        "aliases": "None",
        "identity": "Known to authorities",
        "occupation": "Counter-terrorist",
        "citizenship": "U.S.A.",
        "place_of_birth": "Unrevealed",
        "relatives": "Unrevealed",
        "groups": "None; formerly [[Six Pack]], [[Omega Strike]], former ally of [[Spider-Man (Peter Parker)|Spider-Man]]",
        "education": "Unrevealed",
        "height": "6'",
        "weight": "200lbs",
        "eyes": "Brown",
        "hair": "Reddish Brown",
        "powers": "Solo is able to teleport himself and a certain amount of mass which is in contact with him, such as his weapons. There appears to be a limit to the distance and number of teleports Solo can achieve in a given time span. The longer the distance over which Solo teleports, the more difficult it is for him to make the \"jump\".",
        "abilities": "Solo is a master of many forms of hand-to-hand combat. He is also highly adept in the use of conventional weapons and firearms.",
        "weapons": "Submachine guns, other projectile weapons, and grenades.",
        "paraphernalia": "His costume is bulletproof",
        "debut": "Web of Spider-Man #19 (1986)",
        "origin": "Solo #1 (1994)",
        "significant_issues": "teamed with Spider-Man against Taskmaster (Amazing Spider-Man #367, 1992); turned in by Spider-Man (Solo #03, 1994); turned himself in after killing a civilian (Solo #04, 1994); worked with Six Pack (Cable & Deadpool #7, 2004); captured by S.H.I.E.L.D. as unregistered combatant (Civil War: Front Line #04, 2006)",
        "main_image": "solo.jpg",
        "bio_text": "Very little is known about James Bourne before he joined the army and was stationed in Germany. There he met and fell in love with a young woman named [[Wallace, Melinda|Melinda Wallace]]. The love was short lived, however, as Melinda was killed by during a terrorist attack in a nearby town. James took her death very hard. A few months after her funeral he was drafted to a top-secret special forces operation. He endured ten months of hard and brutal training and earned his place in the new counter-terrorist group [[Omega Strike]], lead by [[Tessler, Emil|Emil Tessler]]. They also had several surgical operations wherein their brains were implanted with Cyber-Chips that made teleporting possible. Many people didn’t survive the operation, because the brain rejected the implant. During this time, Bourne had grown very close to one of his squad members, [[Cygnus|Rowena Maclean]].",
        "bio": "Very little is known about James Bourne before he joined the army and was stationed in Germany. There he met and fell in love with a young woman named [[Wallace, Melinda|Melinda Wallace]]. The love was short lived, however, as Melinda was killed by during a terrorist attack in a nearby town. James took her death very hard. A few months after her funeral he was drafted to a top-secret special forces operation. He endured ten months of hard and brutal training and earned his place in the new counter-terrorist group [[Omega Strike]], lead by [[Tessler, Emil|Emil Tessler]]. They also had several surgical operations wherein their brains were implanted with Cyber-Chips that made teleporting possible. Many people didn’t survive the operation, because the brain rejected the implant. During this time, Bourne had grown very close to one of his squad members, [[Cygnus|Rowena Maclean]].\n\nTheir first assignment was a mission to Italy, where some terrorists had hijacked a plane. James was given the lead of the hostage recovery unit while Rowena and [[Deathstorm|Gabriel Grant]] lead the terrorist termination unit. They jumped into the plane, but all of James’ team were killed within seconds; James himself was also hit, but managed to teleport to the passenger section of the plane. When he arrived he saw that Grant had killed all of the terrorists, hostages and even his teammates, save for Rowena. James demanded an explanation; Grant told him that he and Tessler were paid to make the mission a failure. Grant also told him that they were going to start their own terrorist organization when they had collected enough money.  He then shot James, hitting him in the stomach. Rowena tried to stop him, but it was too late. Rowena told James that she didn’t have a choice and that she will always love him. She also hung a golden necklace around his neck before she and Grant teleported away. Soon after they left James managed to teleport away to safety. Shortly after he healed he tried to find Rowena, but discovered that she and Grant had died in a plane crash and that Grant had even ruined his reputation by leaving false evidence that incriminated him. At that moment James Bourne died and Solo was born.\n\nIn his career he has worked with [[Spider-Man (Peter Parker)|Spider-Man]], [[Captain America (Steve Rogers)|Captain America]] and [[Silver Sable]] to capture [[Sabretooth]] and to stop [[Ultimatum]]. He was fooled sometime later by [[Mysterio (Quentin Beck)|Mysterio]] to think that Spider-Man was [[Doctor Octopus (Otto Octavius)|Doctor Octopus]]. He was about to kill him, but was stopped by [[Commando (Frank Bohannan)|Cyborg X]]. He later joined forces with the heroes Spider-Man, [[Deathlok (Michael Collins)|Deathlok]], [[Fantastic Four]], [[Ghost Rider (Daniel Ketch)|Ghost Rider]], [[Nova (Richard Rider)|Nova]] and [[Hulk (Bruce Banner)|Hulk]] to stop [[Sinister Six]]. He helped Spider-Man once again when they fought against [[Taskmaster]], [[Blood Spider]], [[Death-shield]] and [[Jagged Bow]]. They managed to defeat three of the four, but Taskmaster managed to escape. Before Solo teleported away he told Spider-Man that the [[Red Skull (Johann Shmidt)|Red Skull]] planned to disturb the America Day celebration in New York. Shortly after his last encounter of Spider-Man, Solo had run in with [[Fury, Nick|Nick Fury]] when he was stopping [[Viper (Madame Hydra)|Viper]] from stealing nuclear missiles. Fury didn’t really appreciate Solo’s help and blamed him of Viper’s escape. Solo didn’t like Fury’s attitude and teleported away leaving him alone in the factory.\n\nThe next time Solo resurfaced was against the terrorist organization [[A.R.E.S.]], where he also briefly met [[Black Cat]] as she was stealing a painting. Solo soon met a ghost of his past named Gabriel Grant, now calling himself Deathstorm. He had staged his own death, and was now running his own terrorist organization A.R.E.S.. The two fought for a while, but eventually Deathstorm escaped. Solo tracked him to Manhattan, where he found Rowena stealing Omega Strikes files. He didn’t have to time to react before Rowena teleported away. He turned around and saw a bomb on the table and quickly teleported himself out of there. He got back to his hideout and pulled out the old Omega Strike files from his computer. His memories overwhelmed him and he burst into tears, holding the necklace Rowena gave him in his fist. After he pulled himself together, he vowed to save Rowena anyway necessary. He soon saw a news report about Spider-Man fighting A.R.E.S.’s terrorists, and he teleported in to join the fight. They quickly won the fight, but Deathstorm managed to escape again. Spider-Man was devastated that so many innocent people had died, and turned his frustration on Solo saying that he is as bad as they are. He tried to stop Solo from leaving, but he wasn’t quick enough. Solo and Spider-Man intervened in A.R.E.S.’s operations several times in the future. After one of these encounters, Spider-Man decided that he wouldn’t let Solo escape again. He attacked him, eventually defeating Solo and turning him in. But while Solo was being transported he managed to subdue two [[Guardsmen]] who were guarding him and escaped. He tracked A.R.E.S. down and managed to stop Tessler from killing several people. As he was going to shoot Tessler Rowena jumped in the line of fire. Solo asked why she stopped him and Rowena told him that Tessler was his father. Tessler used this confusion to teleport away. When Solo noticed that he followed with Rowena right behind him. They rematerialized again just in time to see Deathstorm break Tessler’s neck. Solo attacked him, but their battle damaged the ship so much that it crashed into the ocean. Deathstorm pulled himself out of the water just to see Solo aiming at him holding unconscious Rowena on his other arm. Solo fired, hitting Deathstorm and killing him just before he could teleport away. But the bullet went through him and hit a civilian woman behind him, accidentally killing her. Spider-Man saw this happen and once again accused Solo to be as bad the terrorist he hunts. Solo then quietly waited the police to arrive and allowed them to arrest him, even though he knew that he couldn’t amend for the death of the innocent girl.\n\nIt’s not known how long Solo was in jail, but the next time he appeared he was ready to get back to his old ways. His first target was [[Wolverine (James Howlett)|Wolverine]], but was then convinced that he wasn’t a threat anymore and let him live. He wasn’t seen for while after that, but was apparently drafted to the newly formed [[Six Pack]] and was sent after [[Cable]]. After a short fight Cable promised to pay them more money than S.H.I.E.L.D., so they decided to join his side. Soon after the [[X-Men]] arrived trying to destroy the island, but Six Pack managed to keep them back. Later on, the [[Silver Surfer]] appeared, attacking Cable and interrupting the fight. The X-Men and Six Pack worked together to save the people on the now falling island. Six Pack soon tracked down Cable’s hideout, finding him very badly injured; but before they realized it, they were sucked inside his mind. They stayed trapped there in a mad tea party until [[Deadpool]], with help of [[Fixer (Paul Norbert Ebersol)|Fixer]], saved Cable’s life. Cable then transferred Six Pack’s minds back to their own bodies.\n\nRecently, Solo seems to have resigned from Six Pack and, due to the events of the [[Civil War|Superhuman Registration Act]], joined alongside other heroes and villains such as [[Typeface]] and [[Battlestar]] who went underground in opposition to the Act. They were soon joined by many other heroes and villains who opposed the act. Solo, Typeface, Battlestar, and many others were captured by S.H.I.E.L.D. during a raid.\n\nDuring Norman Osbourne's Dark Reign, Solo is hired to take out Bullseye (who is acting under the guise of Hawkeye in Osbourne's Dark Avengers) by a terrorist cell called P.I.S.F. (Peace Through Superior Firepower), later revealed to be run by Bullseye's presumed-dead father.  In a attempt to recapture an escaping Bullseye, Solo takes a bullet in the back, cleverly ricocheted off several walls to hit him as he teleported behind Bullseye.  However, he probably survived, as he teleported away again as Bullseye tried to make a kill shot to the head.",
        "categories": [
            "Heroes",
            "Spider-Man",
            "Civil War",
            "Spider-Man Villains"
        ]
    }
}