{
    "id": 1011019,
    "name": "Molecule Man",
    "description": "",
    "modified": "2013-11-20T17:15:03-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/5/d0/528d33c2a72b2",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011019",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011019/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011019/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011019/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011019/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011019/molecule_man?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Molecule_Man?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Owen Reece",
        "identity": "Secret",
        "occupation": "Criminal; (formerly) laboratory technician",
        "place_of_birth": "Brooklyn, New York",
        "groups": "Unnamed team on Battleworld",
        "citizenship": "U.S.A.",
        "education": "Unrevealed",
        "aliases": "None",
        "relatives": "Unnamed mother (deceased)",
        "height": "5’7”",
        "weight": "140 lbs.",
        "eyes": "Brown",
        "hair": "Brown",
        "abilities": "Some scientific skills",
        "weapons": "None",
        "paraphernalia": "Owen once carried a wand that he believed was necessary to focus his power, although he was later proved to be merely subconsciously limiting himself.",
        "powers": "Owen Reece has the phenomenal ability to control all matter on a molecular level.  His typical uses for this power has been to mold matter to his whim, disrupt matter into dust or liquid, and convert one substance into another.  He also uses the power to fly and control complex machines.  The full range of Reece's power remains unknown, but he was able with the help of the Silver Surfer to affect the Earth on a planet-wide scale.  Originally, he limited himself to being able to affect only inorganic materials, but there truly seems to be no limit to his power.  Once, he proved able to store his life force in his wand, then mentally take over anyone who handled it, even creating a new body for himself.",
        "debut": "Fantastic Four #20",
        "origin": "Fantastic Four #20",
        "significant_issues": "",
        "main_image": "Molecman.jpg",
        "bio_text": "The Molecule Man started out as a lowly laboratory technician who worked at the Acme Atomic Corp.  But one day, while Owen Reece was bemoaning his position in life as a nobody, a cog in the wheels of the corporation, he became distracted enough to make a mistake that would forever change his life.  The atomic machine he worked on blasted him with radiation, and he survived, but the accident gave him power over the very building blocks of existence.  Without even knowing his name, the head of the corporation fired him, but Owen used his new found powers to freeze him solid, using a wand that he believed he needed to focus his powers.",
        "bio": "The Molecule Man started out as a lowly laboratory technician who worked at the Acme Atomic Corp.  But one day, while Owen Reece was bemoaning his position in life as a nobody, a cog in the wheels of the corporation, he became distracted enough to make a mistake that would forever change his life.  The atomic machine he worked on blasted him with radiation, and he survived, but the accident gave him power over the very building blocks of existence.  Without even knowing his name, the head of the corporation fired him, but Owen used his new found powers to freeze him solid, using a wand that he believed he needed to focus his powers.\n\nReece then took control of the [[Fantastic Four|Fantastic Four’s]] [[Baxter Building]], and tore it from the ground, hovering along with it over Times Square.  He announced that he was taking over the city and would become the only law.  Even the [[Fantastic Four]], who were asked to stop him by [[Uatu The Watcher]], were unable to beat him, and were forced to flee in order to come up with a new plan.  But [[Mister Fantastic]] soon discovered that Reece could seemingly not control organic material and enlisted the help of [[Masters, Alicia|Alicia Masters]], the [[Thing (Benjamin Grimm)|Thing’s]] girlfriend, to cover the four in plaster and pass them off as statues.  Reece came after them and tried to manipulate the statues, but the feedback from trying to affect their organic molecules caused him intense pain.  Uatu then appeared and trapped him within another dimension to protect Earth from his power.\n\nTo pass the time, Owen created a companion, using his powers to fashion a fully-conscious being that he called his son.  However, Owen found that time passed at an accelerated rate in his new world and soon died of old age.  Owen’s “son” took up the Molecule Man’s wand and found it contained all his power.  Calling himself the new Molecule Man, the being used the wand to escape back to Earth, hoping to avenge his father.  He sought out the Thing of the Fantastic Four, battling him until the Thing managed to separate him from the wand.  Apparently, the wand was necessary to maintain his existence, and the new Molecule Man disintegrated.\n \nIn fact, Owen Reece had not died, but managed to transfer his consciousness and powers into the wand his \"son\" carried.  He could overpower the minds of whoever touched the wand and take control of their bodies, temporarily reviving the Molecule Man each time.  The wand passed through the hands of a succession of holders until the [[Silver Surfer]] happened upon it, sensing its great power.  When he casually dismissed it, however, Reece's mind finally proved able to recreate his body, power and all.  His encounter with the Surfer convinced Owen that he had always failed because he had no purpose beyond petty tantrums.  Inspired by the Surfer’s tale, Owen decided he would devour the Earth similar to [[Galactus]].  The Surfer sent for help, and the [[Avengers]] arrived to confront him.  The Avengers were easily defeated, as the Molecule Man disintegrated [[Captain America (Steve Rogers)|Captain America’s]] shield, [[Iron Man (Tony Stark)|Iron Man’s]] armor, [[Thor (Thor Odinson)|Thor’s]] hammer, and even the Silver Surfer’s surfboard.  Ultimately, it was [[Tigra]] who managed to talk him down, giving Owen the first heart-to-heart he had heard in years and convincing him to give himself up and seek psychiatric help.\n\nOwen Reece did so, and soon began seek out more conventional goals: true love, friendship, and a good home.  Instead, however, the Molecule Man was abducted to [[Battleworld]], the planet created by the Beyonder (now, the [[Maker]]), as part of the small army of criminal superhuman beings that were to engage in the first of the [[Secret Wars]].  He only joined the other supervillains after some persuasive words by [[Doctor Doom (Victor von Doom)|Doctor Doom]], and fought the assembled superheroes who were also brought to Battleworld.  During the course of the war, Owen and [[Volcana]] fell in love.  When Doom succeeded in stealing the power of the Beyonder for himself, Owen thought Doom had abandoned them all and confronted Doom, threatening to kill him.  But Doom helped Reece realize his powers were only limited by his own sense of unworthiness--his power was greater than he had believed and could even effect organic materials.  No longer angry at Doom (who eventually lost his new power), Owen used his powers to transport himself, Volcana, and most of the criminals, along with the entire portion of the city of Denver, back to Earth. \n\nOn Earth, Owen and Volcana began a quiet life living together, and Owen took a new job as a worker in an atomic plant.  This bliss was not to last, as the Beyonder returned to Earth to seek emotional fulfillment but failed, declaring he would destroy the multiverse.  Owen was sought out by the assembled heroes, and he tried to destroy the Beyonder, but the Beyonder's immense power far surpassed even Owen’s own, and Owen was left exhausted.  Finally, the Beyonder unleashed an immensely powerful blast of energy to destroy Owen and his allies, sufficient even to rip open Earth's crust and threaten incredible planetwide instability.  The Molecule Man used his power to shield himself and his allies and remove every living thing from the path of the blast to safety, but the cost of doing so seemed to severely injure him internally.\n\nThe Beyonder then created a complex machine to transform himself into a mortal being with his full power.  The Molecule Man and his allies found the machine, and Owen, but they could not take the chance that the newly reborn Beyonder would not someday destroy the multiverse, and decided to kill him while he was incubating.  Owen wrecked the machine, causing the infant's death, and diverted the Beyonder's immense power, released by the machine, into the dimension from which the Beyonder had originally come.  The injured Molecule Man and the Silver Surfer, uniting their power temporarily, repaired all the damage done to the Earth.  Owen then claimed his powers had been burned out, so as to once more hide away from the heroes.  He returned to live quietly with Volcana in their Denver suburb.  Among his allies, only Volcana and the Silver Surfer knew that Owen still had his powers.\n\nMonths later, Owen was confronted by [[Kubik]], a being created from the [[Cosmic Cube]].  Kubik revealed to Owen that his powers stemmed from similar energies, as did the Beyonder, who Kubik also confronted and nearly destroyed most of the Beyonder's pet reality.  Kubik might have destroyed the Beyonder, but the alien [[Shaper of Worlds]] called him to stop the battle.  Under the Shaper's guidance, Kubik, Molecule Man, and the Beyonder realized they shared a common origin, and the Molecule Man and Beyonder physically merged to create a new Cosmic Cube-- their powers were actually an intelligence like Kubik's that was split during the Molecule Man's origin.  Owen was mutated into the Molecule Man while the remaining energy developed sentience to become the Beyonder.  Kubik left with the Shaper into space to oversee the development of this new Cube, which might someday hatch a being similar to Kubik. \n\nVolcana, who believed Owen to be dead after merging into the Cube, was actually secretly imbued by Owen with his power moments before the transformation.  She tried going through life as normal, but soon found herself exhibiting strange new aspects of her powers, due to the power of the Molecule Man within her.\n\nEventually, the Cube separated Owen’s essence from his power, rejected him and returned him to Earth, powerless.  Volcana soon stumbled upon Owen, who was living in squalor at his old apartment.  He knew he was powerless and felt it better to live in anonymity than to have nothing to offer his true love.  Before they could make up, the criminal organization [[A.I.M.]], which had been tracking Volcana due to her power fluctuations, attacked the two through their agent [[Klaw]].  Reece's powers, within her, evolved to allow her to wish his powers returned to him.  Now once again the Molecule Man, Owen quickly defeated Klaw, but Volcana would not return to him, seeing him as a bully and too dependant on his power to attempt to try a relationship.  Owen left her, still professing his love and vowing to prove it to her someday.",
        "categories": [
            " Fantastic Four",
            " Avengers",
            " Villains"
        ]
    }
}