{
    "id": 1011067,
    "name": "Wild Pack",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/6/50/4c0030ee76e95",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011067",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011067/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011067/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011067/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011067/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011067/wild_pack?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Wild_Pack?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "base_of_operations": "None; Formerly Wild Pack Headquarters, Symkaria; Formerly Symkarian Embassy, New York City",
        "debut": "Amazing Spider-man #265 (1985)",
        "origin": "Silver Sable and The Wild Pack #9 (1993)",
        "significant_issues": "Participated in the Infinity War, Fought Sandman's and Dr. Doom's Doppleganger (Silver Sable and The Wild Pack #4 and 5, 1992); Team offically Dissloved (Sable and Fortune #1, 2006)",
        "current_members": "None",
        "former_members": "[[Battlestar]], [[Crippler]], [[Fin (unrevealed)|Fin]], [[Man-Eater]], [[Silver Sable]] (leader), Ernst Sublinovia (former leader), [[Sandman (William Baker)|Sandman]]",
        "other_members": "[[Deathlok (Michael Collins)|Deathlok]],[[Paladin]], [[Prowler (Hobie Brown)|Prowler]], [[Rocket Racer]], [[Spider-Man (Peter Parker)|Spider-Man]], [[Hawkeye (Clint Barton)|Hawkeye]], [[Peregrine|Le Peregrine]] (all freelance operatives)",
        "main_image": "WildPack.jpg",
        "bio_text": "The European dilettante and mercenary known as [[Silver Sable]], head of Silver Sable International and ruler of the Balkan nation Symkaria, once led a group known as the Wild Pack. The Wild Pack was best known for the apprehension of international criminals and the recovery of stolen property for a wide spectrum of clients from major insurance companies to small nations. Sable typically led the team of agents into the field, although she had been known to parcel smaller-scale contracts to reduced versions of the Wild Pack such as the Delta Team.  While typically comprised of elite mercenary soldiers, Sable would occasionally hire superhuman freelance operatives to serve on the Pack, such as [[Spider-Man (Peter Parker)|Spider-Man]], the [[Sandman (William Baker)|Sandman]], [[Rocket Racer]] and the [[Prowler (Hobie Brown)|Prowler]]. Alternatively, Sable has twice formed elite versions of the Wild Pack, comprising them of superhuman agents-- first with the [[Outlaws]] and, later, the [[Intruders]].",
        "bio": "The European dilettante and mercenary known as [[Silver Sable]], head of Silver Sable International and ruler of the Balkan nation Symkaria, once led a group known as the Wild Pack. The Wild Pack was best known for the apprehension of international criminals and the recovery of stolen property for a wide spectrum of clients from major insurance companies to small nations. Sable typically led the team of agents into the field, although she had been known to parcel smaller-scale contracts to reduced versions of the Wild Pack such as the Delta Team.  While typically comprised of elite mercenary soldiers, Sable would occasionally hire superhuman freelance operatives to serve on the Pack, such as [[Spider-Man (Peter Parker)|Spider-Man]], the [[Sandman (William Baker)|Sandman]], [[Rocket Racer]] and the [[Prowler (Hobie Brown)|Prowler]]. Alternatively, Sable has twice formed elite versions of the Wild Pack, comprising them of superhuman agents-- first with the [[Outlaws]] and, later, the [[Intruders]].\n\nFirst formed by Sable's father, Ernst Sublinovia, to hunt down Nazi war criminals, the Wild Pack eventually gained the approval of the Symkarian government.  As a young girl, Silver Sable witnessed her mother’s death at the hands of terrorists, and it was ever since that she was determined to take over leadership of the group. She joined her father's team at the age of 17 and was soon promoted to second-in-command. Later, her father embarked alone to track down his wife's killer. Silver and the Wild Pack caught up with him in time to see the villain kill her father and escape with the body. Believing her father dead, Sable assumed command of the Wild Pack. When the number of war criminals declined, Sable turned her Wild Pack toward more general mercenary activities and began selling her services around the world. In fact, the group became the major source of outside income for Symkaria.\n\nSable and the Wild Pack crossed paths with the many heroes over the years, such as Spider-Man and [[Paladin]], and later, [[Hawkeye (Clint Barton)|Hawkeye]] and [[Peregrine|Le Peregine]]. After a number of encounters with superhuman agents, vigilantes, and enemeis, Sable began to use them in future assignments. One of her first recruits was the villain Sandman, who was attempting at the time to move beyond his criminal ways. Later, Sable decided to create an elite version of the Wild Pack, the Outlaws. The Outlaws featured Sable-associates Sandman, Rocket Racer, Will O' Wisp, Prowler, and Paladin. The Outlaws encountered Spider-Man and the team [[Excalibur]] in the course of their adventures, but was soon disbanded in favor of the traditional Wild Pack.\n\nSilver Sable continued to lead her Wild Pack in mercenary endeavors. Sable also hired the hero [[Battlestar]] to serve on the team. When the team began attracting superhuman associates such as the [[Fin (unrevealed)|Fin]] and [[Man-Eater]], Sable formed another elite offshoot of the Wild Pack, called the Intruders. The Intruders were led by Sandman and often engaged in assignments independently of the Wild Pack. Although never officially disbanded, the Intruders presumably were dissolved by Silver Sable several months later.\n\nOnce, Silver Sable stepped down from leadership of the Wild Pack. This was during a period of soul-searching after Sable was believed to be pregnant, although this was actually due to a computer error. During this time, the Wild Pack was led by Sable's father, who in fact did not die, but was rescued from his captors by Sable and the Wild Pack. As Sable monitored the team's progress, however, she felt compelled to step in and take an active hand in leadership once more, stating that the team was like a family to her and was where she belonged.\n\nMore recently, the Wild Pack had become more and more unstable. The elite agents which worked with Sable for a long time had gone their separate ways. Sable was left to lead a team that was becoming increasingly lazy and incompetent. After four unsuccessful missions and the betrayal of several agents, Sable decided that the group had become too broken and fractured to maintain. Bringing her agents together one last time, Sable informed them that she was going into retirement and that the Pack themselves would be dissolved. \n\n* Note: The [[Six Pack]], a mercenary team founded by [[Cable]], used initially the name Wild Pack, however, the two groups do not have association.",
        "categories": [
            "Heroes",
            "International",
            "Spider-Man"
        ]
    }
}