{
    "id": 1011155,
    "name": "Red Shift",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/40/image_not_available",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011155",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011155/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011155/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011155/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011155/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011155/red_shift?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Red_Shift?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Unrevealed",
        "identity": "Secret",
        "aliases": "Unrevealed",
        "occupation": "Former herald of [[Galactus]]",
        "place_of_birth": "Unrevealed",
        "groups": "Formerly [[Heralds of Galactus]]",
        "citizenship": "Unrevealed",
        "education": "Unrevealed",
        "relatives": "None",
        "height": "6'4\"",
        "weight": "250 lbs.",
        "eyes": "Solid white (no visible iris or pupil)",
        "hair": "Unrevealed",
        "powers": "Red Shift has all the powers and abilities of one who possesses the power cosmic with the added talent of being able to open dimensional portals. Red Shift can use his portals to either trap an enemy, pull items, such as meteors, through to attack his opponents, or redirect attacks meant for him back at his rivals.",
        "weapons": "Red Shift carries two swords that can channel the power cosmic and be used either for combat or to rip open dimensional passageways",
        "paraphernalia": "None",
        "debut": "Galactus: The Devourer limited series #1 (1999)",
        "origin": "Unrevealed",
        "significant_issues": "Galactus: The Devourer #1-2, Silver Surfer: Annihilation #2-3, Annihilation #1-3",
        "main_image": "Red_Shift_new.jpg",
        "bio_text": "",
        "bio": "Almost nothing is known about the entity called Red Shift except for the fact that he was a herald of the Ravager of Worlds, [[Galactus]]. He first came into contact with the [[Silver Surfer]] and [[Masters, Alicia|Alicia Masters]] at a time when she was in possession of a suit of armor which gave her \"quantum sight\" and allowed her to manipulate cosmic energy. His master was insistent on devouring Earth in order to satisfy his hunger, and after the Silver Surfer detected the power cosmic within this new herald, he tried reasoning with him as to why he shouldn’t lead Galactus to feed on Earth. Red Shift would hear nothing of it and left the Surfer no choice but to attack. Alicia was injured during the initial assault, and the Surfer gave her his surfboard so that she may journey back home to heal out of harm’s way. Red Shift allowed Alicia to go as he opened a portal to reveal a black hole intended to ensnare the Silver Surfer, but its gravity pulled both of them inside. The struggle between the two heralds continued, and in a desperate attempt to escape the black hole, the Silver Surfer surprised his foe with an explosion of cosmic energy that separated Red Shift from his swords. Without his swords to reopen the portal, Red Shift became the prisoner of his own trap while the Surfer managed to barely escape. \n\nHowever, Red Shift somehow freed himself from the black hole and was present at the time the [[Annihilation|Annihilation Wave]] started its path of destruction across the universe. Red Shift is currently allied with [[Firelord (Pyreus Kril)|Firelord]] and [[Stardust]] in opposing the forces of [[Annihilus]]. While in battle with Anihilus's forces on the planet Daedalus 5, Red Shift and Stardust detected the presence of Galactus, who had been turned into a weapon by [[Thanos]]. In order to give [[Nova (Richard Rider)|Nova]] and his remaining forces time to evacuate, Red Shift and Stardust seemingly sacrificed themselves by delaying the destruction of Daedalus 5 by temporarily holding back the cosmic energies of Galactus before they could consume the planet. Red Shift has not been seen since the incident and is presumed deceased.  \n\n* Note: During his first encounter with the Silver Surfer, Red Shift mentioned that he served two masters, and the one who gave him his power was the one who gave him his name. It is unknown who is responsible for Red Shift's name and powers, but even though he served Galactus, Red Shift’s other master has yet to be revealed.",
        "categories": [
            "Villains",
            "Cosmic",
            "Annihilation",
            "Deceased"
        ]
    }
}