{
    "id": 1011266,
    "name": "Adam Destine",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/40/image_not_available",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011266",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011266/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011266/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011266/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011266/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011266/adam_destine?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Destine,_Adam?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Adam Destine",
        "identity": "Secret",
        "occupation": "None; former soldier",
        "place_of_birth": "Ravenscroft, England of the 1100’s",
        "groups": "[[ClanDestine]]",
        "citizenship": "U.K.",
        "education": "Unrevealed",
        "aliases": "Adam of Ravenscroft",
        "relatives": "[[Destine, Albert|Albert Destine]] (son), [[Argent|Argent (Samantha Destine)]] (daughter), [[Cap'n Oz|Cap’n Oz (William Destine)]] (son), [[Crimson Crusader|Crimson Crusader (Rory Destine)]] (son), [[Cuckoo (Kay Cera)]] (daughter), [[Flo Destine]] (daughter, deceased), [[Gracie Destine]] (daughter, deceased), [[Hex|Hex (Dominic Destine)]] (son), [[Imp|Imp (Pandora Destine)]] (daughter), [[Maurice Destine]] (son, deceased), [[Destine, Newton|Newton Destine]] (son), [[Vincent Destine]] (son, deceased), [[Wallop|Wallop (Walter Destine)]] (son)",
        "height": "",
        "weight": "",
        "eyes": "Blue",
        "hair": "Blonde",
        "powers": "Blessed by his lover, a [[Glossary:M#magic|magical]] genie, Adam is extremely long-lived, and will age at a very slow rate, making him virtually [[Glossary:I#immortal|immortal]]. Adam was further blessed with the powers of invulnerability. Nothing seems capable of harming him, including the rigors of space. This has caused him to be perceived as somewhat aloof from the world, as he is detached from the normal effects of its stimuli.",
        "abilities": "Hand-to-hand combat, medieval weaponry",
        "weapons": "None",
        "paraphernalia": "None",
        "debut": "ClanDestine #1 (1994)",
        "origin": "ClanDestine #5 (1994)",
        "significant_issues": "The existence of the family is uncovered, several family members are murdered (ClanDestine #1, 1994); returns to Earth after self-imposed exile, leads family against Lenz of A.I.M. (ClanDestine #4, 1995); reveals family origin to Crimson Crusader and Imp (ClanDestine #5, 1995)",
        "main_image": "AdamDestine.jpg",
        "bio_text": "Adam Destine was born Adam of Ravenscroft, a Saxon under Norman rule of England during the 1100's. As a youth, he was working on his family's lands when he fell from a great height onto a scythe. He was believed to have suffered a mortal injury, but instead recovered after meeting a genie, a creature of pure magic, in a near-death encounter and receiving her loving touch. Believed to be blessed for a great destiny, he was given the name Adam Destine. Later, he joined Richard the Lionheart's Crusade in the Holy Lands and impressed into military service, where he soon became the champion of many battles.",
        "bio": "Adam Destine was born Adam of Ravenscroft, a Saxon under Norman rule of England during the 1100's. As a youth, he was working on his family's lands when he fell from a great height onto a scythe. He was believed to have suffered a mortal injury, but instead recovered after meeting a genie, a creature of pure magic, in a near-death encounter and receiving her loving touch. Believed to be blessed for a great destiny, he was given the name Adam Destine. Later, he joined Richard the Lionheart's Crusade in the Holy Lands and impressed into military service, where he soon became the champion of many battles.\n\nAt one point, Adam was captured by Arabian nomads who knew of Adam's destiny. They hoped he might free them from the sorcerer Sujanaa min Raghbah, who used a [[Glossary:M#mystic|mystic]] gem to empower his regime over Persian lands. Adam ultimately confronted Sujanaa, killing him, but was betrayed by the Arabian nomad who first contacted him. In his dying moments, Adam destroyed the mystic gem, which was in reality a prison trapping the genie whom he had fallen in love with. The genie restored Adam and blessed him with powers of invulnerability and immortality, so that they would never be apart again.\n\nFrom this union, children would be born, each blessed with great power and living an extended lifespan due to their heritage. Although not truly on the same plane of existence, Adam's love has contacted him periodically, and over the years, delivered him dozens of children. Dubbed the ClanDestine, many would stay with Adam in their ancestral home, Ravenscroft Manor in England, living a happy life.\n\nUltimately, however, their happiness was shattered sometime in the 1970's by Adam's son Vincent. Although the details remain unknown, Vincent's treacherous deeds quickly forced the family to become divided. Adam felt he was ultimately forced to kill Vincent. Some members sided with Adam, and others were directly opposed to his actions. With Vincent dead, Adam fled from Earth entirely, distraught over his actions and the family woes.\n\nEventually, the Destine children on Earth drifted apart, creating separate identities to avoid compromising questions or falling victim to bigotry and hatred born from fear. This kept a period of stability for the family, as each remained in the life he or she created, maintaining limited contact with the rest of the family.\n\nIn recent years, Adam's twins Rory and Pandora had their powers develop early. Creating [[Glossary:S#secret identity|heroic identities]] for themselves, they performed many acts of heroism until one such adventure caused the existence of the family to be discovered. This led to a chain of events that caused the murder of many Destine family members, which Adam's lover allowed him to glimpse so that he may return to Earth. About the same time, Adam was happened upon by the [[Glossary:A#alien|alien]] [[Silver Surfer]], who helped convinced Adam to return and aided him with his powers. Adam arrived in time to band with others of the family in stopping the threat to themselves, and afterward chose to remain with the family at Ravenscroft Manor once more.",
        "categories": [
            "Heroes",
            "International",
            "Magic"
        ]
    }
}