{
    "id": 1011305,
    "name": "Maximus",
    "description": "",
    "modified": "2013-11-01T16:34:10-0400",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/6/80/52740f7c6f0b7",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011305",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011305/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011305/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011305/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011305/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011305/maximus?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Maximus?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Maximus",
        "aliases": "Maximus the Magnificent, Maximus the Mad",
        "identity": "Secret",
        "occupation": "Would-be Conqueror, former leader of the [[Inhumans]]",
        "citizenship": "[[Attilan]]",
        "place_of_birth": "Unrevealed",
        "relatives": "Agon (father, deceased), Rynda (mother, deceased), [[Black Bolt]] (brother), [[Crystal]], [[Medusa]], [[Gorgon (Inhuman)|Gorgon]], [[Karnak]], [[Triton]] (cousins)",
        "groups": "Royal Family of the Inhumans; former leader of \"Evil Inhumans,\"  and ally of [[Arides|Shatterstar]]",
        "education": "Unrevealed",
        "height": "5' 11\"",
        "weight": "180 lbs.",
        "eyes": "Blue",
        "hair": "Black",
        "powers": "Maximus has the previously oppressed power of limited mind control.",
        "abilities": "Maximus is an inventor of genius level intellect. Despite his mild insanity, he retains an excellent theoretical and practical knowledge of mechanics, physic, and biology. He is particularly gifted at fashioning elaborate machines out of common, simple materials. He has the ability to numb, control, or blank the minds of others, ability to induce short-term amnesia in others, ability to exchange his consciousness with the consciousness of another living being.",
        "weapons": "",
        "paraphernalia": "",
        "debut": "Fantastic Four #47",
        "origin": "Thor #149, Avengers #95",
        "significant_issues": "Fantastic Four #47 (intro)",
        "main_image": "Maximus.jpg",
        "bio_text": "Maximus was briefly the leader of the [[Inhumans]] while his brother, [[Black Bolt]], went into exile, daring not to use his dangerous voice. Maximus believed that the Inhumans were the greater form of life on Earth and he set out to rule them and to destroy humankind to retake the planet. As their leader, he sent his fellow Inhuman [[Gorgon (Inhuman)|Gorgon]] after [[Medusa]], who was suffering with amnesia and working with the [[Frightful Four]]. She ran from Gorgon, but was soon captured when he and the rest of her Inhuman family caught up with her. Together, they returned to [[Attilan]] and faced the crowned Maximus.",
        "bio": "Maximus was briefly the leader of the [[Inhumans]] while his brother, [[Black Bolt]], went into exile, daring not to use his dangerous voice. Maximus believed that the Inhumans were the greater form of life on Earth and he set out to rule them and to destroy humankind to retake the planet. As their leader, he sent his fellow Inhuman [[Gorgon (Inhuman)|Gorgon]] after [[Medusa]], who was suffering with amnesia and working with the [[Frightful Four]]. She ran from Gorgon, but was soon captured when he and the rest of her Inhuman family caught up with her. Together, they returned to [[Attilan]] and faced the crowned Maximus.\n\n\n[[image:Maxmux.jpg|thumb|Maximus in an earlier costume|left]] He announced to his brother that he was the new ruler and that he would marry Medusa, which was the reason he sent Gorgon after her. But Black Bolt struck out and took his crown back, by force, making him the leader of the Inhumans again. Maximus began to fawn over him, explaining that he only kept the crown and Attilan safe for Black Bolt’s return. This fooled no one and Maximus was soon forced to reveal his captive, [[Triton]], who had been brought to him by the [[Seeker]]. Then, while the rest of the Inhumans confronted the [[Fantastic Four]] - who had followed the Seeker back to the Great Refuge - Maximus announced that he would set off his hidden atmo-gun that would create vibrations in the Earth’s atmosphere to kill off only the humans.\n\n\nMaximus fired his weapon, and in disgust his brother dealt him a blow that knocked him off his feet. But soon, his weapon’s ineffectualness proved that humans and Inhumans were originally of the same species. When Medusa explained this to him, he went insane and reversed the power of his atmo-gun, creating a Negative Zone around Attilan, trapping the Inhumans within it for some time while the Fantastic Four escaped. Maximus became lost in his madness, babbling about becoming King one day and creating strange inventions. One of which was a very helpful device that allowed his cousin Triton to breathe air like any other Inhuman. But though he continued to taunt his fellow Inhumans, saying that only he knew how to break the barrier around Attilan, Black Bolt soon revealed the secret that only Maximus and Medusa knew: that he remained silent because the merest whisper from his lips would cause immense destruction. He announced this by destroying the barrier around the city, freeing the Inhumans to once again walk the human world. Then their Council of Elders announced that they wished the royal family to split up and explore the human world, which Black Bolt agreed to, and they sped off. Maximus was left in the city, rambling that he now had his chance to reclaim the crown and rule the Inhumans.\n\nHe later recovered enough of his sanity to use his scientific genius to capture the Inhuman’s royal family and retake the Inhuman crown. Maximus also used [[Lockjaw]], along with the [[Alpha Primitives]], to capture [[Crystal]] - who had become a member of the Fantastic Four - and brought her back to Attilan. He then sent the primitive, android [[Zorr]], created to destroy the Fantastic Four, against them. But Black Bolt soon used his powerful voice to free the royal family, and Crystal destroyed Maximus' massive hypno-ray, which he had intended to use against all of mankind. Maximus quickly escaped in a hidden rocket with a collection of Inhumans loyal to him.",
        "categories": [
            "Villains",
            "Fantastic Four"
        ]
    }
}