{
    "id": 1011144,
    "name": "Glorian",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/8/e0/4c002f81ea1f8",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011144",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011144/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011144/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011144/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011144/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011144/glorian?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Glorian?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "blurb": "",
        "real_name": "Thomas Gideon",
        "aliases": "Glorian, the Dreamer",
        "identity": "Secret",
        "occupation": "Apprentice Dream Shaper",
        "citizenship": "United States of America, Earth",
        "place_of_birth": "Rochester, New York",
        "relatives": "Gregory (father, deceased), Claire (mother, deceased)",
        "groups": "Apprentice to the Shaper of Worlds",
        "education": "Eudcated by private tutors hired by his father and later taught by the Shaper of Worlds",
        "height": "5' 9\"",
        "weight": "155 lbs",
        "eyes": "Pink",
        "hair": "Orange",
        "powers": "He is a reality shifter; Glorian is capable of restructuring pockets of reality to his liking. Glorian can transform reality, in distances of up to ten earth miles for a full day. While the change is real enough, it is often referred to as an illusion because the restructuring is only temporary. This new reality is not an illusion and the results of the transformations are dangerous.",
        "abilities": "Glorian possesses the ability to tap and manipulate tachyons, a group of particles which travel no slower than the speed of light. Glorian uses tachyons to create hyper spatial bridges that resemble arcs of refracted light, or rainbows. Glorian can create these rainbow bridges at will, and by stepping upon them, is able to transport himself at trans-light speeds wherever he wishes to go. He can use the bridge to travel across the surface of a world or between star systems. The maximum distance he can bridge is not yet known. When Glorian steps upon the bridge, the particles of his body are converted to tachyon particle analogues, freeing him from such physical limitations as needing air or food during his travels through space. Glorian can also will the bridge to accept passengers other than him, providing that he is there to \"operate\" it. Glorian is able to shoot force bolts from his hands, and use his abilities to shape reality to defend himself. His full potential is still unknown",
        "weapons": "unrevealed",
        "paraphernalia": "He has possession of a Cosmic Cube",
        "debut": "Thomas Gideon (Fantastic Four #134 (1973):As Glorian (Incredible Hulk #191, 1975)",
        "origin": "Incredible Hulk #190 (1975)",
        "significant_issues": "(Annihilation: Ronan #2-4,2006)",
        "main_image": "Glorian.jpg",
        "bio_text": "Billionaire [[Gideon, Gregory|Gregory Gideon]] and his family were flying in a private jet, when it was struck by a heat pulse blast wave from a Russian nuclear weapons test. The plane crashed, killing all but Gregory and his son Thomas. They were picked up by a Russian traveler, who took them to the hospital.",
        "bio": "Billionaire [[Gideon, Gregory|Gregory Gideon]] and his family were flying in a private jet, when it was struck by a heat pulse blast wave from a Russian nuclear weapons test. The plane crashed, killing all but Gregory and his son Thomas. They were picked up by a Russian traveler, who took them to the hospital.\n\nWhile at the hospital they were informed that they were dying of radiation poisoning. The Gregory spent his remaining months designing a device, that would tap the mutated genes of the Fantastic Four. The device would reverse their cellular decay. The only side effect of this experiment would be the lives of the Fantastic Four. The [[Fantastic Four]] foiled his scheme.\n\nGregory Gideon lost his life, when his pawn, the [[Dragon Man]] broke free of his control. In the midst of the wreckage appeared the being known as [[Shaper of Worlds]], he had been attracted to the site by the dreams of one of Gideon's henchmen. Though the henchman's dreams proved inadequate, the Shaper took young Thomas Gideon and cured him of his fatal disease. This transformed him into a golden being, unleashing his true potential. As Glorian, the young Gideon committed himself to learning the Shaper's skills.\n\nUnlike the Shaper, who is cold and unimaginative, Gideon is an Earthling at heart. He has all the curiosities and weaknesses associated with the humans of Earth. Glorian has attempted to cure the monster known as the [[Hulk]] by giving him his heart's desire. This effort failed miserably. The Hulk was manipulated by the demon [[Satannish]], who was after Glorian's soul. In the end, the Hulk intervened on behalf of Glorian, and saved him from Satannish's devilish scheme. Glorian left Earth for a while, trying to contemplate the full scope of his powers, he later returned to Earth and helped a group of young [[mutants]] called [[Generation X]], who were lost at sea.\n\nRecently Glorian appeared on the planet of [[Godthab Omega]]. The planet had become the home to some of the universes’ most powerful beings. Glorian felt the need to transform this world into his greatest creation. It would be through this accomplishment that he would prove himself to the Shaper of Worlds.\n\nIn order to transform the planet he needed more power. He thought that he had found that power source in the exiled [[Kree]], [[Ronan]] the Accuser. Ronan had traveled to Gothab Omega in search of the [[Rigellians|Rigellian]], [[Nile, Tana|Tana Nile]]. Glorian wanted Ronan to give into rage and righteous fury. The plan was to use the unbridled power to sculpt the world in his own image. After Ronan’s vicious battle with [[Gamora]] leader of the [[Graces]], Glorian gained the necessary power to complete his plan.\n\nGlorian transformed Godthab Omega from chaos and turmoil into a place of peace and calm. It was to be his redemption from past failures and his independence from his master the [[Shaper of Worlds]]. His triumph was short lived by the invasion of the [[Annihilation|Annihilation Wave]]. In a fit of anger and disappointment Glorian managed to defeat the invaders by causing a massive explosion. Ronan and Gamora left him staring into his [[Cosmic Cube]].",
        "categories": [
            "Cosmic",
            "Annihilation"
        ]
    }
}