{
    "id": 1011041,
    "name": "Great Lakes Avengers",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/f/70/4c0032387d022",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011041",
    "comics": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011041/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/1858",
                "name": "G.L.a. (2005) #1"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/3117",
                "name": "G.L.a.: Misassembled (Trade Paperback)"
            }
        ],
        "returned": 2
    },
    "series": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011041/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/823",
                "name": "G.L.a. (2005)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1375",
                "name": "G.L.a.: Misassembled (2005)"
            }
        ],
        "returned": 2
    },
    "stories": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011041/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/4183",
                "name": "1 of 4 - 4LXS",
                "type": "cover"
            }
        ],
        "returned": 1
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011041/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011041/great_lakes_avengers?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Great_Lakes_Avengers?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "base_of_operations": "Great Lakes Avengers Headquarters; formerly Ashley Crawford's residence (both in Milwaukee, Wisconsin)",
        "debut": "West Coast Avengers #46 (1989)",
        "origin": "",
        "significant_issues": "West Coast Avengers #46, Avengers West Coast #48-49, Avengers #339, Avengers #313, Avengers West Coast #55, Avengers West Coast #60, Avengers Annual #19, Avengers West Coast #64, Avengers West Coast #69, Deadpool #10-11, Thunderbolts #15-17, Thunderbolts #25, Deadpool #61, GLA #1-4, GLX-Mas Special #1, I (Heart) Marvel: Masked Intentions #1",
        "current_members": "[[Gravity]] (Greg Willis) [[Big Bertha]] (Ashley Crawford), [[Doorman (DeMarr Davis)|Doorman]] (DeMarr Davis), [[Flatman]] (Val Ventura), [[Mister Immortal]] (Craig Hollis), [[Squirrel Girl]] (Doreen Green), [[Tippy Toe]]",
        "former_members": "[[Dinah Soar]], [[Grasshopper (Doug Taggert)]], [[Hawkeye (Clint Barton)]], [[Leather Boy]] (Gene Lorreng), [[Mockingbird]] (Bobbi Morse), [[Monkey Joe]]",
        "other_members": "",
        "main_image": "great_lakes_avengers.jpg",
        "bio_text": "Dying after giving birth, Audrey Hollis was led to the afterlife by [[Deathurge]], the embodiment of the latent self-destructive impulses in all beings, who promised to look after Audrey's newborn son, [[Mister Immortal|Craig]]. Deathurge became Craig's supposedly imaginary childhood friend, leading the boy into all sorts of potentially lethal activities until his eighth birthday, when Craig's father Edward died in a fire after Craig and \"D'urge\" had played with matches. Placed in an abusive foster home with the O'Doughan family, Craig befriended and ultimately fell in love with the O'Doughans' daughter, Terri, outgrowing the need for his \"imaginary\" friend. Craig and Terri eventually ran off together to Milwaukee, but lingering depression from her upbringing led Terri to commit suicide, and Craig was shocked to see a very real \"D'urge\" escort her spirit away. Despairing, Craig tried repeatedly to kill himself, but soon realized he had the mutant power to recover from fatal injuries.",
        "bio": "Dying after giving birth, Audrey Hollis was led to the afterlife by [[Deathurge]], the embodiment of the latent self-destructive impulses in all beings, who promised to look after Audrey's newborn son, [[Mister Immortal|Craig]]. Deathurge became Craig's supposedly imaginary childhood friend, leading the boy into all sorts of potentially lethal activities until his eighth birthday, when Craig's father Edward died in a fire after Craig and \"D'urge\" had played with matches. Placed in an abusive foster home with the O'Doughan family, Craig befriended and ultimately fell in love with the O'Doughans' daughter, Terri, outgrowing the need for his \"imaginary\" friend. Craig and Terri eventually ran off together to Milwaukee, but lingering depression from her upbringing led Terri to commit suicide, and Craig was shocked to see a very real \"D'urge\" escort her spirit away. Despairing, Craig tried repeatedly to kill himself, but soon realized he had the mutant power to recover from fatal injuries. \n[[image:GreatLakesAvengers01.jpg|thumb|left|180px]]He decided to become a super-hero as Mr. Immortal, but his self-resurrection power was of little use against criminals on its own. Needing teammates to supplement his passive power, Craig placed a personal ad and gathered a group of local costumed adventurers. The highly malleable, almost two-dimensional [[Flatman]] became the team's deputy leader. [[Big Bertha]], a slender supermodel who could morph into a super-obese powerhouse, used her modeling fortune to finance the team. [[Doorman (DeMarr Davis)|Doorman]] created [[Glossary:D#Darkforce|Darkforce]]-powered portals through solid objects using his own body. The sound-manipulating, pterodon-like [[Dinah Soar]] (possibly related to the [[Savage Land]]'s Nhu'Gai race) had an inaudible hypersonic voice that only Mr. Immortal could comprehend, forcing her to use a whistle to communicate with her other teammates. The final member, [[Leather Boy]], was quickly dropped after his teammates realized he was merely a non-powered leather enthusiast who had misunderstood Mr. Immortal's personal ad. They decided to set up shop as the Midwestern branch of the [[Avengers]], (who then had East and [[West Coast Avengers|West Coast]] branches), maintaining the coastal theme as the \"Great Lakes Avengers\" (GLA).\n\nAfter the GLA subdued a group of would-be robbers at the Milwaukee Farmers & Merchants Building, the archer [[Hawkeye (Clint Barton)|Hawkeye]] - who had recently left the West Coast Avengers roster - decided to investigate the GLA's unauthorized use of the Avengers' name. Hawkeye and his wife, [[Mockingbird]] lured the GLA into a confrontation; but after a brief scuffle, Hawkeye decided his leadership could shape the GLA into a real team - much to the chagrin of Mr. Immortal. Soon detecting an Avengers [[Quinjet]] emergency signal, the GLA and their new mentors went to the Absolom College of Robotics in Texas, where they rescued several Avengers from [[That Which Endures]], an unconscious collective sentience which guided evolution and was trying to terminate humanity in favor of mutantkind. While the other GLAers battled That Which Endure's pawns, Mr. Immortal destroyed its [[Assimilator]] machinery, freeing everyone from the entity's influence. Though Hawkeye and Mockingbird continued to train the GLA, the team was never fully accepted or endorsed by the real Avengers. Frustrated, Hawkeye soon quit to rejoin the West Coast Avengers.\n\nWhen the extraterrestrial [[Terminus]] terrorized St. Louis, Missouri during an attempt to drain all life on Earth, the GLA - notified of the threat by Hawkeye -fearlessly battled Terminus at St. Louis' Gateway Arch, delaying Terminus until the Avengers arrived. Ultimately forced into space by [[Thor (Thor Odinson)|Thor]] and deprived of its lance, Terminus was forced to expend energy too rapidly and imploded. The GLA also saved Christmas for a suburb of Muskego, Wisconsin from [[Dr. Tannenbaum]] and his giant robot snowman. Later, when schoolboy Stevie found the Crimson [[Ruby of Cyttorak]] and sought to steal [[Captain America (Steve Rogers)|Captain America]]'s shield with it, he duped the GLA into battling Captain America and the [[Human Torch (Jim Hammond)|Human Torch]] until the GLA were defeated and the confusion was cleared up. Shortly afterward, Mockingbird left the GLA to accept a reserve position with the West Coast Avengers. \n\nAfter many of the Avengers and other heroes seemingly died in battle with [[Onslaught (entity)|Onslaught]], the Avengers disbanded and the GLA attempted to fill the void. They abandoned the Avengers franchise and renamed themselves the \"Lightning Rods\", trying to become the \"West Coast adjunct\" to New York's new leading superheroes, the [[Thunderbolts]], a team of super-villains who were secretly posing as heroes. While enjoying a day at the Bay City Aquarium, the Lightning Rods spotted and attacked the criminal mercenary [[Deadpool]]. After a destructive battle, a freak interaction of Deadpool's teleportation device with Doorman's body transported Deadpool and his elderly associate [[Blind Alfred]] back in time. With Doorman's health rapidly deteriorating, Deadpool had to repair his teleporter device in the past and coordinate it with Doorman's powers to reemerge in the present. The Lightning Rods and Deadpool parted as friends, but not before Deadpool detonated a bandoleer of live hand grenades on Mr. Immortal. \n\nAfter the Thunderbolts were exposed as super-villains, the Lightning Rods wanted vengeance on the team for disgracing them by association. The Lightning Rods cooperated with Commander [[Bridge, G.W.|G.W. Bridge]] of [[S.H.I.E.L.D.]] at the request of the U.S. government to capture the fugitive Thunderbolts. S.H.I.E.L.D. herded the Thunderbolts right into the hands of the Lightning Rods; but after a prolonged battle, the Thunderbolts defeated and stripped the Lightning Rods, using their costumes as disguises to slip away from S.H.I.E.L.D.. Soon after, in Cottonwood, Wyoming, the Lightning Rods caught up with the Thunderbolts while they were battling a rampaging [[Hulk]] robot that was designed to collect energy so that the gravity-controlling villain known as [[Graviton]] could return to Earth. Thanks to the Lightning Rods' interference, Graviton amassed the energy he needed and easily defeated both teams; but the Thunderbolt [[Moonstone]], a former criminal psychologist, convinced Graviton to leave the planet. With nearly all of the Lightning Rods incapacitated from the battle, Mr. Immortal had no choice but to let the Thunderbolts go. \n\nChanging their names back to the GLA, the team protected the denizens of Medina, Ohio from freak tornadoes caused by [[Crimson Cowl (Justine Hammer)|Crimson Cowl]] and her [[Masters of Evil]]. Later, the GLA attended Deadpool's funeral, though his death proved temporary. When the criminal [[Ani-Men (GLA)|Ani-Men]] attacked one of Big Bertha's modeling shoots at the Milwaukee Convention Center, her fellow GLAers sped to the scene in their GLA Quin-Jetta, only to be upstaged by the real Avengers. Discouraged, Mr. Immortal finally decided to disband the GLA; but before he could do so, he learned that the real Avengers had disbanded following disasters caused by the [[Scarlet Witch (Wanda Maximoff)|Scarlet Witch]]. Viewing the Avengers' misfortune as the GLA's big break, an elated Mr. Immortal led the GLA into battle against the villainous [[Inhumans|Inhuman]]/[[Deviants|Deviant]] geneticist [[Maelstrom]], who was constructing a machine to bring about the end of the universe so that he could learn its secrets. Dinah Soar was killed by Maelstrom during the battle and carried away by Deathurge, plunging Dinah's lover, Mr. Immortal, into a deep depression. \n\n[[image:GreatLakesAvengers02.jpg|thumb|right|180px]]With Mr. Immortal unwilling to continue, Flatman assumed command of the team and traveled to New York City with Doorman to recruit new GLA members. Many super-heroes turned them down, but the heroine [[Squirrel Girl]] and her pet squirrel, [[Monkey Joe]], agreed to join the team after rescuing Flatman and Doorman from muggers in Central Park. Immediately afterward, the GLA joined forces with novice hero [[Grasshopper (Doug Taggert)|Grasshopper]] (a part-time [[Roxxon Oil|Roxxon]] security guard) to battle the mercenaries of [[Batroc's Brigade]], whom Maelstrom had hired to steal components for his doomsday machine. Grasshopper also accepted Flatman's offer of GLA membership, but was killed by [[Zaran (Maximillian Zaran)|Zaran the Weapons Master]] seconds later. Returning to Wisconsin, the GLA tracked Maelstrom while leaving monitor duty to Monkey Joe, who was killed by Leather Boy, furious that a squirrel had been granted the membership that was taken from him. Big Bertha sat on Leather Boy, ending his assault, and the GLA invaded Maelstrom's base under Lake Michigan as he attempted to energize his doomsday machine. Mr. Immortal convinced Maelstrom that destroying the universe would leave him unbearably lonely, and that that the only way out was to commit suicide. Mr. Immortal blew his own head off, and Maelstrom followed his lead, unaware that Mr. Immortal would be immediately resurrected; Mr. Immortal then shut down the doomsday machine, averting disaster. During the battle, most of Squirrel Girl's squirrels had been slain and Doorman was atomized by Maelstrom's force field; but, due to Doorman's Darkforce powers, he was chosen by the cosmic entity [[Oblivion]] to replace Deathurge as his avatar of death, and was resurrected in this role. [[Tippy Toe]], sole survivor of Squirrel Girl's squirrel army, replaced Monkey Joe as Squirrel Girl's new partner and the latest GLA recruit. \n\nAfter receiving a cease and desist letter from the Maria Stark Foundation ordering them to stop calling themselves Avengers, the GLA realized they were all mutants and renamed themselves the Great Lakes X-Men, or GLX.\n\nRecently during a poker game supported by the [[Thing (Benjamin Grimm)|Thing]], they won a hand which gave them the right to call themselves the \"Great Lakes Champions\". Having changed thier name to the GLC they then registered with the [[Civil War|Superhuman Registration Act]] and became \"official\" heroes. They were then attacked by [[Deadpool]] who mistook them for unregistered combatants. However the fight soon ended when Squirrel Girl managed to defeat Deadpool by herself. The team then handed him over to the authorities, but Deadpool was then recruited by the government. \n\nDuring Norman Osbourns dark reign, Gravity was dispatched to the GLC as their new field leader in order to remove him from a promising position on a more sucsesful team with the added bonus of making the GLC look a little better",
        "categories": [
            "Avengers",
            "X-Men",
            "Heroes",
            "Mutants",
            "Civil War",
            "Initiative"
        ]
    }
}