{
    "id": 1011152,
    "name": "Preak",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/8/e0/4c002f5458faa",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011152",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011152/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011152/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011152/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011152/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011152/preak?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Preak?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "blurb": "",
        "real_name": "Preak",
        "aliases": "None",
        "identity": "No dual identity",
        "occupation": "Rebel; former servant",
        "citizenship": "Pralagon System",
        "place_of_birth": "[[Baradar Nebula]] in the [[Negative Zone]]",
        "relatives": "None",
        "groups": "Formerly UX-73's inmate army",
        "education": "Unrevealed",
        "height": "10'",
        "weight": "1020 lbs.",
        "eyes": "Light green",
        "hair": "None",
        "powers": "Preak was of the [[Panspermian]] race, They were known to have superhuman strength and durability. They were genetically engineered to be servants of labor. Preak possessed superhuman strength and a near indestructible outer shell.",
        "abilities": "Any blast force trauma causes Preak to replicate a second body of equal size strength and intellect. He can easily multiply into a labor force or a basic level combat force.",
        "weapons": "Has been seen with large plasma blasters.",
        "paraphernalia": "None",
        "debut": "[[Annihilation]]: [[Super Skrull]] #2 (2006)",
        "origin": "Preek was genetically engineered from a silicone based life form by the [[Pralagon]] Shapers of the Barador Nebula.",
        "significant_issues": "The Super Skrull defeats the forces of the prison planetoid UX-73 and frees [[Praxagora]] and Preak. (Annihilation: Super Skrull #2 2006); Preak and the rest of the Super Skrulls team are captured by [[Salo|Admiral Salo]] (Annihilation: Super Skrull #3 2006); Preak is slain by the Wave's forces as Praxagora prepares to overload her power source in an attempt to destroy the Harvester of Sorrows. (Annihilation: Super Skrull #4 2006)",
        "main_image": "Preak 1.jpg",
        "bio_text": "Preak was a ten year old member of the Panspermian race, a species genetically engineered from a silicone based life form by the [[Pralagon]] Shapers of the Barador Nebula. They were used primarily as beast of burden in the Pralagon system.  Panspermians were designed to be extremely adaptable and devoid of such reproductive issues as sex, pregnancy or gestation. They were to survive under any condition and provide inexpensive, easily multiplied labor and base level combat force. All Panspermians were essentially identical and may even share the same memories with the original body from which it was replicated. The species was engineered with minimum intellect and maximum subservience, taking pleasure from even the most trivial of social interactions.  They are considered a simple species with little use beyond their initial design.",
        "bio": "Preak was a ten year old member of the Panspermian race, a species genetically engineered from a silicone based life form by the [[Pralagon]] Shapers of the Barador Nebula. They were used primarily as beast of burden in the Pralagon system.  Panspermians were designed to be extremely adaptable and devoid of such reproductive issues as sex, pregnancy or gestation. They were to survive under any condition and provide inexpensive, easily multiplied labor and base level combat force. All Panspermians were essentially identical and may even share the same memories with the original body from which it was replicated. The species was engineered with minimum intellect and maximum subservience, taking pleasure from even the most trivial of social interactions.  They are considered a simple species with little use beyond their initial design.\n\nAfter the Annihilation Wave destroyed the Barador Nebula, high command issued a cease and desist order on all unauthorized Pansperian replication and extermination, after a plague of Panspermian duplicate test subjects forced the Annihilation Wave to bomb the UX-79 experimental planetoid form orbit. Preak survived the attack and was transported to the nearby UX-73 prison planetoid where he befriended [[Praxagora]]. The duo endured [[Hawal]]’s experiments on the dreary prison planetoid for years. They were unable to escape due to Hawal’s heavily armed guards and the deterrent energy field that Hawal erected around the planet. The field was designed to destroy all organic matter that passed through it.\n\nThere was one flaw in the security system, and it would be exploited by a visitor from outside of the [[Negative Zone]].  UX-73’s security systems were breached by the determined [[Super Skrull]], who arrived on the prison planetoid in search of Hawal. He was the creator of the [[Harvester of Sorrows]], a genocidal weapon of mass destruction. Hawal had given the weapon to the forces of the Negative Zone conqueror [[Annihilus]]. They had destroyed many planets in the Andromeda galaxy, which was located in the positive matter universe. The Annihilation wave later targeted Zarags’na, which was the home world of the Super Skrull's only known son. Super Skrull prevented Hawal’s retreat from the prison planetoid. \n\nHawl was confronted by Preak, Praxagora, and the rest of the UX-73 inmate population, who wanted to kill Hawl for years of sadistically experimenting on them. The Super Skrull needed Hawal alive so that he could create a virus that would destroy the Harvester of Sorrows, so he quickly defeated the inmates in combat. After their defeat Praxagora and Preak pledge allegiance to the Super Skrull as their new master. They assisted him on his journey back to the positive matter universe in an attempt to stop the Harvester of Sorrows. Preak allowed the Super Skrull to pound him brutally in order to duplicate a work force for the young mechanic Skrull, [[R'kin]], to construct a dimensional portal that would take them back to the positive universe.\n\nOnce they left the Negative Zone, Super Skrull’s plans were ruined when R’kin betrayed them to [[Salo|Admiral Salo]], commander of the Annihilation Wave’s Harvester of Sorrows. R’kin was promised a large bounty by Admiral Salo. The rest of their allies were killed, Preak, Praxagora and Super Skrull were taken aboard the Harvester as prisoners. They were made to watch the destruction of the Skrull world of Zarags’na. Although Preak died in combat against the swarm of the Annihilation Wave foot soldiers on board the Harvester, Super Skrull and Praxagora succeeded in destroying the super weapon, although it cost the Super Skrull his life.",
        "categories": [
            "Annihilation",
            "Cosmic",
            "Deceased"
        ]
    }
}