{
    "id": 1011136,
    "name": "Air-Walker (Gabriel Lan)",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/40/image_not_available",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011136",
    "comics": {
        "available": 3,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011136/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/5589",
                "name": "Heroes Reborn: Iron Man (Trade Paperback)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/16330",
                "name": "Iron Man (1996) #11"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/16331",
                "name": "Iron Man (1996) #12"
            }
        ],
        "returned": 3
    },
    "series": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011136/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1814",
                "name": "Heroes Reborn: Iron Man (2006)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/13577",
                "name": "Iron Man (1996 - 1998)"
            }
        ],
        "returned": 2
    },
    "stories": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011136/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/34082",
                "name": "Magical Mystery Tour",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/34085",
                "name": "Matters of the Heart",
                "type": "interiorStory"
            }
        ],
        "returned": 2
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011136/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011136/air-walker_gabriel_lan?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Air-Walker_(Gabriel_Lan)?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Gabriel Lan",
        "identity": "Secret",
        "aliases": "Nova Centurion, the Archangel Gabriel",
        "occupation": "Former herald of Galactus, Captain of Xandarian starship",
        "place_of_birth": "Planet Xandar in the Tranta system, Andromeda Galaxy",
        "groups": "Formerly [[Heralds of Galactus]], Xandarian [[Nova Corps]]",
        "citizenship": "Planet Xandar",
        "education": "Unrevealed",
        "relatives": "Unrevealed",
        "height": "6’2”",
        "weight": "(Humanoid) 240 lbs.; (android) 650 lbs.",
        "eyes": "Black",
        "hair": "Black",
        "powers": "Air-Walker had been given a portion of the [[Power Cosmic]], and with it he could absorb and manipulate cosmic energies for a variety of purposes. It gave him god-like strength, speed, durability, endurance and agility. Air-Walker could fire blasts of heat, concussive force, magnetism, anti-gravity, and electricity. Using his power at peak capacity, Air-Walker could function for months before succumbing to fatigue. He was immune to extreme temperature changes, most radiation and can survive in the vacuum of space indefinitely without food, water, or air as well as navigate hyperspace unaided. The Power Cosmic also granted him the ability to analyze and rearrange matter and energy. When entering planetary atmospheres, he would curtail his speed as to not cause devastating side effects.",
        "abilities": "Gabriel has been trained in combat by the Xandarian Nova Corps, and he is familiar with advanced alien technology and interstellar navigation.",
        "weapons": "None",
        "paraphernalia": "During his time as herald, Air-Walker carried the Trumpet of Gabriel which sent a hyperspatial signal used to summon his master, Galactus. Air-Walker also had a cape that appeared as flames sprouting from his back. His Cape of Destiny is able to wrap itself around an opponent and smother the life from them. No one except for the Silver Surfer has demonstrated power enough to break free. The cape is also the source of Gabriel's power and life.",
        "debut": "Fantastic Four #120 (1971, as android); Thor #306 (1981, true form)",
        "origin": "Thor #306 (1981)",
        "significant_issues": "Air-Walker’s first appearance, battled FF and Silver Surfer, was defeated and revealed to be a robot (Fantastic Four #120-121, 1971); battled Thor, robot was destroyed again, Firelord buried remains on an asteroid in Xandar system (Thor #305-306, 1981); Air-Walker robot was resurrected to aid all of Galactus’ former heralds in battle against Morg, Air-Walker became herald to Galactus once again (Silver Surfer #72-75, 1992); Air-Walker was hunted by the forces of Annihilus, expired from injuries (Silver Surfer: Annihilation #1, 2006)",
        "main_image": "Air-Walker.jpg",
        "bio_text": "Serving as a captain in the Xandarian [[Nova Corps]] with his friend, [[Firelord (Pyreus Kril)|Pyreus Kril]], Gabriel was abducted and transformed into Air-Walker by the world devouring Galactus, becoming his herald; Kril would later become Galactus' herald, Firelord. Air-Walker took Galactus to countless worlds, and the two became close. Gabriel actually loved Galactus as a father, and Galactus was also very fond of his herald, telling him endless stories of his travels throughout the cosmos. When the [[Ovoids]], an alien race determined to rid the universe of Galactus' threat, attacked, Air-Walker sacrificed himself to defend his master. Attempting to save his herald, Galactus transferred Gabriel's life force into a highly advanced robotic shell, but the android had no memory of his previous life and was lacking something his Xandarian counterpart had. Galactus had Air-Walker travel to Earth to draw out his previous herald, the [[Silver Surfer]], so Galactus could take him as his herald once more.",
        "bio": "Serving as a captain in the Xandarian [[Nova Corps]] with his friend, [[Firelord (Pyreus Kril)|Pyreus Kril]], Gabriel was abducted and transformed into Air-Walker by the world devouring Galactus, becoming his herald; Kril would later become Galactus' herald, Firelord. Air-Walker took Galactus to countless worlds, and the two became close. Gabriel actually loved Galactus as a father, and Galactus was also very fond of his herald, telling him endless stories of his travels throughout the cosmos. When the [[Ovoids]], an alien race determined to rid the universe of Galactus' threat, attacked, Air-Walker sacrificed himself to defend his master. Attempting to save his herald, Galactus transferred Gabriel's life force into a highly advanced robotic shell, but the android had no memory of his previous life and was lacking something his Xandarian counterpart had. Galactus had Air-Walker travel to Earth to draw out his previous herald, the [[Silver Surfer]], so Galactus could take him as his herald once more.\n\nMistakenly assumed to be the Archangel Gabriel upon first arriving on Earth, Air-Walker sent the world into chaos after sounding his [[Trumpet of Gabriel]] and proclaiming the imminent destruction of mankind. The [[Fantastic Four]] attempted to peacefully reason with him, but when Gabriel refused to listen, they resorted to force. Turning the city of New York against the heroes by telling the masses the way to avert their destruction was by killing the heroes, Air-Walker only delayed the inevitable confrontation as the Fantastic Four evaded angry mobs. Stronger than the [[Thing (Benjamin Grimm)|Thing]], unfazed by [[Human Torch (Johnny Storm)|Human Torch]]'s fire (including a near-nova flame), and unimpeded by [[Mister Fantastic]]'s gadgets, Air-Walker appeared unstoppable until the Surfer witnessed the Fantastic Four's plight. The Surfer matched Gabriel's power and determination, but was paused when Gabriel told him of Galactus' intentions. The Surfer refused to return as herald, and Gabriel enveloped him in his [[Cape of Destiny]], boasting no one had the power to escape the cape's grip. The Surfer did escape and destroyed the cape doing so. Air-Walker declared the cape was his source of power and life as he plummeted to the ground and was deactivated on impact.\n\nGabriel's body was recovered by the [[Machinesmith]], and his self-repair systems were activated. Once resurrected, he was spotted leaving the Machinesmith’s lair by a young child, Kevin. Remembering his past encounter with the Silver Surfer and the Fantastic Four, he went to the [[Baxter Building]] to ask his enemies what transpired since he was offline. Taking Kevin with him, hoping the boy could enlighten him about his new environment, the Fantastic Four believed Kevin was a hostage and wanted to rescue him, but Air-Walker used his power to seal them within their headquarters. Discovering Galactus left Earth and abandoned him, Gabriel was enraged at being discarded and having his mind placed within an android shell without his consent. He created a cosmic storm, hoping to renew his conflict with the Surfer, but it was [[Thor (Thor Odinson)|Thor]] who confronted Air-Walker after ending the tempest. Also thinking the boy to be a prisoner, Thor attacked but was defeated when Air-Walker smothered him within the Cape of Destiny and wrestled his enchanted hammer, [[Mjolnir]], away from him, rendering Thor unconscious with it. Kevin believed Gabriel was a noble entity and inspired him to rethink his actions. Gabriel dropped Thor to the ground, but when he recovered, Thor hurled Mjolnir through the robot's chest, deactivating him. Firelord saw the televised battle and went to aid his old friend, attacking Thor. Calming himself, Firelord told Thor the tale of Gabriel Lan, and afterward buried Gabriel on an asteroid in Xandar’s solar system.\n\nSometime later, Galactus found a herald in the murderous [[Morg]], and the Silver Surfer voiced his concerns. Galactus dismissed his former herald and Morg defeated the Surfer in combat. The Silver Surfer, and former herald [[Nova (Frankie Raye)|Nova]], recruited all former [[Heralds of Galactus]], including a newly reactivated Air-Walker, to oppose Morg. After an epic battle which left Nova dead and Morg defeated, Air-Walker and Firelord agreed to act as heralds to Galactus, and Firelord hoped to rekindle Gabriel’s humanity. Both were eventually replaced by [[Red Shift]]. When the forces of [[Annihilus]] cut a path of destruction across the universe, Air-Walker, like all the former heralds, was hunted. He was about to be overrun, but the Surfer helped him hold their opponents at bay. However, Air-Walker's wounds were too severe, and his robotic form could not repair itself. Gabriel expired and the Surfer ensured his remains could not be tainted by Annihlus by causing an explosion that presumably destroyed his robotic form completely.",
        "categories": [
            "Fantastic Four",
            "Heroes",
            "Cosmic",
            "Annihilation",
            "Deceased"
        ]
    }
}