{
    "id": 1011026,
    "name": "Mantis",
    "description": "",
    "modified": "2013-11-01T16:34:14-0400",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/3/20/52740fa12e826",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011026",
    "comics": {
        "available": 9,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011026/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/16191",
                "name": "Annihilation: Conquest - Starlord (2007) #2"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17756",
                "name": "Avengers (1996) #2"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17757",
                "name": "Avengers (1996) #3"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17762",
                "name": "Avengers (1996) #8"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17752",
                "name": "Avengers (1996) #10"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/6968",
                "name": "Avengers (1963) #113"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/6970",
                "name": "Avengers (1963) #115"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/5705",
                "name": "Heroes Reborn: Avengers (Trade Paperback)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17940",
                "name": "West Coast Avengers Annual (1986) #3"
            }
        ],
        "returned": 9
    },
    "series": {
        "available": 5,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011026/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2541",
                "name": "Annihilation: Conquest - Starlord (2007)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/3621",
                "name": "Avengers (1996 - 1997)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1991",
                "name": "Avengers (1963 - 1996)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1813",
                "name": "Heroes Reborn: Avengers (2006)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/3632",
                "name": "West Coast Avengers Annual (1986 - 1988)"
            }
        ],
        "returned": 5
    },
    "stories": {
        "available": 9,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011026/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/14473",
                "name": "Cover #14473",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/14474",
                "name": "Your Young Men Shall Slay Visions!",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/14478",
                "name": "Below Us the Battle!",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/33072",
                "name": "Annihilation Conquest: Starlord (2007) #2",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/37678",
                "name": "Shadow War!",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/37689",
                "name": "First Blood",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/37691",
                "name": "In Love & War",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/37702",
                "name": "Shadowplay",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/38153",
                "name": "pin-up",
                "type": ""
            }
        ],
        "returned": 9
    },
    "events": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011026/events",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/events/293",
                "name": "Annihilation: Conquest"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/events/246",
                "name": "Evolutionary War"
            }
        ],
        "returned": 2
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011026/mantis?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Mantis?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Unknown (last name presumably Brandt)",
        "identity": "Secret",
        "occupation": "Adventurer; formerly barmaid",
        "place_of_birth": "Unknown village in Vietnam",
        "groups": "[[Guardians of the Galaxy]]; formerly [[Avengers]]",
        "citizenship": "Vietnam",
        "education": "Trained by [[Priests of Pama]]",
        "aliases": "Celestial Madonna, Goddess of Life, This One (Mantis habitually refers to herself in this third-person fashion); formerly Mandy Celestine, Lorelei, Willow",
        "relatives": "[[Quoi|Sequoia]] (Celestial Messiah, \"Quoi\", son), [[Swordsman (Cotati)|Elder Cotati (Swordsman)]](husband, separated), [[Libra (Gustav Brandt)|Gustav Brandt]] (alias Lloyd Wiloughby, Libra, father), Lua Nguyen Brandt (mother, deceased), Khruul (uncle)",
        "height": "5'6''",
        "weight": "115 lbs.",
        "eyes": "Green",
        "hair": "Black",
        "powers": "The powers she adapted from the [[Cotati]] enabled her to communicate [[Glossary:T#telepathy|telepathically]] with plants, survive in space, and transfer herself (and her son) from plant life to plant life across interstellar distances or [[Glossary:I#interdimensional|interdimensionally]]. Once reborn, she could fire powerful energy blasts, form energy fields, communicate directly with cosmic beings such as [[Eternity]] and [[Death (embodiment)|Death]], and gained complete control of her personal energies as well as her physical form. Her mind, a human/plant hybrid, is largely immune to mental or metaphysical assault, and her physical durability is greatly enhanced. She can achieve a meditative state in which she is largely immune to physical, mental or spiritual harm. She also seems to have limited powers of flight, though it is possible these function only in the vacuum of space.",
        "abilities": "Through training with the Priests of Pama, Mantis attained \"complete control\" over her body, achieving peak human agility, the ability to accelerate her recuperative powers through force of will, and an [[Glossary:E#empathic|empathic]] nature enabling her to sense the emotions of others as \"[[Glossary:P#psychic|psychic]] vibrations.\" Her mastery of the Priests' martial arts, which focus on manipulation of nerve endings and pressure points, has enabled her to knock out beings as powerful as [[Thor]].",
        "features": "Mantis has two slim antennae growing from her head. She has pale green skin, but can change her skin color.",
        "debut": "Avengers #112 (1973)",
        "origin": "",
        "significant_issues": "",
        "main_image": "Mantis_new.jpg",
        "bio_text": "The enigmatic Mantis traces her roots back to the family of Vietnamese crimelord Monsieur Khruul who, disapproving of his sister Lua's marriage to German mercenary Gustav Brandt, hunted the couple across Indochina. The Brandts eluded him while Lua bore a child, but Khruul ultimately had their house burned to the ground, killing Lua and blinding Gustav, who fled with their infant daughter. They found sanctuary in the temple of the Priests of Pama, renegade pacifist members of the [[Glossary:A#alien|alien]] [[Kree]] race who were caretakers of the Cotati, a telepathic race of sentient plants. The Priests trained Gustav, granting him psychic sight, but separated him from his daughter, not wanting his violent nature to influence her development. Brandt eventually left the Temple, later joining the crime cartel [[Zodiac (Cartel)|Zodiac]] as Libra.",
        "bio": "The enigmatic Mantis traces her roots back to the family of Vietnamese crimelord Monsieur Khruul who, disapproving of his sister Lua's marriage to German mercenary Gustav Brandt, hunted the couple across Indochina. The Brandts eluded him while Lua bore a child, but Khruul ultimately had their house burned to the ground, killing Lua and blinding Gustav, who fled with their infant daughter. They found sanctuary in the temple of the Priests of Pama, renegade pacifist members of the [[Glossary:A#alien|alien]] [[Kree]] race who were caretakers of the Cotati, a telepathic race of sentient plants. The Priests trained Gustav, granting him psychic sight, but separated him from his daughter, not wanting his violent nature to influence her development. Brandt eventually left the Temple, later joining the crime cartel [[Zodiac (Cartel)|Zodiac]] as Libra.\n\nBelieving Mantis might grow to be the Celestial Madonna and mother the genetically perfect Celestial Messiah, the Priests of Pama trained Mantis in their martial arts, which she mastered, and gave her the name \"Mantis,\" in recognition of her skill in defeating male opponents. They also taught her telepathic communication with the Cotati, which gave her empathic abilities. On Mantis' eighteenth birthday, the Priests removed Mantis' memories, implanting false memories of an orphaned life in Ho Chi Minh City, and sent her to experience life among normal humans. Meanwhile, the Shao-Lom monks of Titan, whose teachings also stemmed from the pacifist Kree's beliefs, mentored another possible Celestial Madonna: Earth-born orphan Heather Douglas, later known as [[Moondragon]], but her sheltered life denied her insight into human existence, making her a less-rounded candidate. Moondragon would eventually return to [[Earth]], becoming involved with the [[Avengers]].  \n\nAs a bar girl coincidentally employed by her unwitting uncle, Monsieur Khruul, Mantis met the [[Swordsman (Jacques Duquesne)|Swordsman]], an adventurer turned alcoholic mercenary who worked for Khruul. Sensing a spark of nobility in the Swordsman and seeking a better life for herself, Mantis romanced and rehabilitated Duquesne, convincing him to return to America and rejoin the Avengers. She accompanied him, but had difficulty gaining the Avengers' trust after she deceived them, single-handedly taking down both Thor and [[Captain America (Steve Rogers)|Captain America]] as part of her plan to help the Avengers defeat the [[Lion God]]. Still, her abilities served the Avengers well; she aided the team during its [[Loki]]/[[Dormammu]]-masterminded Avengers-[[Defenders]] War; and against foes including the [[Collector (Taneleer Tivan)|Collector]], [[Klaw]], and [[Ultron]]. Her empathic abilities helped save the universe when she deduced how [[Captain Marvel (Mar-Vell)|Captain Marvel]] could defeat the [[Cosmic Cube]]-empowered [[Thanos]]. \n\nDuring her association with the Avengers, Mantis became disenchanted with the Swordsman and began a slow seduction of the [[Vision]], which further damaged Mantis' standing with the team. When the Avengers fought and defeated Zodiac, Libra was captured and revealed his identity as Mantis' father, telling her some portion of her history. Returning to the Pama temple, Mantis found the Priests slain by her uncle, who was in turn slain by the [[Star-Stalker]], who had been kept imprisoned by the Priests. Though she still lacked her true memories, Mantis began doubting what she'd believed.\n\nKnowing the Celestial Madonna to be among them and hoping to father the Celestial Messiah himself, [[Kang]] attacked the Avengers. Defeated, he identified Mantis as the Celestial Madonna and attempted to kill her, but the Swordsman took the blast himself and died. Mantis, guilt-ridden and grief-stricken, buried the Swordsman in the garden of the Priests of Pama; however, the eldest Cotati reanimated the Swordsman's body and confirmed that Mantis was the Celestial Madonna. [[Immortus]], Libra and the Cotati revealed the full history of Mantis, who accepted her destiny as the Celestial Madonna (to Moondragon's irritation). In a ceremony conducted by Immortus, Mantis and the Eldest Cotati wed (as did the [[Scarlet Witch (Wanda Maximoff)|Scarlet Witch]] and the Vision), after which the celestial couple transformed into energy and departed Earth. Before she departed, the Avengers declared Mantis an official member of their ranks.\n\nMerged with the Cotati's essence, Mantis gained Cotati abilities as well as her own, and began to evolve into \"the essence of life,\" a change which physically manifested as a greenish hue in her skin. Conceiving the future Celestial Messiah, she left our universe, but even in other universes she found herself pursued -- on one [[Glossary:A#Alternate Earth|alternate Earth]] she was aided by a league of justice-serving heroes against a mechanical construct which sought to prevent her child's birth. Eventually her son, Sequoia, was born, and Mantis attempted to raise him as normally as possible in the town of Willimantic, Connecticut. Dark forces rose against her, attempting to create an evil counterpart to her child, but she aided those who fought them; nothing eclipsed her attempts to raise the boy peacefully.\n\nWhen the fast-growing child reached an age when the Cotati race chose to parent him alone, Mantis again took to the stars, where she uncovered a plot by the [[Elders of the Universe]] to acquire the six [[Infinity Gems]] and destroy [[Galactus]]. Fearing this would destroy reality, Mantis located the [[Silver Surfer]] and traveled with him as he fought the Elders, bonding romantically with him. When the [[Gardener]] attacked her using the Soul Gem, she barely escaped and transferred herself to [[Shalla-Bal]], the Surfer's former beloved on his homeworld. She and Shalla-Bal were both subsequently captured by the Elders. When the Elders attempted to destroy them both, Mantis sacrificed herself, allowing the Surfer to rescue Shalla-Bal.\n\nThe power of the Elders' Infinity Gems proved too much for Mantis, who could not fully reconstruct herself, and fragments of her essence formed several \"shadow\" Mantises. One shadow form awoke on Earth as an amnesiac, lacking powers. Seeking help, she aided the Avengers against the [[Voice]] and the [[High Evolutionary]], and they in turn aided her in regaining her memories. The [[Fantastic Four]] then helped her try to return to her son, but Kang and [[Necrodamus]] interfered; after foiling them, Mantis returned to the stars as pure energy. The Silver Surfer encountered a shadow Mantis on [[Verdant]], a plant world threatened by [[Galactus]], and this Mantis aided the Surfer, the Fantastic Four, and the Avengers in defeating Galactus and saving the [[Shi'ar|Shi'ar]] homeworld. Over time, most shadow Mantises ceased to exist, fading even from the memories of those they'd encountered. During the Immortus-guided conspiracy known as The [[Crossing]], the Avengers fought a Mantis seemingly allied with [[Kang]], but this Mantis was ultimately revealed to be a Space Phantom, with no relation to either the true Mantis or her \"shadows.\"\n\nOver time, the true Mantis began to recover as her scattered essence coalesced into five forms, each reflecting an aspect of her personality: freak, mother, lover, mystic, and Avenger. Thanos, a self-proclaimed god of death disturbed by the emergence of the Celestial Messiah and the Celestial Madonna as supposed deities of life, began killing fragmentary Mantises, unwittingly hastening the re-formation of the true Mantis, who was reborn as \"the goddess of life.\" Fully restored, she teamed with the Avengers and the [[Squadron Supreme (Earth-712)|Squadron Supreme's]] [[Haywire (Earth-712)|Haywire]] to seek out [[Quoi|Sequoia]] and defend him from Thanos, ultimately fighting beside Thanos to neutralize the reality-devouring [[Rot]] (though Thanos later claimed it was one of his [[Thanosi]] \"clones\" who encountered Mantis). Mantis offered guidance to both young Avengers recruit [[Silverclaw]], another potential goddess, and her own son, \"Quoi,\" who had become bitter and rebellious during Mantis' absence but ultimately accepted his mother and his own role as the Celestial Messiah. During the Thanos conflict, Mantis and Vision (now long-separated from the Scarlet Witch) finally became lovers, but the Vision decided his mechanical nature made him ill-suited for a relationship with the maternal Mantis because their union could not produce children, and he broke off the romance. Mantis returned to Earth and was among the Avengers who faced the deranged Scarlet Witch.",
        "categories": [
            "Heroes",
            "Women",
            "Avengers",
            "Cosmic",
            "International"
        ]
    }
}