{
    "id": 1011017,
    "name": "Sway",
    "description": "Suzanne Chan saw her parents gunned down in front of her, though she remained unscathed due to her manifesting mutant ability to stop time.",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/40/4c003266ccbab",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011017",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011017/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011017/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011017/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011017/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011017/sway?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Sway?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Suzanne Chan",
        "identity": "Secret (known to authorities)",
        "occupation": "Former adventurer, student",
        "place_of_birth": "Unrevealed",
        "groups": "Formerly [[X-Men]]",
        "citizenship": "U.S.A.",
        "education": "Various courses at [[Xavier Institute For Higher Learning]]",
        "aliases": "None",
        "relatives": "David Chan (father, deceased), Emily Chan (mother, deceased)",
        "height": "",
        "weight": "",
        "eyes": "Brown",
        "hair": "Black",
        "powers": "Sway has the mutant ability to control time. She can slow it down or even stop it in small radiuses. She also has the ability to replay time, watching events occur in certain areas as if they were phantoms.",
        "debut": "X-Men: Deadly Genesis #3",
        "origin": "X-Men: Deadly Genesis #3-4",
        "significant_issues": "X-Men: Deadly Genesis #3-4",
        "main_image": "Sway442.jpg",
        "bio_text": "Originally from Hong Kong, David and Emily Chan became naturalized citizens of the United States after living twenty years in California. During their stay, they had a daughter named Suzanne. At 17 years old, she wanted to attend Barnard College on the east coast, and planned a trip to New York City to prove to her parents that she would be safe on her own after moving. During the trip, David and Emily were gunned down in a crossfire between rival gangs in Chinatown. Although standing a few feet from her parents, Suzanne was unscathed, which perplexed police detectives.",
        "bio": "Originally from Hong Kong, David and Emily Chan became naturalized citizens of the United States after living twenty years in California. During their stay, they had a daughter named Suzanne. At 17 years old, she wanted to attend Barnard College on the east coast, and planned a trip to New York City to prove to her parents that she would be safe on her own after moving. During the trip, David and Emily were gunned down in a crossfire between rival gangs in Chinatown. Although standing a few feet from her parents, Suzanne was unscathed, which perplexed police detectives.\n\n\nAfter the shooting, Suzanne entered a state of shock. She could only dwell on the fact that when the shooting started, she had somehow stopped the bullets in midair and was able to get herself out of the path of the bullets. In actuality she had stopped time around the bullets, effectively freezing them in place. Unfortunately, she was unable to do the same for her parents, and could only watch as the bullets tore into them. \n\nThe police placed the traumatized girl in a hospital for forty-eight hour observation, during which she mostly slept and cried. When she was released, she was told that the police were looking into things, but they did not have any leads. Wandering the streets, she returned to the spot where her parents were killed. Suddenly, her mutant powers activated again and she was able to see past events in the area, namely the phantoms of herself and her parents. After witnessing the shooting for a second time, Suzanne followed the phantom car, carrying her parents’ murderers, throughout the city. She then realized that she somehow had control over the flow of time and she was making it replay itself for her.\n\nSuzanne followed the murderers to their front door and inside she could see them celebrating. She called the police, and when they arrived, the killers opened fire. Consciously using her power for the first time, she froze the bullets and the killers in time. After giving her statement to the police, the detective contacted [[MacTaggert, Moira|Dr. Moira MacTaggert]], who then offered Suzanne a chance to train in the use of her mutant abilities. She took the code-name Sway and went with MacTaggert.\n\nDuring the course of her training, she seemed to doubt her capabilities, thereby limiting her control. One night, [[Professor X|Professor Charles Xavier]] came to Dr. MacTaggert and asked her to lend him the four students she was guiding so that they could facilitate the rescue of the original X-Men from the mutant island Krakoa. This team was Xavier’s original rescue team, formed prior to his second generation of X-Men. Sway, along with [[Vulcan (Gabriel Summers)|Kid Vulcan]], [[Petra]], and [[Darwin]], were honored to be offered the chance to help the X-Men as well as being offered a spot on the team, and accepted Xavier’s offer.\n\nUsing his mind, the Professor gave the team months of training in only a matter of hours, even though he led the team to believe it was in fact months later when they shipped off. They were even given individual X-Men uniforms to wear on their mission. During this time, Sway developed a close friendship with the other members of her team. Although the events of the mission have not been revealed, it has been said that all members, save Kid Vulcan, died and forced the professor to gather a second group of X-Men to rescue the originals. All knowledge of Sway’s and her companions’ existence were erased from the minds of the individuals involved.",
        "categories": [
            "X-Men",
            "Women",
            "Heroes",
            "Deceased",
            "Mutants"
        ]
    }
}