{
    "id": 1011392,
    "name": "She-Hulk (Lyra)",
    "description": "",
    "modified": "2013-11-01T16:50:43-0400",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/6/03/527413f4341f7",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011392",
    "comics": {
        "available": 10,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011392/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/38941",
                "name": "Fear Itself: The Deep (2011) #1"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/38942",
                "name": "Fear Itself: The Deep (2011) #2"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/38948",
                "name": "Fear Itself: The Deep (2011) #4"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/29541",
                "name": "Incredible Hulks (2009) #602 (SHS VARIANT)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/29979",
                "name": "Incredible Hulks (2009) #603 (SHS VARIANT)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/28668",
                "name": "Incredible Hulks (2009) #603 (ZOMBIE VARIANT)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/29830",
                "name": "Incredible Hulks (2009) #605 (DJURDJEVIC 70TH ANNIVERSARY VARIANT)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/30015",
                "name": "Incredible Hulks (2009) #607 (MCGUINNESS VARIANT)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/34460",
                "name": "She-Hulks (2010) #3"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/34462",
                "name": "She-Hulks (2010) #4"
            }
        ],
        "returned": 10
    },
    "series": {
        "available": 3,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011392/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/14059",
                "name": "Fear Itself: The Deep (2011)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/8842",
                "name": "Incredible Hulks (2009 - 2011)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/11799",
                "name": "She-Hulks (2010 - 2011)"
            }
        ],
        "returned": 3
    },
    "stories": {
        "available": 12,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011392/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/80391",
                "name": "Cover From She-Hulks (2010) #3",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/80395",
                "name": "She-Hulks #4",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/85445",
                "name": "Fear Itself: The Deep #1",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/85447",
                "name": "Cover #85447",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/85448",
                "name": "Interior #85448",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/85459",
                "name": "Fear Itself: The Deep (2011) #4",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/85460",
                "name": "Fear Itself: The Deep (2011) #4 - Int",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/94784",
                "name": "Incredible Hulks (2009) #602, SHS VARIANT",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/94785",
                "name": "Incredible Hulks (2009) #603, SHS VARIANT",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/94786",
                "name": "Incredible Hulks (2009) #603, ZOMBIE VARIANT",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/94787",
                "name": "Incredible Hulks (2009) #605, DJURDJEVIC 70TH ANNIVERSARY VARIANT",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/94793",
                "name": "Incredible Hulks (2009) #607, MCGUINNESS VARIANT",
                "type": "cover"
            }
        ],
        "returned": 12
    },
    "events": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011392/events",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/events/302",
                "name": "Fear Itself"
            }
        ],
        "returned": 1
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011392/she-hulk_lyra?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Lyra?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "blurb": "",
        "real_name": "Lyra",
        "aliases": "Savage She-Hulk, She-Hulk from Earth-8009, Agent SH-8009, Greenwitch",
        "identity": "Known to authorities",
        "occupation": "Warrior, A.R.M.O.R. agent, Intelligencia agent",
        "citizenship": "citizen of The United Sisterhood Republic",
        "place_of_birth": "presumably Milago, [[Earth-8009]]",
        "relatives": "[[Thundra]] (mother), [[Hulk (Bruce Banner)]] (father), [[Skaar]], [[Hiro-Kala]] (half-brothers), Brian Banner, Rebecca Banner (paternal grandparents, deceased), [[She-Hulk|Jennifer Walters]] (first cousin, once removed), extended family via father",
        "groups": "[[A.R.M.O.R.]]; formerly [[Frightful Four]], [[The United Sisterhood Republic]]",
        "education": "Tutored by the [[Gynosure]]",
        "height": "6'6\"",
        "weight": "220 lbs.",
        "eyes": "Green",
        "hair": "Red",
        "powers": "Lyra is a product of two of the mightiest mortals of their time, therefore she has inherited numerous [[Glossary:S#superhuman|superhuman]] attributes from both. She has the speed and agility of her mother coupled with the strength and durability of her father. Lyra can also use her superhumanly strong leg muscles to leap great distances - over 600' high and 1000' across. It is entirely possible that Lyra also has the Hulk's resistance to extreme temperatures, poisons, and diseases but that, too, has yet to be revealed. In her time, Lyra had been covered in pheromones that repel the [[Venom (Mac Gargan)|Venom symbiote]], and they are just as effective against the villain of [[Earth-616]]. Lyra can transform back and forth at will because of a serum Banner developed based on S.P.I.N. (Super-Power Inhibiting Nanites) technology.",
        "abilities": "Lyra has been extensively trained in the art of armed and unarmed combat and is considered to be the greatest warrior among her people, specializing in bladed and projectile weaponry",
        "weapons": "Lyra has been observed fighting with anything from spears and swords to laser rifles",
        "paraphernalia": "[[Boudicca]], a small A.I. device she wears on her wrist",
        "debut": "Hulk: Raging Thunder (2008)",
        "origin": "Hulk: Raging Thunder (2008)",
        "significant_issues": "Origin of how Lyra came to be (Hulk: Raging Thunder, 2008); Lyra leads a raiding party on an enemy outpost (Hulk Family: Green Genes, 2009); Lyra travels to the past in search of a something to save her future (Savage She-Hulk #1, 2009); Lyra fights She-Hulk as she searches for Norman Osborn (Savage She-Hulk #2, 2009); Lyra fights Noh-Varr and is captured until she reveals why she wants Osborn (Savage She-Hulk #3, 2009); Abandoning her mission, Lyra takes on the Avengers and becomes an agent of A.R.M.O.R. (Savage She-Hulk #4, 2009); Defeated Phinn Mac Mram and the Cyber-Sidhe (Incredible Hulk #600, 2009); Ambushed by Gamma Corps: Black and fought to avenge a fallen comrade (Incredible Hulk #601-605, 2009); At odds with the Red She-Hulk (Fall of the Hulks: Gamma, 2010); Joined the Frightful Four and kidnapped Reed Richards (Hulk #19, 2010); Fought Thundra and found She-Hulk on the Hellcarrier (Fall of the Hulks: The Savage She-Hulks #1 ,2010); Revealed to be an ally of Bruce Banner (Incredible Hulk #608, 2010); Freed She-Hulk and fought against Hulk army (Fall of the Hulks: The Savage She-Hulks #3, 2010); Enrolled in high school, tracked down members of the Intelligencia, humiliated by Wizard (She-Hulks #1-4, 2011)",
        "main_image": "Lyra.jpg",
        "bio_text": "Born in a future where an ongoing war wages between the sexes, she was an outcast among her people. Traveling to the past to save those who exiled her, she found a place where she could make a future of her own design. She is '''Lyra''', the savage She-Hulk.",
        "bio": "Born in a future where an ongoing war wages between the sexes, she was an outcast among her people. Traveling to the past to save those who exiled her, she found a place where she could make a future of her own design. She is '''Lyra''', the savage She-Hulk.\n\n== Parental Powerhouses ==\n\n[[image: Acotilletta2--Lyras_parents.jpg|150px|left]] In a possible future where women and men remain separated and wage war for control of the Earth, the feminist leader, [[Thundra]], decided she must have an heir to lead her armies when she could no longer do so. Despite the views of her people, Thundra chose to birth a daughter the old fashioned way – combining the cells from both man and woman. However, this fearless leader couldn't choose just anyone to form that bond with. She needed someone with power to match, or rival, her own. Having traveled through time and space before, Thundra knew of one individual worthy of this honor, the incredible [[Hulk (Bruce Banner)|Hulk]]. She disguised her true purpose of confronting the Hulk from her people, but her mission was a success. Using cell scrapings from the green goliath and fusing them with her own, Thundra was the first women in generations to become pregnant.\n\n\n== Leader of the Sisterhood ==\n\nWhen Lyra came of age and took control of the armies of [[The United Sisterhood Republic]], she was respected, loved and considered the greatest warrior among her people, but because she was the only woman on Earth with a father, she was not well liked. Having a father made her different - tainted by a man's genes. Even when leading an assault against a suspected munitions depot of the male armies, her troops followed but didn't completely trust her. It turned out the depot was actually a breeding facility, and Lyra discovered the men reproduce in the same fashion as the women. Only a small boy stood in her way of dealing a severe blow to her enemies, but even though the boy did not pose a threat, Lyra couldn't bring herself to kill the children inside and lied to her forces about her discovery. She blamed her father for her compassion and restraint before regrouping with her allies on the battlefield.\n\n== Faced With Extinction ==\n\n[[image: Acotilletta2--Lyra_vs_Nella.jpg|200px|left]] Soon, the Sisterhood was faced with its own troubles concerning their continued existence. Their birthing chambers, called the Cradle, had malfunctioned, and all it did was deliver still born babies. Lyra was entrusted with a mission by the [[Gynosure]] to repair the Cradle, and with its success, Lyra would remove the stain on her name that came with having an actual father. It was a grueling journey for her and her followers, deep into the territories of the various male tribes, but Lyra was determined to succeed. Many warriors paid with their lives on both sides, but Lyra finally made her way to the male birthing center containing the identical parts needed to fix the Cradle. Lyra was concerned about causing the extinction of man, but her apprehension should have been focused on herself. Unexpectedly, one of Lyra's sisters attacked her with the intention of murdering her, revealing the same people who created Lyra wanted to rid the Sisterhood of her masculinity. Lyra defended herself and killed her attacker, breaking the one hope for the Cradle in the process. Now both male and female survival was in jeopardy. Enraged, Lyra confronted the Gynosure, but she didn't get very far. The Gynosure feared Lyra may turn against the Sisterhood one day and built a failsafe to trigger Lyra's one weakness, rendering her helpless. The Gynosure reminded Lyra that while all other women born from the Cradle were sterile, Lyra could still give birth to a child.  \n\n== To Forge Her Own Future ==\n\nArming her with that knowledge, the Gynosure sent Lyra back in time to find Earth’s greatest male hero – a task easier said than done. Once she arrived at her destination, Lyra was attacked by [[A.R.M.O.R.]] soldiers followed by [[She-Hulk]]. The jade giantesses brawled throughout the city, and when She-Hulk made reference to Lyra's mother, it only fueled her anger that much more. Lyra felt Thundra abandoned her to the fear and hatred of the Sisterhood, and her rage only made Lyra weaker, making her vulnerable to She-Hulk's next attack. Lyra was saved from humiliation, however, when the [[Sentry (Robert Reynolds)|Sentry]] arrived and removed She-Hulk from the equation. He'd heard Lyra was looking for the Earth's greatest hero and wanted to know what she wanted with him. Lyra told Sentry he was mistaken. She was looking for none other than [[Green Goblin (Norman Osborn)|Norman Osborn]]. This led to an [[encounter with the Avengers]]. Initially abandoning her quest to save her people, Lyra discovered her companion from the future would complete the task single-handedly. Once in A.R.M.O.R. custody, [[Boudicca]] revealed to Lyra their mission was a success when she reprogrammed a robot at one of Osborn's facilities to place the part needed to repair the Cradle somewhere the Sisterhood would find it in the future. Lyra then told [[Portal|Charles Little Sky]], head of the organization, Boudicca stole all of Osborn's secrets from Avengers' database. In return for the intel, Lyra was allowed to stay in the past and become an agent of A.R.M.O.R.!  \n\n\n\n== Agent of A.R.M.O.R. ==\n\n[[image: Lyra_vs_Phinn.jpg|205px|left]] Her first mission: stop [[Phinn Mac Mram]] from taking over the planet. Hailing from [[Earth-01011010]], the [[Cyber-Sidhe]] were feared throughout their world. However, banishment from their native planet did not give them pause from their mission of total domination. Lyra was all that stood in the way of their ultimate success, and her rage was fueled even further when the Chromedruids of the Sidhe temporarily seized control of her loyal companion, Boudicca. Gaining the upper hand over the dimensional invaders, Lyra was forced to cease her actions when Phinn Mac Mram held the lives of several human hostages in his hands. Lyra was challenged to combat in a ritual of the Cyber-Sidhe, and having no other recourse, she agreed. Using her \"Gamma Sight\", Lyra was able to defeat the Cyber-Sidhe when she tore the robotic heart from Phinn's chest and released the tiny robotic being within she assumed was his soul.\n\n== Search for She-Hulk ==\n\nWhen She-Hulk went missing, Lyra set out to find her with the help of another A.R.M.O.R. agent. A spy within the organization told an old foe of the Hulk's where to find her, and soon [[Ryker, John|General John Ryker]], now taking his orders from Norman Osborn, made his move. Ryker sent his new team – [[Gamma Corps: Black]] – to intercept and capture Lyra and retrieve Boudicca for Osborn. The operative called [[Axon]] murdered Lyra's partner, and the creature called [[Morass]] was the first to feel Lyra's vengeance. With only [[Aberration]] to actually challenge Lyra on a purely physical level, the fight could go either way, but Lyra was determined to carry out her threat to kill the women of Gamma Corps: Black. Axon and Aberration found some leverage in the form of hostages of a nearby town to hopefully keep Lyra in check, but her reaction wasn't as they planned. Unfazed by the innocent lives at stake, Lyra quickly terminated Aberration, leaving only Axon to deal with. However, Lyra had a change of heart, remembering her mission to find the She-Hulk. Knowing Jennifer Walters would never willingly allow others to come to harm, Lyra surrendered to Axon until such a time where she could outwit her, and take her down. General Ryker wasn't as forgiving and killed Axon for failing her mission. Lyra continued on her way to the last known sighting of the She-Hulk and found the destroyed [[A.I.M.]] base.\n\n== Mommy Dearest ==\n\n[[image: Acotilletta2--Lyra_vs_Thundra.jpg|205px|left]] Lyra accidentally discovered her mother was in her present timeline and searched for Thundra to mete out revenge for the Sisterhood's betrayal in the future. Furious over being exiled by the family she was supposed to protect – the only family she'd ever known – Lyra was determined to make Thundra pay. Despite her mother's best efforts to keep her at bay, Lyra hammered Thundra repeatedly, forcing her to listen to how her life was ruined. Fearful the future may be altered by the influx of information plus the meeting that wasn't supposed to happen yet, Thundra reacted violently. Lyra may possess the combined power of two of the strongest individuals to ever walk the Earth, but Thundra was a woman fighting for something more meaningful than vengeance. Lyra was overpowered and defeated, leaving Thundra to believe she was a bad mother when in fact she saved her daughter's life by ensuring she would exist in the future.\n\n== World War Hulks ==\n\nLyra had agreed to help the [[Intelligencia]], and was offered a place in the newly reformed [[Frightful Four]]. She accompanied them on a mission to the [[Baxter Building]] to kidnap [[Mister Fantastic]]. Lyra went one-on-one with the [[Human Torch (Johnny Storm)|Human Torch]] and defeated him by snuffing out his flame. Playing her part well, Lyra gained the trust of her companions which revealed the true reason she allied herself with them. Never abandoning her mission to find the She-Hulk, Lyra explored the [[Hellcarrier]] until she found and freed her. Soon after in a staged battle on the same vessel, with her half-brother [[Skaar]], Lyra revealed she was on the side of the angels all along. When the Intelligencia set their [[Intelligencia's master stroke|plan]] in motion, unleashing an army of Hulks on the nation's capital, Lyra and She-Hulk stood against them along with a previous enemy in the form of the [[Red She-Hulk]]. The combined efforts of the She-Hulks, Hulks and numerous allies ensured the Intelligencia's defeat although not all were captured.\n\n== Growing Pains ==\n\n[[image: Acotilletta2--Lyra_dress442.jpg|200px|left]] Lyra spent some time with Banner but found it difficult to connect with him. She was sent to live in New York with the She-Hulk because her father felt the best thing for her was a positive female role model and to learn about the world she was going to protect. She was given a serum enabling her to transform back and forth at will and soon had a new challenge to face – [[Midtown High School]]. Banner wanted Lyra to get an education but knew she was needed to help round up the members of the Intelligencia who went into hiding. Lyra and She-Hulk caught four escapees, but [[Wizard]] vowed to make them pay. During her school dance Lyra was attacked by Wizard after he broke out of Banner's detention center. Her identity was exposed to the whole school, one of her classmates was badly injured, and while She-Hulk came to the rescue defeating the Wizard, Lyra was blamed by her peers for the entire incident. She-Hulk escorted Lyra from the premises, but whether or not she returns to Midtown High remains uncertain.",
        "categories": [
            "Heroes",
            "Hulk",
            "Women"
        ]
    }
}