{
    "id": 1011052,
    "name": "Cardiac",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/2/70/4c003117e0b75",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011052",
    "comics": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011052/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/11982",
                "name": "Web of Spider-Man (1985) #107"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/11983",
                "name": "Web of Spider-Man (1985) #108"
            }
        ],
        "returned": 2
    },
    "series": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011052/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2092",
                "name": "Web of Spider-Man (1985 - 1995)"
            }
        ],
        "returned": 1
    },
    "stories": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011052/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/21697",
                "name": "Tainted, Part 1",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/21700",
                "name": "Tainted, Part Two",
                "type": "interiorStory"
            }
        ],
        "returned": 2
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011052/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011052/cardiac?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Cardiac?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Dr. Elias \"Eli\" Wirtham",
        "aliases": "None",
        "identity": "Secret",
        "occupation": "Vigilante, physician, surgeon, owner and administrator of biological research firm",
        "citizenship": "U.S.A.",
        "place_of_birth": "Roslyn, New York",
        "relatives": "[[Wirtham, Joshua|Joshua Wirtham]] (brother, deceased), unnamed mother",
        "groups": "None",
        "education": "Doctorate in Medicine",
        "height": "6'5\"",
        "weight": "300 lbs.",
        "eyes": "Brown",
        "hair": "Black",
        "powers": "Cardiac derives all his powers from his \"beta technology\" enhancements. Through his Vibranium-mesh pseudoskin, he channels energy from the compact beta-particle reactor implanted in his chest into his muscles, granting him superhuman strength, speed, reflexes, and endurance. He is able to channel the energy through his fists or his pulse-staff in the form of concussive energy blasts. His vibranium-mesh pseudoskin gives him a high degree of resistance to impact attacks (bullets included). Although the full extent of his powers are unknown, he must somehow recharge his artificial heart from time to time.",
        "abilities": "Elias possesses a great, intuitive knowledge of medicine. He is brilliant as well.",
        "weapons": "Cardiac wields a weapon of his own design called a pulse-staff. It can telescope into a six-foot long staff for hand-to-hand combat, and can also contract to the size of a baton. As mentioned earlier, he is able to channel beta particles into the staff, allowing it to fire blasts of concussive force.",
        "paraphernalia": "Cardiac's costume is composed of padded stretch fabric, containing numerous pockets and pouches that contain chemicals and additional weaponry.",
        "origin": "Amazing Spider-Man #360 (1992); Amazing Spider-Man #376 (1993)",
        "debut": "Amazing Spider-Man #344 (1991)",
        "significant_issues": "[[OHOTMU:Bibliography-Spider-Man_2007#Cardiac|Official Handbook Bibliography]]",
        "main_image": "Wezqu--Cardiac Head.jpg",
        "bio_text": "Torn by conflict, corporate greed and the deaths of innocents turned Dr. Wirtham into the man he is today: the vigilante Cardiac.",
        "bio": "Torn by conflict, corporate greed and the deaths of innocents turned Dr. Wirtham into the man he is today: the vigilante Cardiac.\nDr. Elias Wirtham was a dedicated physician who, while still a child, lost his older brother to a rare and incurable disease. With that, Elias vowed to become a physician. Graduating from medical school, he went on to build the most powerful medical and biological research empire on the East Coast. Acquiring an older chemical company, he learned that it had produced a drug that could have saved his brother, but kept it off market until the economic climate was more favorable. Enraged and embittered, he vowed to strike at those individuals whose positions or technicalities protected them from the law.\n\nIn order to undertake this crusade, Elias underwent a series of extremely painful operations that replaced his heart with a compact beta-particle reactor and encased his entire body within a layer of Vibranium-mesh pseudoskin, specifically designed to channel beta particles into his muscles. He became Cardiac, the cyborg-vigilante.\n\nCardiac's first target was Sapridyne Chemicals, who supposedly manufactured legal chemicals needed to process cocaine, and were being exported to South America. [[Spider-Man (Peter Parker)|Spider-Man]] came to take pictures and expose the company to the public, but Cardiac came to completely and utterly destroy the place. Spider-Man (working for [[Silver Sable]] at the time), the [[Rhino (Aleksei Sytsevich)|Rhino]] (working for [[Hammer, Justin|Justin Hammer]], who had stocks invested in the company), and [[Boomerang]] (working for Hammer as well) failed to stop Cardiac.\n\nSince then, Cardiac has gone on vigilante raids against [[Brucker, Albert|Albert Brukner]] (a corrupt S&L broker), a subsidiary of [[Stane International]] that produced dangerous dolls for children, [[Gant, William|William Gant]] and his movie studio (he produced documentaries on human suffering), and New York's [[Code: Blue]] (a branch of the NYPD devoted to stopping superhuman threats). During his attack on Gant, he ran into [[Styx]] and [[Stone (Gerald Stone)|Stone]], Gant's bodyguards. At first, Cardiac pretended to befriend the pair, but betrayed them and would have killed Styx if Spider-Man had not intervened.\n\nCardiac knows that he doesn't live in a perfect world. He wants to save lives, but often has to take them, and is haunted by every death he causes. But he cannot stop his crusade—his compassion makes him ruthless, and his desire for justice compels him to break the law.\n\nIn all probability, Cardiac continues his vigilante war.",
        "categories": [
            "Heroes",
            "Spider-Man"
        ]
    }
}