{
    "id": 1011181,
    "name": "Thena",
    "description": "Thena, a second generation Eternal, is the eldest daughter of Zuras, leader of the Eternals of Earth, and Cybele, and although she has lived for more than 4,000 years, she is still considered a young woman by Eternal standards.",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/8/a0/4c002f2a83a8c",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011181",
    "comics": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011181/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/8813",
                "name": "Eternals (1976) #5"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/4322",
                "name": "Eternals by Jack Kirby (Hardcover)"
            }
        ],
        "returned": 2
    },
    "series": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011181/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2017",
                "name": "Eternals (1976 - 1978)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1770",
                "name": "Eternals by Jack Kirby (2006)"
            }
        ],
        "returned": 2
    },
    "stories": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011181/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/20525",
                "name": "[Revealed This Issue! The Power Of Olympia!]",
                "type": "cover"
            }
        ],
        "returned": 1
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011181/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011181/thena?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Thena?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "blurb": "",
        "real_name": "Thena (changed by royal decree from her original name, Azura)",
        "aliases": "Thena Eliot, Corona, Minerva/Athena (Often mistaken for the [[Glossary:O#Olympian|Olympian]] goddess).",
        "identity": "The fact that Thena is an Eternal has been publicly revealed, but is generally disbelieved.",
        "occupation": "Scholar, warrior; former Prime Eternal",
        "citizenship": "First citizen of [[Olympia]]",
        "place_of_birth": "Olympia, Greece",
        "relatives": "Zuras (father), Cybele (mother), Deborah Ritter (daughter), Donald Ritter (son), Thomas Eliot (husband, deceased), Joey Eliot (adopted son), Alars (Mentor, uncle), Sui-San (aunt, deceased), Eros ([[Starfox]], cousin), [[Thanos]] (cousin)",
        "groups": "[[Eternals]] of Earth; formerly Heroes for Hire, the New Breed",
        "education": "Has studied under the greatest Eternal and human scholars throughout her lifetime.",
        "height": "5'10\"",
        "weight": "160 lbs.",
        "eyes": "Blue",
        "hair": "Blonde",
        "powers": "Thena possesses the conventional attributes of her race as well as certain special abilities developed through rigorous discipline, to include: Augmented life-force, regeneration, levitation and projection of cosmic beams.  She can physically manipulate atoms and molecules so as to transform an items shape.  She can lift (press) about 1,200 pounds.  When in combat, she wields cosmic energy to enhance her physical strength and durability (lifting up to 25 tons).",
        "abilities": "Thena possesses low-level psychic abilities which allow her to engage in simple short-range telepathic communication with other persons and to scan the superficial thoughts of any mind less adept than her own.  She can also psionically affect the sense perceptions of persons around her to a limited degree.  Thena has considerable skill in hand-to-hand combat and is an accomplished athlete.",
        "weapons": "Spear, crossbow",
        "paraphernalia": "",
        "debut": "(As \"Minerva\") Red Raven Comics #1 (1940); (as Thena) Eternals #5 (1976); (as Corona) New Eternals: Apocalypse Now #1 (2000)",
        "origin": "",
        "significant_issues": "Advised Zuras on decision to send Makkari to Earth (Red Raven Comics #1, 1940); joined Makkari in confronting Deviants in New York, revealed Eternals' existence to humanity (Eternals #5-6, 1976); visited Lemuria with Kro, took Ransak & Karkas back to Olympia with her (Eternals #8-12, 1977); alongside Ransak & Karkas, vs Zakka & Tutinax (Eternals Annual #1, 1977); vs Deviants in New Lemuria, met Thor (Thor #285-289, 1979); vs Olympian gods (Thor #291-292, 1980); with Eternals, witnessed death of Zuras (Thor #300-301, 1980); with Eternals, met Inhumans (What If..? #29, 1981); Zuras' body dispersed, became Eternals' leader (Iron Man Annual #6, 1983); with Eternals, alongside Avengers, vs Maelstrom, witnessed departure of most of Earth's Eternals (Avengers #246-248, 1984); formally became Prime Eternal (Eternals #1, 1985); fell under sway of Kro, aided him (Eternals #2-8, 1985-1986); vs Ikaris for status of Prime Eternal, lost (Eternals #9, 1986); vs Ghaur, learned Kro had manipulated her (Eternals #10-12, 1986); with Eternals, confronted Silver Surfer (Silver Surfer Annual #1, 1988); sent Forgotten One to aid against demonic invasion of Manhattan (Avengers #299, 1989); Olympia cast into Negative Zone, briefly slain by Blastaar (Avengers #308-310, 1989); revealed existence of her & Kro's children (Eternals: The Herod Factor #1, 1991): aided Avengers against Gatherers (Avengers #374-375, 1994); with Eternals, alongside Fantastic Four, vs Maelstrom (Fantastic Four Unlimited #10, 1995); kidnapped by Deviants, rescued by Heroes for Hire (Heroes For Hire #5-7, 1997-1998); joined Heroes for Hire against the Master of the World (Heroes For Hire #11-12, 1998); with Heroes For Hire, vs Man-Beast & Acolytes (Heroes For Hire #15-16/Quicksilver #12/Marvel Comics 1998 Annual Starring Heroes For Hire & Quicksilver, 1998); Heroes for Hire disbanded (Heroes For Hire #19, 1998); with Eternals, vs Apocalypse (New Eternals: Apocalypse Now #1, 2000); with Eternals, became mortal due to machinations of Sprite, opposed Dreaming Celestial (Eternals #1-7, 2006-2007)",
        "main_image": "Thena442.jpg",
        "bio_text": "Thena is a second generation Eternal (evolutionary offshoot of humanity created by experiments performed by the [[Celestials]]), being the eldest daughter of [[Zuras]], leader of the Eternals of Earth, and [[Cybele]].  Although she has lived for over 4,000 years, Thena is still considered a young woman by Eternal standards.  At her birth she was named Azura in honor of her father, Zuras.",
        "bio": "Thena is a second generation Eternal (evolutionary offshoot of humanity created by experiments performed by the [[Celestials]]), being the eldest daughter of [[Zuras]], leader of the Eternals of Earth, and [[Cybele]].  Although she has lived for over 4,000 years, Thena is still considered a young woman by Eternal standards.  At her birth she was named Azura in honor of her father, Zuras.  \n\n\nWhen the civilization of ancient Greece began to rise, the Olympian god [[Zeus]] decided to make the presence of the Olympian gods known to the Greeks so that they would worship him and the other gods.  The principal nexus between the [[Glossary:D#dimension|dimension]] of [[Glossary:O#Olympus|Olympus]] and Greece lay atop Greece's [[Glossary:M#Mount Olympus|Mount Olympus]], near Olympia, the capital city of the Eternals.  Zeus and his daughter [[Athena]] (Roman name Minerva) held a meeting with Zuras and Azura, who had become her father's principal advisor.  Noticing the marked physical resemblance between Zeus and Zuras and between Azura and herself, Athena suggested that the Olympian gods and the Eternals form an alliance in which the Eternals would act as the gods representatives on Earth.  Zeus, Zuras, and Azura agreed, and Zeus gave Azura her current name of Thena to signify the sealing of the pact, and also to indicate that she would serve as Athena's personal representative.  However, over the many years, many humans came to think of several Eternals not as representatives of the Olympian gods, but as the gods themselves.  Thena was constantly mistaken for the goddess Athena, for example.  All of this confusion led to a growing resentment by the gods towards the Eternals, which eventually erupted into a war, during which there was a bitter combat between Thena and Athena.  However, the war ended the very same day that it began, and the Olympian gods and Eternals are now at peace.\n\nIn ancient times, Thena first encountered [[Kro]], warlord of the [[Deviants]], another offshoot of humanity created by the Celestials.  At some point, Thena and Kro became strongly attracted to each other, but their two peoples were often in conflict.  Thena even accompanied Kro to the Deviants city on the undersea continent of [[Lemuria]], but the tour ended badly, along with their relationship.  Until recent years Thena had not seen Kro for a millennium, and had believed him to be dead.  However, Kro is unusually long-lived for a Deviant, a secret he never revealed to his own people.  \n\nDuring World War II, Kro served Deviant interests by funding various armies and criminal enterprises.  Thena advised Zuras to send the Eternal [[Makkari]] to deal with Kro, and Makkari did so under the alias of Hurricane.  At one point, the Eternals encountered the [[Inhumans]], a race whose powers had come from experiments by the extraterrestrial [[Kree]], and Thena joined the Eternals in helping the Inhumans relocate their city of Attilan from the North Atlantic Ocean to the Himalayan Mountains.\n\nDuring one encounter between Thena and Kro, the two made love and Thena became pregnant with twin children.  To conceal the affair from her people, Thena kidnapped an infertile human woman and placed the twins within her womb so that they could be raised as humans.  When the Celestials sent their Fourth Host to Earth in order to judge the worthiness of humanity, the Eternals and the Deviants, Kro led a Deviant force in attacking humanity in hopes of provoking them to assault and principal advisor, assumed his position as leader of the Eternals of Earth.  the Celestials.  Thena confronted Kro and helped bring an end to hostilities.  Kro extended another invitation for Thena to visit Lemuria, and she accepted.  In Lemuria, Kro introduced her to [[Ransak]] the Reject, a deviant who was virtually human in appearance, giving Kro hope that his people's curse of genetic instability could be overcome.  Although Ransak was wild and distrustful, Thena won his confidence.  She also met the Deviant [[Karkas]], who proved to have the gentle soul of a poet that belied his monstrous visage.  Thena brought Ransak and Karkas to Olympia to live among the Eternals, and she helped tutor Ransak to become more human.\n\nAfter the arrival of the [[Fourth Host of the Celestials]], the Eternals and Deviants decided to reveal their existence to humanity.  At this time Thena publicly revealed herself to be an Eternal.  However, the general public tends to disbelieve the existence of these \"hidden races\".  Thena encountered Kro again when she, Karkas and Ransak joined fellow Eternals [[Ikaris]] and [[Sersi]] in exploring a Deviant outpost beneath New York City, and were aided against the Deviants by the Asgardian god [[Thor (Thor Odinson)|Thor]].  Thor returned to Olympia with the Eternals and fought by their side when his own father [[Odin]] sided with the Olympian gods in assaulting Olympia, believing the Eternals to be pawns of the Celestials.  Thena briefly sparred with Athena, but the battle was finally called off.  The Eternals subsequently merged into the [[Uni-Mind]] to help Odin and the [[Asgardians]] confront the Celestials, but when the Celestials destroyed the Uni-Mind, the psychic backlash killed Zuras.  Zuras' body was returned to Olympia, and eventually his power passed from him to Thena.  His last message to Thena was that the Eternals' destiny lay off-world, and most of Earth's Eternals departed in the form of a Uni-Mind to explore the cosmos.  \n\nThena claimed the full power and title of Prime Eternal in her father's stead, but fell under the sway of a mind-altering brain-mine that Kro had planted on her.  Kro became the Deviants ruler, but soon found that the true power in Lemuria lay with the priesthood led by [[Ghaur]].  As Ikaris led some of the Eternals against the Deviants in violation of Thena's orders, Thena herself helped Kro escape Ikaris, finally revealed her deception before the Eternals, and helped Kro escape the priesthood.  Thena and Kro found themselves pursued by both of their peoples, and Ikaris bested Thena in combat for the title of Prime Eternal.  When Ghaur attempted to revive the [[Dreaming Celestial]], a rogue member of the Celestials, Kro removed the brain-mine so that Thena could regain her full power and help the Eternals prevent the Celestial's awakening.\n\nKro eventually gave up the throne of Lemuria and a new regime emerged.  The new rulers were tricked by a false scroll into believing that the offspring of an Eternal and a Deviant would destroy them, forcing Thena to confront the twin children she had given up before their births.  Thena's now-teenage children, having been raised as Donald and Deborah Ritter, learned their true heritage from Thena and were introduced to Kro as well.  The scrolls identifying the children as threats proved to be forgeries created by Dr. [[Damian, Daniel|Daniel Damian]], a one-time ally of the Eternals who blamed Ikaris for his daughter's death.\n\nThena and Kro both kept a watchful eye on their children from then on, and the children were endangered again when Maelstrom's minions attempted to use their lives to revive [[Maelstrom]], but the [[Fantastic Four]] helped the Eternals rescue the twins.  The twins were also imperiled by Ghaur when he attempted to use them alongside captured Eternals in an \"Anti-Mind\" to challenge the Celestials, but Kro and the [[Heroes for Hire]] helped save them.  Thena took permanent custody of the twins after that and searched for a sanctuary where they would be safe, ultimately deciding to stay with the Heroes for Hire.  Thena became a regular member of the team, battling threats such as the [[Master]] and [[Exodus]], but the group ultimately disbanded after they were purchased by the Stark-Fujikawa Corporation.\n\nA sudden change in the Earth's atmosphere resulted in the resurrection of several Eternals whose body's molecules were reconstituted in Olympia, among them Zuras.  When the Eternal [[Sprite]] sought to become mortal so that he could enjoy an ordinary life, he manipulated the Dreaming Celestial to refashion all of Earth's Eternals into humans with manufactured memories, ordinary lives and no recollection of who or what they truly were.  Thena became Dr. Thena Eliot, wife of [[Eliot, Thomas|Thomas Eliot]], and became an inventor employed by [[Iron Man (Anthony Stark)|Anthony Stark]].  While and Thomas were attending a party at the Vorozheikan Embassy, Thomas was killed by a band of terrorists who took Thena captive.  Eventually rescued by Iron Man, Thena began to recollect who she was.  She finally regained access to her powers and most of her memories, and she joined other awakened Eternals in confronting the Dreaming Celestial, which was now in danger of reviving.\n\nThrough communication via Makkari, the Eternals learned that the Dreaming Celestial would remain in San Francisco to begin a new judgment on Earth, and that its awakening would eventually result in an invasion by the extraterrestrial [[Horde]].  The Eternals retired to Olympia to resume their guardianship over the Earth.  Thena brought Joey with her to Olympia, in defiance of her father's wishes.",
        "categories": [
            "Women",
            "Heroes",
            "Cosmic",
            "International",
            "Gods",
            "Civil War"
        ]
    }
}