{
    "id": 1011233,
    "name": "Fat Cobra",
    "description": "",
    "modified": "2011-05-26T17:52:52-0400",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/e/f0/4db58b3c6aaa6",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011233",
    "comics": {
        "available": 9,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011233/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/16158",
                "name": "Immortal Iron Fist (2006) #9"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17393",
                "name": "Immortal Iron Fist (2006) #12"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17635",
                "name": "Immortal Iron Fist (2006) #13"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/21361",
                "name": "Immortal Iron Fist (2006) #16"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/24166",
                "name": "Immortal Iron Fist (2006) #26"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/24824",
                "name": "Immortal Weapons (2009) #1"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/29795",
                "name": "Iron Man 2.0 (2011) #6"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/36466",
                "name": "Wolverine (2010) #18"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/41121",
                "name": "Wolverine (2010) #18 (Mc 50th Anniversary Variant)"
            }
        ],
        "returned": 9
    },
    "series": {
        "available": 4,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011233/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1140",
                "name": "Immortal Iron Fist (2006 - 2009)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/8877",
                "name": "Immortal Weapons (2009 - 2010)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/9924",
                "name": "Iron Man 2.0 (2011)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/9962",
                "name": "Wolverine (2010 - 2012)"
            }
        ],
        "returned": 4
    },
    "stories": {
        "available": 10,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011233/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/33007",
                "name": "TBD 2 of 5",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/36462",
                "name": "TBD 5 of 7",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/36902",
                "name": "TBD 6 of 7",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/47175",
                "name": "1 of 2",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/53549",
                "name": "4 of 4",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/54878",
                "name": "Interior #54878",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/64737",
                "name": "Interior #64737",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/80961",
                "name": "Wolverine (2010) #18",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/80962",
                "name": "Wolverine (2010) #18 - Int",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/93092",
                "name": "Wolverine (2010) #18, Mc 50th Anniversary Variant - Int",
                "type": "interiorStory"
            }
        ],
        "returned": 10
    },
    "events": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011233/events",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/events/302",
                "name": "Fear Itself"
            }
        ],
        "returned": 1
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011233/fat_cobra?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Fat_Cobra?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Unrevealed",
        "identity": "Known to many throughout the world and beyond the stars",
        "aliases": "None",
        "occupation": "Immortal Weapon, former opera singer, soldier, adventurer, Kung Fu commando, self-defense instructor, actor, football player, gladiator, Kung Fu teacher",
        "place_of_birth": "[[Peng Lai Island]]",
        "groups": "[[Immortal Weapons]]",
        "citizenship": "Peng Lai Island",
        "education": "Unrevealed, but with all of the places Fat Cobra has lived, it is probable he's been taught a great number of things about a great number of subjects",
        "relatives": "Unidentified mother and father (presumably deceased), hundreds of unidentified children (deceased)",
        "height": "Unrevealed",
        "weight": "Unrevealed",
        "eyes": "Black",
        "hair": "Black",
        "powers": "Fat Cobra is a man of immense size and with it comes legendary strength and durability at his disposal. As with all those who bore the Cobra mantle before him, Fat Cobra's chi is strong, enabling him to regenerate injured or missing limbs. He demonstrated the ability to call upon the powers of lightning to aid him in combat by turning it into powerful strikes such as his Cudgel of Misfortune or Whirlwind of Impending Doom. He has also demonstrated the ability to use the energy as a snare to prevent his rivals from escaping. Fat Cobra is over one hundred years old, and while it is obvious he is extremely long-lived, it may even be possible Fat Cobra is truly immortal.",
        "abilities": "Despite his misleading size, Fat Cobra is incredibly fast. It is undetermined if his speed is [[Glossary:S#superhuman|superhuman]] or not, but Fat Cobra strikes swiftly and with deadly accuracy. Add that to his incredible strength and explosive strategist mind, and there is an opponent who is almost impossible to beat.",
        "weapons": "None",
        "paraphernalia": "None",
        "debut": "The Immortal Iron Fist #8 (2007)",
        "origin": "Immortal Weapons #1 (2009)",
        "significant_issues": "Battled 100 Shaolin Terror Priests and won (The Immortal Iron Fist #8, 2007); Fought Iron Fist in the first round of tournament and bested him (The Immortal Iron Fist #9, 2007); Fat Cobra, along with the Immortal Weapons, defeated Hydra and saved K'un-Lun and the other Capital Cities of Heaven (Immortal Iron Fist #14, 2008); journeyed to The Eighth City and was tortured until his escape (Immortal Iron Fist #22, 23, 25, 26, 2009); hired a journalist to write his biography (Immortal Weapons #1, 2009)",
        "main_image": "Acotilletta2--Fat_Cobra.jpg",
        "bio_text": "Fat Cobra was introduced to all at the tournament just as all the other combatants, but Fat Cobra was chosen at random to be the first to entertain in an exhibition match against one hundred [[Shaolin Terror Priests]]. Even though the Terror Priests outnumbered the lone warrior, Fat Cobra's enormous skill and blinding speed proved to be more than a match for them. He defeated the Terror Priests in the exhibition and went on to challenge and overcome the champion of [[K'un-Lun]], [[Iron Fist (Danny Rand)|Iron Fist]]. Fat Cobra's next match would have put him face-to-face with the [[Prince of Orphans (John Aman)|Prince of Orphans]] but after seeing the blatant cruelty to [[Tiger’s Beautiful Daughter]] by [[Steel Serpent (Davos)|Davos]], the Prince of Orphans ask Fat Cobra's permission to challenge Davos instead. Fat Cobra obliged and was content to sit on the sidelines next to Iron Fist and watch the contest.",
        "bio": "Fat Cobra was introduced to all at the tournament just as all the other combatants, but Fat Cobra was chosen at random to be the first to entertain in an exhibition match against one hundred [[Shaolin Terror Priests]]. Even though the Terror Priests outnumbered the lone warrior, Fat Cobra's enormous skill and blinding speed proved to be more than a match for them. He defeated the Terror Priests in the exhibition and went on to challenge and overcome the champion of [[K'un-Lun]], [[Iron Fist (Danny Rand)|Iron Fist]]. Fat Cobra's next match would have put him face-to-face with the [[Prince of Orphans (John Aman)|Prince of Orphans]] but after seeing the blatant cruelty to [[Tiger’s Beautiful Daughter]] by [[Steel Serpent (Davos)|Davos]], the Prince of Orphans ask Fat Cobra's permission to challenge Davos instead. Fat Cobra obliged and was content to sit on the sidelines next to Iron Fist and watch the contest. \n\nLater, at a feast for the contestants, Fat Cobra was thoroughly amused by past exploits of [[Dog Brother #1]] when the Prince of Orphans proposed an alliance to save the city of K'un-Lun from the forces of [[Hydra]]. Fat Cobra was thrilled that the legendary Prince wanted to sit at his table and pushed [[Bride of Nine Spiders (Immortal Weapons)|Bride of Nine Spiders]] out of the way to make room. The assumption that Fat Cobra would have aided the Prince of Orphans, regardless that his city was also threatened, would probably be correct, but either way Fat Cobra stood with the other Immortal Weapons as they confronted the terrorist forces that would have not only obliterated K'un-Lun but the [[Heart of Heaven]] too. Fat Cobra did not want to disappoint his new allies and fought furiously in the coming battle. The forces of Hydra were overcome, but Fat Cobra's adventures are just beginning as he, and the other [[Immortal Weapons]], decided to remain on [[Earth]] and investigate claims of an existing Eighth Capital City of Heaven.\n\nFat Cobra was enjoying his downtime on Earth, but he was not hesitant to get back into the action when John Aman needed to assemble the Immortal Weapons to deal with a threat to Danny Rand. Fat Cobra went toe-to-toe with the [[Cheng, Zhou|Servant of the Ch'i-Lin]] and found a formidable foe, with no clear winner of the contest. An investigation of the killer’s dwelling, led to the discovery of a map, and a close call with a bomb. Fat Cobra took the brunt of the blast, saving the lives of his fellow Immortal Weapons. After Rand had healed from his injuries, Fat Cobra accompanied him on a journey to the Eighth Capital City of Heaven. Once inside [[The Eighth City]], even the mighty Fat Cobra couldn't resist the creatures that lived in this cruel realm, and he was defeated and taken prisoner. He was subjected to the same tortures each of his allies had suffered, but as a true champion, Fat Cobra waited for the time to channel all his energy into a devastating attack. As Iron Fist fought with the ruler of this evil place, [[Iron Fist (Quan Yaozu)|Quan Yaozu]], Fat Cobra took out as many guards as he could before saving Rand from the receiving end of a large knife meant to end Danny's life. Cobra would have killed Yaozu if Danny didn't stop him, but his rage allowed him to fight off an army of monsters while the rest of the Immortal Weapons opened the portal to Earth, so they could escape the wretched city. \n\nDuring his stay on Earth, Fat Cobra hired a man to write his biography because the memories of his long – mostly inebriated – life were lost to him. After returning from The Eighth City, the Book of the Cobra was completed, although most of it wasn't what Fat Cobra expected. He always thought his parents were great warriors instead of mere pig farmers. Fat Cobra was too much for his father to handle alone after his mother died during childbirth, so Fat Cobra was eventually sent to an orphanage on his native land of [[Peng Lai Island]]. Even that wasn't to last, and at two years old, he was banished to Earth where he received his first lesson in the martial arts. His time spent away from Peng Lai brought many humiliating experiences to the proud warrior like when he was the most promising young opera singer in all of China. In time, Fat Cobra did join the military and fought on both sides of a Chinese civil war and used the money he made to travel back to his birthplace. There he began to study Peng Lai Kung-Fu, dreaming of the day he could challenge the great [[Xiang Yao]], the giant snake-dragon living in the caves of Peng Lai Island. Despite his training, Fat Cobra suffered a miserable defeat the first time he fought Xiang Yao and was exiled again from his home land. \n\nBack on the mainland, Fat Cobra served as a side kick for [[Bloodstone, Ulysses|Ulysses Bloodstone]], fought side-by-side with [[Union Jack (Brian Falsworth)|Union Jack]] against the [[Nazi Party]], began instructing others in the ways of Kung-Fu, became a bit actor and football player, and Fat Cobra worked in an underground fighting circuit battling heavyweights like [[Hercules (Heracles)|Hercules]] and [[Volstagg]] in places like [[Olympus]] and [[Atlantis]]. He even traveled to the moon with [[Fury, Nick|Nick Fury]] to quell a pack of Russian werewolves who overran an American base. Still, with all this experience behind him, Fat Cobra was torn in two the second time he faced Xiang Yao, spending two years in a [[S.H.I.E.L.D.]] facility regrowing his missing limbs. After that, Fat Cobra began having flings with countless amounts of women throughout the world and even beyond the stars. It was because of these brief relationships Fat Cobra was able to finally defeat the dreaded snake dragon. [[image: Fat_Cobra_vs_Xiang_Yao.jpg|225px|left|thumb|Fat Cobra becomes the greatest hero in Peng Lai]]Many of the women Fat Cobra bedded down bore children, and when these children came of age they set out looking for the father who abandoned them in order to execute him. For years, and possibly in the hundreds, his children came for him, but Fat Cobra fought back and killed them all. This constant fighting is what enabled him to earn the Cobra mantle when he bested Xiang Yao, becoming the greatest warrior in Pang Lai. When the story was finished, Fat Cobra asked for the strongest wine his wenches could find and tossed his book into the fire, hoping to forget his tragic past all over again.",
        "categories": [
            "Heroes"
        ]
    }
}