{
    "id": 1011078,
    "name": "Starjammers",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/8/90/4c0030d5cf17d",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011078",
    "comics": {
        "available": 11,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011078/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/39443",
                "name": "Essential X-Men Vol. 4 (All-New Edition) (Trade Paperback)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/8653",
                "name": "Excalibur (1988) #69"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/10065",
                "name": "Marvel Comics Presents (1988) #149"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/597",
                "name": "Starjammers (2004) #1"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/535",
                "name": "Starjammers (2004) #2"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/588",
                "name": "Starjammers (2004) #3"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/786",
                "name": "Starjammers (2004) #4"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/867",
                "name": "Starjammers (2004) #5"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/21",
                "name": "Starjammers (2004) #6"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/4434",
                "name": "Uncanny X-Men (1963) #475"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/16023",
                "name": "Uncanny X-Men: Rise & Fall of the Shi'ar Empire (Hardcover)"
            }
        ],
        "returned": 11
    },
    "series": {
        "available": 6,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011078/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/14398",
                "name": "Essential X-Men Vol. 4 (All-New Edition) (2011 - Present)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2011",
                "name": "Excalibur (1988 - 1998)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2039",
                "name": "Marvel Comics Presents (1988 - 1995)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/708",
                "name": "Starjammers (2004)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2258",
                "name": "Uncanny X-Men (1963 - 2011)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2555",
                "name": "Uncanny X-Men: Rise & Fall of the Shi'ar Empire (2007)"
            }
        ],
        "returned": 6
    },
    "stories": {
        "available": 10,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011078/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/776",
                "name": "1 of 12 - Rise and Fall of the Shi-AR Empire",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/2712",
                "name": "1 of 1 - Series Finale",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/2714",
                "name": "Interior #2714",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/2716",
                "name": "Interior #2716",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/2718",
                "name": "Interior #2718",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/2720",
                "name": "PART 4 (OF 5) Young Tolo Hawk sees his opportunity for revenge when trouble befalls his captors. But will he be willing to take ",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/2722",
                "name": "\"THE CADET AND THE CORSAIRS\" PART 5 (OF 5) The time has come for both Tolo and the Starjammers to decide where their loyalties l",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/22595",
                "name": "Blight And Fog (Exile Book 2)",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/23000",
                "name": "Beyond the Call",
                "type": ""
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/89507",
                "name": "Essential X-Men Vol. 4 (All-New Edition)",
                "type": "cover"
            }
        ],
        "returned": 10
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011078/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011078/starjammers?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Starjammers?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "base_of_operations": "The Starjammer",
        "debut": "X-Men #104 (1977)",
        "significant_issues": "",
        "current_members": "[[Ch’od]], Cr+eee, [[Havok]] (Alex Summers), [[Korvus]], [[Marvel Girl (Rachel Summers)|Marvel Girl]] (Rachel Summers), [[Polaris ]](Lorna Dane), [[Raza|Raza Longknife]], [[Sikorsky]]",
        "former_members": "[[Ms. Marvel (Carol Danvers)|Binary]], [[Corsair]] (Christopher Summers), [[Hepzibah]], [[Kalyx]], [[Keeyah]], [[K-zzat]], [[Lilandra|Lilandra Neramani]], [[Professor X]] (Charles Xavier), [[Waldo]]",
        "other_members": "None",
        "main_image": "Strjamrs.jpg",
        "bio_text": "When [[Cyclops (Scott Summers)|Scott]] and [[Havok|Alex Summers]] were children, their parents had taken them on a trip to Alaska to visit their grandparents. On their journey home, their plane was attacked by a Shi’ar aircraft. With their plane burning and out of control, Katherine Summers gave her sons the only parachute on board. She placed Alex in Scott’s arms and shoved them out of the plane. However, before the plane was about to explode, [[Corsair|Christopher]] and his wife were beamed aboard the Shi’ar aircraft. The alien ship was on a zoological scouting mission and brought the human specimen to Emporer D’Ken. D’Ken was attracted to Katherine and decided to keep her as his mistress while he sent Christopher to the slave pits. At some stage Christopher managed to escape from the pits and stormed into the palace where he tried to kill D’Ken. Unfortunately he was captured and, as punishment, his wife was killed by  D’Ken before Christopher’s eyes. With his will broken, Christopher was then sent back to the slave pits. While there, Christopher met an alien catlike female running from the guards. When she was captured by the guards and beaten, Christopher intervened but was beaten himself. As the guards carried their captive away, Christopher watched, feeling ashamed of his inability to rescue her. Shortly afterwards he was approached by two more aliens who introduced themselves as [[Ch’od]] and [[Raza]]. They told Christopher that they were searching for their friend but Christopher was too afraid of them to answer. As they walked away Christopher realized that he had to help them and approached the guards quarters where the female alien was being tortured. After stabbing one of the guards, Ch’od and Raza appeared and helped Christopher defeat the rest of the guards. Christopher released the female alien from her shackles, who Christopher called [[Hepzibah]] as her real name was unpronounceable to anybody not from her race. Hepzibah bit Christopher and licked his blood, explaining that she had established a lifebond of blood and the four of them were now friends for life. They had to escape from the prison world but none of them knew how to fly a ship. Christopher told them that he knew how to fly considering he was a former air force pilot. After stealing a spaceship and escaping from the prison colony, Christopher adopted the name Corsair, after his old military nickname.",
        "bio": "When [[Cyclops (Scott Summers)|Scott]] and [[Havok|Alex Summers]] were children, their parents had taken them on a trip to Alaska to visit their grandparents. On their journey home, their plane was attacked by a Shi’ar aircraft. With their plane burning and out of control, Katherine Summers gave her sons the only parachute on board. She placed Alex in Scott’s arms and shoved them out of the plane. However, before the plane was about to explode, [[Corsair|Christopher]] and his wife were beamed aboard the Shi’ar aircraft. The alien ship was on a zoological scouting mission and brought the human specimen to Emporer D’Ken. D’Ken was attracted to Katherine and decided to keep her as his mistress while he sent Christopher to the slave pits. At some stage Christopher managed to escape from the pits and stormed into the palace where he tried to kill D’Ken. Unfortunately he was captured and, as punishment, his wife was killed by  D’Ken before Christopher’s eyes. With his will broken, Christopher was then sent back to the slave pits. While there, Christopher met an alien catlike female running from the guards. When she was captured by the guards and beaten, Christopher intervened but was beaten himself. As the guards carried their captive away, Christopher watched, feeling ashamed of his inability to rescue her. Shortly afterwards he was approached by two more aliens who introduced themselves as [[Ch’od]] and [[Raza]]. They told Christopher that they were searching for their friend but Christopher was too afraid of them to answer. As they walked away Christopher realized that he had to help them and approached the guards quarters where the female alien was being tortured. After stabbing one of the guards, Ch’od and Raza appeared and helped Christopher defeat the rest of the guards. Christopher released the female alien from her shackles, who Christopher called [[Hepzibah]] as her real name was unpronounceable to anybody not from her race. Hepzibah bit Christopher and licked his blood, explaining that she had established a lifebond of blood and the four of them were now friends for life. They had to escape from the prison world but none of them knew how to fly a ship. Christopher told them that he knew how to fly considering he was a former air force pilot. After stealing a spaceship and escaping from the prison colony, Christopher adopted the name Corsair, after his old military nickname. \n\nOver the years the four friends, accompanied by Cr+eee, a small rodent-like alien that Ch’od is only able to understand, established themselves as intergalactic pirates called the Starjammers. After having many adventures and exploring the cosmos together, the Starjammers learned that Emperor D’Ken was planning something terrible. They discovered that the nine stars were moving into alignment and that the Emperor was going to open the dimensional gate to obtain absolute power. If the Emperor went through with his plan it could mean the end of everything. Around the time that this was occurring, the [[X-Men]] were transported to another world by [[Phoenix (Jean Grey)|Phoenix]] and arrived in front of the M’Krann Crystal and the Shi’ar [[Imperial Guard]]. As D’Ken was about to sacrifice his sister [[Lilandra]] to the Soul-Drinker, [[Nightcrawler]] intervened and rescued her. Just as the X-Men were about to lose the battle, the Stajammers arrived and helped to defeat the Imperial Guard. Afterwards Corsair introduced the team to the X-Men but his American accent caught Jean by surprise. She did a mind-scan on Corsair and discovered that he was Scott’s biological father that disappeared 20 years ago. The X-Men and the Starjammers made their way to the M’Krann Crystal and confronted one of its guardians, Jahf. [[Wolverine (James Howlett)|Wolverine]] underestimated his opponent and was punched into orbit. He was rescued by the Starjammers resident artificial intelligence, Waldo. After defeating Jahf and confronting the second guardian Modt, Raza threw Emperor D’Ken into the Crystal. Strangely enough everybody present was transported inside the Crystal itself. Phoenix realized that the universe was beginning to deteriorate and she had to restore it quickly. However she needed an anchor to keep her on the plane of reality so she doesn’t disappear. She requested the help of [[Storm]] and Corsair, calling him by his real name and telling him that Cyclops was his son. With their life-force holding her as an anchor, Phoenix managed to repair the universe. With everything back to normal and Emperor D’Ken’s mind left in a catatonic state, the Shi’ar  throne would be passed to Lilandra once she was cleared of treason. The Starjammers left but not before Corsair requested that Jean never tell Scott that he was his father, thinking it would be the best thing for him. Jean agreed although Storm did not think it was the right decision to make. \n\nSometime after this Lilandra had been kidnapped and the Starjammers were implicated in the crime. As Ch’od, Raza and Hepzibah held off the Imperial forces, Corsair escaped, took a ship and made his way to Earth for the first time in 20 years. However the Shi’ar had begun to chase Corsair, firing their torpedoes at his ship. He managed to hold them off until he reached Earth where one of the torpedoes had hit his ship. He crash landed his ship in the lake at the Xavier Institute where Cyclops and Storm rescued him from the wreckage. They brought him back to the X-Mansion where Cyclops discovered Corsair’s air force dog tags and a locket containing a picture of Cyclops as a child with his mother and brother. When Corsair awoke Cyclops confronted him about the picture. Corsair realized he couldn’t hide the truth any longer and told Cyclops he was his father. At first Cyclops didn’t believe him but Storm verified Corsair‘s story, having learned the truth herself from Jean when they first met the Starjammers.  Before they could discuss the matter any further, the [[Sidri]] attacked them. It took a lot of effort but Corsair and the two X-Men managed to defeat the Sidri. Afterwards Corsair explained that Lilandra had been kidnapped and the trail of the terrorists led straight to Earth. The Shi’ar would do anything to liberate their emperor, including reducing the Earth to a cinder. Before they could discuss it any further, the Blackbird was transported into the Shi’ar Dreadnought that was situated above Earth. Cyclops and Storm were reunited with their fellow X-Men where they were told by Lord Chancellor Araki that they had 24 hours to rescue Lilandra. To show that they would comply, Nightcrawler and [[Shadowcat]] were ordered to remain behind as prisoners. They were transported back to Earth where they began their search for Lilandra in earnest, requesting the help of the [[Avengers]] and the [[Fantastic Four]] who were unfortunately unavailable at the time. As Corsair and Storm took a walk around New York, they were attacked by the [[Brood]] and [[Deathbird]]. The remaining X-Men, alongside [[Tigra]], arrived and helped out their allies. However during the battle, [[Colossus (Piotr Rasputin)|Colossus]] suffered a near-fatal injury as Deathbird and the Brood escaped, taking [[Professor Xavier]] as a hostage. \n\nAt that moment however, the Starjammers ship arrived and transported the X-Men aboard as Corsair was reunited with his friends. Corsair placed the injured Colossus in a Life Support Module as he was treated by the Starjammers resident medic, Sikorsky. With nothing to do but wait and hope, Corsair and Cyclops began talking to each other ,with Corsair telling his son everything that had happened with the Shi’ar and his mother. Hepzibah arrived and told them that they had managed to catch up with the Deathbird’s ship. However the Starjammers and the X-Men were instead confronted with a giant living creature known as the [[Acanti]] that the Brood were using as their ship. The Starjammers and the X-Men, with a revived Colossus on hand for support, arrived in the enemy’s ship and began attacking the Brood. They defeated their enemies and rescued Lilandra and Professor Xavier. Unfortunately the Starjammers ship had suffered some damage and Waldo informed Corsair that it would take 24 hours to repair. Lilandra told everybody that in 6 hours Chancellor Araki’s deadline would expire and he would destroy the Earth. The Starjammers and the X-Men immediately set about to fix their space craft as Lilandra attempted to contact Chancellor Araki to no avail. In the meantime, back on the Shi’ar Dreadnought, Nightcrawler and Shadowcat escaped and stumbled upon the body of Chancellor Araki, who was murdered by the Shi’ar traitor, Lord Samedar. They requested the help of the Imperial Guard but were ambushed by Lord Samedar and captured. Samedar ordered the plasma beam to be fired on Earth but at the last moment the blast was intercepted by the Starjammer. Lilandra’s holographic image appeared in the Shi’ar Dreadnought and the Empress called off the attack, reassuring everybody that she was safe and well. She ordered the arrest of Samedar and the release of Nightcrawler and Shadowcat. \n\nWith this adventure over, the Starjammers returned to Earth with the X-Men, remaining at the X-Men’s temporary base in the Bermuda Triangle. While there the Starjammers met [[Ms. Marvel (Carol Danvers)|Carol Danvers]], who made quite on impression on the aliens with her duelling skills, despite having no powers at the time. Corsair was also introduced to his other son Alex by Cyclops and, in return, Corsair took his sons to visit their grandparents in Alaska. When Charles Xavier was killed when a Brood egg hatched inside of him, Sikorsky cloned his body and transferred his mind inside the new body. Carol Danvers was also mutated into Binary when the Brood tampered with her genetic structure. When the X-Men welcomed [[Rogue]] into the team, Carol was upset and left the X-Men, becoming the newest member of the Starjammers in the process. Corsair attended the wedding of Cyclops and [[Pryor, Madelyne|Madelyne Pryor]] and offered his two sons a membership on the Starjammers. However both Scott and Alex refused and Corsair and the Starjammers left Earth to aid Lilandra in overthrowing Deathbird’s rule of the Shi’ar throne. \n\nThe Starjammers soon returned to Earth after Lilandra sensed that Professor Xavier was extremely ill and possibly dying. Sikorsky managed to heal Xavier and the Professor remained behind with Lilandra and the Starjammers. The Starjammers also helped the [[New Mutants]] fight the [[Magus]]. They soon learned that Deathbird was trying to find the “Phalkon”, a legendary force of power that would end the Starjammers rebellion against her rule of the Shi’ar. The Starjammers attempted to beat her to it and Xavier merged his mind with Waldo as he mentally guided the away teams, but the extended absence left the body weak and finally died. The body was placed in a stasis tube. Eventually the Starjammers learned that the Phalkon was none other than the [[Phoenix Force]] which was under the control of [[Marvel Girl (Rachel Summers)|Rachel Summers]] at the time. Lilandra ambushed Rachel and placed her in a power leeching machine. [[Excalibur]] arrived and attacked the Starjammers but their battle was interrupted by the Imperial Guard. As Deathbird tried to use the machine, she gets knocked unconscious by her sister. Witnessing this, the Imperial Guard leave and Rachel is freed. However Lilandra noticed that there was still a residue of the force still inside the machine and used it to revive Xavier. Shortly afterwards Binary left the group, as her arrogance caused her team mates to dislike her. The Starjammers also helped to overthrow Deathbird and Lilandra was finally renamed Shi’ar Majestrix. As a result Lilandra was forced to leave the group and Professor Xavier accompanied his students back to Earth. The Starjammers also briefly acquired a Kree pilot named Keeyah.",
        "categories": [
            "X-Men",
            "Cosmic",
            "Heroes"
        ]
    }
}