{
    "id": 1011159,
    "name": "Stellaris",
    "description": "It is unknown how Stellaris survived the extermination of her home world by the Celestials or how she acquired her living armor, but ever since she has committed herself to their destruction.",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/5/e0/4c002f4445ce5",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011159",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011159/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011159/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011159/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011159/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011159/stellaris?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Stellaris?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Unrevealed",
        "identity": "Secret",
        "aliases": "Leah Princess",
        "occupation": "Celestial slayer",
        "place_of_birth": "Unrevealed",
        "groups": "The [[Graces]]",
        "citizenship": "Unrevealed, but she is the sole survivor of her world",
        "education": "Unrevealed",
        "relatives": "Unrevealed",
        "height": "Unrevealed",
        "weight": "Unrevealed",
        "eyes": "Brown",
        "hair": "Black",
        "powers": "None",
        "abilities": "Stellaris is an accomplished athlete and an expert in her world’s fighting style",
        "weapons": "Stellaris has numerous amounts of weaponry at her disposal thanks to her living armor. At will, she can reform one weapon, like her sonic-shatter pistol, to another more powerful configuration, like her solar blast weapon. She can also project energy from her armored hands, magnetize herself to metallic objects, and her armor gives her super strength which is able to match that of the Thunder god, Thor. Potentially the most powerful weapon in her armor’s arsenal is its failsafe feature. Stallaris can set her armor’s systems to implode and the resulting cosmic flash could consume an entire planet.",
        "paraphernalia": "Stellaris wears a living battle suit, identical to the armor of the Celestials, that can reshape and retool around her body at will to form new armor configurations, for either battle or stealth, new weaponry, or she can use her armor to tap into computer equipment and download information. Pieces of her armor can also detach themselves from the whole in order to form various modes of transportation, such as her sky-cycle or something more suited for interstellar travel. However, the living armor does not seem to be stronger than Mjolnir, the enchanted hammer of Thor, since it had been shattered with the mallet upon her first confrontation with the Thunder god. It is also unknown if Stellaris can utilize the full potential of her armor’s abilities.",
        "debut": "Thor #419 (1990)",
        "origin": "",
        "significant_issues": "Thor #419-424, Thor #438-439, Thunderstrike #1-6, Thunderstrike #12-21, Ronan: Annihilation #1-2",
        "main_image": "Stellaris_3.jpg",
        "bio_text": "",
        "bio": "It is unknown how Stellaris survived the extermination of her home world by the Celestials or how she acquired her living armor, but ever since she has committed herself to their destruction. When the [[Celestials]] created a replicoid in the likeness of [[Thor (Thor Odinson)|Thor]], he was to serve as an ambassador for his mysterious masters. One such occasion was when the replicoid journeyed to Earth to summon Thor and [[Hercules]] to return to the [[Black Galaxy]] as commanded by the Celestials. The conversation between Thor and his twin counterpart was violently interrupted when Stellaris, the Celestial Slayer, attacked. \n\n\n[[Image:Stellaris_action.jpg|left|205px|thumb|Stellaris on sky-cycle]] The initial assault, which destroyed a small part of the South Bronx, attracted the attention of the [[Avengers]] who intercepted her as she was preparing to assail Thor once again. Stellaris proved to be more than a match for the combined might of [[Captain America (Steve Rogers)|Captain America]], [[Sersi]], [[Quasar (Wendell Vaughn)|Quasar]], Thor and [[She-Hulk]], but the confrontation was halted by the repilcoid when he shouted a final command before Stellaris blasted him to oblivion. Stellaris left the scene, but detected another spawn of the Celestials to exact her revenge upon. Hercules, who had been a recent prisoner of the Celestials, was her next target, but thanks to the timely arrival of the Avengers, Stellaris would not claim a second life. Thor sensed that her power was similar to the power cosmic, so he chose himself to stand against her alone. The battle was fierce and both opponents were unwilling to yield, but the tide turned in Thor’s favor when he used his hammer, Mjolnir, to shatter the helmet of Stellaris. Thor was startled when it was revealed to be a woman inside the armor, and he momentarily stopped his attack. Stellaris threatened to destroy the planet when she activated her armor’s failsafe systems, so Captain America ordered her to be released. Stellaris left the planet only after reassuring Thor they would meet again when he traveled to the Black Galaxy. \n\nFollowing Thor and Hercules, Stellaris soon found herself in [[New Wundagore]], home of the [[High Evolutionary]]. She modified her armor to something stealthier and stowed away on his ship to find some new weapons she could use in her crusade against the Celestials. After disposing of a few guards, Stellaris freed the imprisoned [[Nobilus]], one of the High Evolutionary’s [[New Immortals]]. Thor tried to stop the rampaging godling as Stellaris used her armor to tap into the ship’s computer system. Learning all she needed to, Stellaris grabbed Nobilus and exited the ship. She thought she now had an ally in her quest to eliminate the Celestials, but Nobilus was more concerned with his master’s wishes and obeyed his commands instead. As Nobilus and the other New Immortals contended with Thor, a new Celestial was about to be born, and Stellaris would not let this happen. She reconfigured her armor and attacked the Celestial where she thought it was most vulnerable, but the resulting explosion was the final catalyst necessary to allow this Celestial to be born. \n\nIt has yet to be revealed how she survived her encounter with the Celestials, but Stellaris returned, fully recovered, seeking revenge on Thor for abandoning her in the Black Galaxy. She tracked [[Thunderstrike|Eric Masterson]], who was the new Thor, and engaged him in combat even as he was attacked by the Thor of the future, [[Thor (Dargo Ktor)|Dargo Ktor]]. She continued to fight both Thunder gods, but then decided to let them finish their battle since she could always get her revenge another time. Stellaris kept to the shadows, revenge far from her thoughts, as she followed Masterson, now Thunderstrike, secretly aiding him against such foes as [[Bloodaxe]] and the [[Juggernaut]]. She decided to reveal herself when she came to the aid of Thunderstrike and [[Spider-Man (Peter Parker)|Spider-Man]] in a battle against [[S.H.I.E.L.D.]] and their Man-droid troopers, but left again soon afterwards. Surprising Masterson again at a later date, she had helped Thunderstrike against foes like the [[Absorbing Man]] and the Heliopolitan Death god, [[Seth]]. However, questions were raised about her mysterious powers when the Absorbing Man tried to soak up her powers and [[Image:Stellaris_Ronan.jpg|left|205px|thumb|Ronan versus Stellaris]] suffered a mental breakdown instead, so she headed for the stars once more in search of answers. \n\n\nStellaris recently turned up on the planet Godthab Omega after the [[Annihilation|Annihilation Wave]] started its path of destruction on the universe, and allied herself with [[Gamora]] becoming one of her [[Graces]]. She, and her ally [[Nebula]], attempted to take on [[Ronan]] but were defeated by the superior power of his Universal Weapon. Stellaris was left badly injured and in need of medical treatment, and it can be assumed that she is still recovering from her recent battle with Ronan. Stellaris was still on [[Godthab Omega]] when the Wave invaded. It is unknown if she survived the assault.",
        "categories": [
            "Heroes",
            "Villains",
            "Reformed Villains",
            "Cosmic",
            "Women",
            "Annihilation"
        ]
    }
}