{
    "id": 1011422,
    "name": "Nekra",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/4/c0/4c002e11323ba",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011422",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011422/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011422/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011422/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011422/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011422/nekra?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Nekra?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Nekra Sinclair",
        "identity": "Secret",
        "occupation": "Cult priestess",
        "place_of_birth": "Los Alamos, New Mexico",
        "groups": "[[Lethal Legion]]; former agent of [[Hellstorm]], ex-partner of Grim Reaper & Mandrill; formerly Cult of Kali, [[Black Spectre (Mandrill)|Black Spectre]]",
        "citizenship": "Citizen of the United States with a criminal record",
        "education": "Elementary school",
        "aliases": "Adrienne Hatros, Priestess of Darkness",
        "relatives": "Gemma (mother, deceased), Buck (father, deceased); former common-law wife of [[Mandrill]], [[Death Reaper]] (daughter)",
        "height": "5' 11\"",
        "weight": "145 lbs.",
        "eyes": "Black",
        "hair": "Black",
        "powers": "Possesses the ability to increase her strength, endurance, and resistance to pain and injury by harnessing her violent emotions.  Her heightened adrenal activity causes a series of metabolic reactions within her body that toughen her skin and increase the efficiency of her muscles. At her peak, she can lift approximately 10 tons, withstand an explosion of about 100 pounds of TNT, and withstand extreme degrees of cold and heat. Her powers are limited by how long she can sustain her emotional state, generally for no more than an hour.",
        "paraphernalia": "None",
        "debut": "Shanna the She-Devil #4 (1973)",
        "origin": "Daredevil #110 (1974)",
        "significant_issues": "See the [[OHOTMU:Bibliography-AZ8#Nekra|Official Handbook Bibliography]]",
        "main_image": "Nekraglare.jpg",
        "bio_text": "Gemma Sinclair was a cleaning woman at the Los Alamos Atomic Proving Grounds in New Mexico who was exposed to a large amount of radiation when an explosion breached the facility's small atomic pile.  Though both of Nekra's parents were African-American, she was born with chalk-white skin.  Despised by her family, she ran away from home at the age of ten and met Jerome Beechman, the son of another person exposed to radiation in the accident.  Shunning other people, the two lived together in the desert for the next six years, surviving by their wits and educating themselves with stolen books.  When an angry mob attacked them one evening, the two manifested their mutant abilities for the first time, killing some of their attackers and driving off the rest.",
        "bio": "Gemma Sinclair was a cleaning woman at the Los Alamos Atomic Proving Grounds in New Mexico who was exposed to a large amount of radiation when an explosion breached the facility's small atomic pile.  Though both of Nekra's parents were African-American, she was born with chalk-white skin.  Despised by her family, she ran away from home at the age of ten and met Jerome Beechman, the son of another person exposed to radiation in the accident.  Shunning other people, the two lived together in the desert for the next six years, surviving by their wits and educating themselves with stolen books.  When an angry mob attacked them one evening, the two manifested their mutant abilities for the first time, killing some of their attackers and driving off the rest.\n\nDuring this time, Nekra grew fangs while Jerome came to resemble a mandrill, leading him to adopt the name as his own.  Together they plotted to overthrow three small African governments and consolidate them under their rule.  The Nekra became the chief priestess of a personality cult based around the [[Mandrill]], though their plot was frustrated by [[Shanna|Shanna the She-Devil]].  After their failure, Mandrill and Nekra formed [[Black Spectre (Mandrill)|Black Spectre]], an organization of African-American women committed to overthrowing the U.S. government.  Though the group succeeded in taking over the White House briefly, they were ultimately  defeated by [[Daredevil (Matthew Murdock)|Daredevil]], with the aid of Shanna and the [[Black Widow (Natasha Romanova)|Black Widow]]. Though Mandrill escaped, Nekra was taken into custody by [[S.H.I.E.L.D.]].\n\nHeld in a S.H.I.E.L.D. holding facility, Nekra was drugged to prevent her from utilizing her powers.  Exposure to a broadcast of a rally by the second [[Hate-Monger]], though, exposed her to frequencies designed to stimulate rage, which helped her to overcome the drugs and escape.  Coming upon a den of worshippers of the death-god Kali in the tunnels of New York City, she became high priestess of their cult.  She later established a base at a clinic for emotional research in an effort to understand her powers better, but she was discovered by [[Spider-Woman (Jessica Drew)|Spider-Woman]] and, vulnerable to Spider-Woman's pheromone emissions, was defeated and returned to S.H.I.E.L.D. custody.\n\nNekra recovered from her injuries more rapidly than her doctors thought possible, and soon escaped.  Through her contact with the [[Black Talon]] she met the [[Grim Reaper]] and, having found someone with passion and hatred equal to her own, became his lover.  Joining his Lethal Legion, she assisted in capturing the [[Vision]] and in creating a zombie of the Grim Reaper's brother, Simon Williams, in an effort to recreate him as he was before he became [[Wonder Man]].  The plan failed, though, and the Grim Reaper died while escaping.  Nekra took his corpse in hopes of reanimating it someday.\n\nAfter battling [[Spider-Man (Peter Parker)|Spider-Man]], [[Alpha Flight]], and the [[Avengers]],  Nekra succeeded in reanimating the Grim Reaper's corpse, though in order to remain animated the Grim Reaper needed to kill someone every 24 hours.  The Reaper promptly made Nekra his first victim.  She was later resurrected by [[Hellstorm]] and sent to stop [[Doctor Druid]], which she succeeded in doing by shooting him in the head.\n\nNekra was recently seen as a willing donor for a Mutant Growth Hormone Ring in Los Angeles; in which was discovered by [[Darkhawk]] and the third [[Spider-Woman (Mattie Franklin)|Spider-Woman]].  And although she overpowered the both of them; Nekra was defeated, due to [[Ricochet (Johnny Gallo)|Ricochet]] joining in to help his teammates.",
        "categories": [
            "Avengers",
            "Mutants",
            "Villains",
            "Women"
        ]
    }
}