{
    "id": 1011154,
    "name": "Ravenous",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/40/image_not_available",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011154",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011154/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011154/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011154/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011154/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011154/ravenous?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Ravenous?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "blurb": "",
        "real_name": "Ravenous",
        "aliases": "Lord Ravenous",
        "identity": "No dual identity",
        "occupation": "Ruler; former agent of [[Annihilus]]",
        "citizenship": "[[Negative Zone]]",
        "place_of_birth": "Undisclosed location within the Negative Zone",
        "relatives": "None",
        "groups": "Commander of the [[Seekers]], [[Annihilation|Annihilation Wave]]",
        "education": "Unrevealed",
        "height": "6'7\"",
        "weight": "975 lbs.",
        "eyes": "Red",
        "hair": "None",
        "powers": "All the Seekers contain the Essence or the Opposing Force. It is the equivalent of the [[Power Cosmic]]. It provides him with superhuman strength and durability, and can survive in the depths of space without breathing aid. This makes the Seekers of the Negative Zone more than an adequate match for the [[Heralds of Galactus]].",
        "abilities": "Ravenous is a master strategist and hand-to-hand combatant",
        "weapons": "Ravenous has access to an arsenal of military weapons, but he regularly carries a plasma blaster and has a long range communication device grafted to his throat.",
        "paraphernalia": "Currs: canine-like creatures that house the Essence from which the Seekers draw power. Each Seeker usually has two to three Currs in their possession, and use the beasts' umbilical cords as leashes. If destroyed, the Currs can re-form from the cord within minutes. The Currs are attuned to the Power Cosmic and can locate its energy signature. It is unrevealed if all of Ravenous and the Seekers' abilities are drawn from their bond with the Currs or if any of them are natural traits.",
        "debut": "Annihilation: Silver Surfer #1 (2006)",
        "origin": "Unrevealed",
        "significant_issues": "Ravenous and the Seekers are introduced and Air-Walker is destroyed. (Annihilation: Silver Surfer #1-4 2006); Ravenous defeats the Kree and they surrender half their Empire. (Annihilation 1-6, 2006-07)",
        "main_image": "Ravenous.jpg",
        "bio_text": "There are few hard facts known about Ravenous and his [[Seekers]]. It is believed that he originated in the [[Negative Zone]] and was recruited by [[Annihilus]]. It is unknown whether Annihilus had a hand in his creation. Many of those who have entered the Negative Zone have whispered of the Seekers for years. Recently Ravenous identified as their leader and he has been described as an unstoppable force of nature by those who have encountered him and survived.",
        "bio": "There are few hard facts known about Ravenous and his [[Seekers]]. It is believed that he originated in the [[Negative Zone]] and was recruited by [[Annihilus]]. It is unknown whether Annihilus had a hand in his creation. Many of those who have entered the Negative Zone have whispered of the Seekers for years. Recently Ravenous identified as their leader and he has been described as an unstoppable force of nature by those who have encountered him and survived.\n\nWhile seeking to unlock the possibilities of biological application of the [[Power Cosmic]], Annihilus assigned Ravenous and his Seekers the task of finding the famed [[Heralds of Galactus]]. He was to capture them alive for experimentation. The [[Annihilation|Annihilation Wave]] destroyed the [[Xandar Cluster]]. While Ravenous and his Seekers were sent out through that region of space to find [[Air-Walker (Gabriel Lan)|Air-Walker]] and [[Firelord (Pyreus Kril)|Firelord]], both of whom were former Heralds of Galactus that  were native to the planet [[Xandar]].\n\nRavenous had control of dog like creatures called [[Currs]]. The Currs are the Seekers tracking devices. These Currs are attached to the Seekers by glowing umbilical cords. They have no eyes, but they use sensory like tentacles to find their way through the cosmos. Currs appear to come in packs of threes and are conduits of the [[Opposing Force]], increasing the Seekers power and allowing them to track the Heralds through hyperspace with no apparent problems. Upon locating Air-Walker, Ravenous became disappointed that Air-Walker was an android being and thus he terminated him in spite of the [[Silver Surfer]] interference.\n\nThe Seekers tracked the Silver Surfer to the [[Skrull]] controlled Tercera Prime Peripheral System of the [[Andromeda Galaxy]]; there they were defeated in a futile attempt to apprehend him. After their defeat, the Silver Surfer fled to the Obada’an Rim within the [[Badoon]], Skrull Neutral Zone. He had been summoned there by his former master, [[Galactus]], who had sensed the magnitude of the Annihilation Wave.  Galactus decided to bestow a massive gift of the Power Cosmic to his former Herald, thus increasing his power tremendously. The arrogant Ravenous engaged the Surfer fiercely, but he was handed a humbling defeat by the newly unleashed power of the Herald. However the Ex-Herald [[Terrax|Terrax the Tamer]], was not as fortunate as the Silver Surfer. He was tracked and captured by the Seekers on star-sleds.\n\nRavenous appeared with a group of cosmic warriors on the planet of Daedalus 5 which consisted of: Terrax the Tamer (who was under mind control), [[Paibok|Paibok the Power Skrull]], a giant [[Mad Thinker]] android, and the [[Infant Terrible]]. They were ordered to attack the [[United Front]]. This group was held to a stale mate by [[Nova]] and the others. Ravenous noticed [[Praxagora]], a being from the Negative Zone, standing with the United Front. Not willing to concede the battle, he unleashed the [[Centurions]]. They were 100 super powered beings from the planets in the Negative Zone. The United Front fell to the overwhelming might of the new attackers. The Front retreated from the planet.\n\nAt the end of the Annihilation event Ronan thought it wise to make a pact with Ravenous in order to save many Kree lives. He gave Ravenous sovereignty of much of Kree space including the planet of Kreelar. During his tender as Sovereign of Kree-Lar he has had to face an uprising from member of the Centurions led by [[Hybelea]]; Ronan, [[Wraith (Zak-Del)|Wraith]] and [[Ra-Venn]] seeking to activate a forgotten army of Sentries that were housed under his throne; recently he was attacked by the [[Shi'ar]] led by Emperor [[Vulcan]]. Vulcan dispatched the [[Strontian]], [[Xenith]] to secure Ravenous surrender. During her mission Xenith killed Ravenous’ insectoid adviser [[Orbus]] and appeared to be on the verge of taking Ravenous' life when he was rescued by [[Nova Corps]] member, [[Rider, Robert|Robbie Rider]].",
        "categories": [
            "Annihilation",
            "Villains",
            "Cosmic"
        ]
    }
}