{
    "id": 1011053,
    "name": "Maelstrom",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/f/20/4c003114d6700",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011053",
    "comics": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011053/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/33864",
                "name": "Captain America & the Korvac Saga (2010) #1"
            }
        ],
        "returned": 1
    },
    "series": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011053/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/10739",
                "name": "Captain America & the Korvac Saga (2010 - 2011)"
            }
        ],
        "returned": 1
    },
    "stories": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011053/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/76061",
                "name": "Interior #76061",
                "type": "interiorStory"
            }
        ],
        "returned": 1
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011053/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011053/maelstrom?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Maelstrom?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "blurb": "",
        "real_name": "Unrevealed",
        "aliases": "Malcom Stromberg, The Cosmic Assassin, Anomaly II",
        "identity": "The general populace of [[Earth]] were unaware of Maelstrom's existence.",
        "occupation": "Geneticist; Would-Be Destroyer of the Universe",
        "citizenship": "Unrevealed",
        "place_of_birth": "Unrevealed",
        "relatives": "[[Phaeder]] (father, deceased), [[Ransak|Ransak the Reject]] (son)",
        "groups": "[[Deathurge]], [[Maelstrom's Minions]] ([[Gronk]], [[Phobius]], [[Helio]]), [[The Weird Sisters]] (Beauty, Charm, Truth), [[Oblivion]]",
        "education": "Advanced training in [[Inhumans|Inhuman]] and [[Deviants|Deviant]] [[Glossary:G#genetic|genetic]] sciences",
        "height": "8' 2'' (varies)",
        "weight": "425 lbs (varies)",
        "eyes": "Purple",
        "hair": "Purple",
        "powers": "Maelstrom can absorb kinetic energy from any source and use it to increase his own physical abilities while draining his victims. He can also use this energy by generating force blasts, flying, and growing in size. With the means to amplify his abilities, Maelstrom can absorb kinetic energy from the entire planet. While he served as Anomaly, he possessed [[Glossary:C#cosmic awareness|cosmic awareness]], granting him near-[[Glossary:O#omnipotent|omnipotent]] knowledge. He also had the ability to alter reality.",
        "abilities": "",
        "weapons": "",
        "paraphernalia": "",
        "debut": "(As Maelstrom) Marvel Two-in-One #71 (1981); (as Anomaly) Quasar #20 (1991)",
        "origin": "Marvel Two-in-One #72 (1981)",
        "significant_issues": "[[OHOTMU:Bibliography-AZ6#Maelstrom|See Handbook Bibliography]]",
        "main_image": "Maelstrom HD.jpg",
        "bio_text": "Maelstrom is the son of [[Phaedar]], a member of the sub-species race of humanity known as the Inhumans. Phaedar was a geneticist in [[Attilan]], but his [[Glossary:C#clone|cloning]] experiments met with disapproval from the Genetics Council; he lost a bid for leadership of the council to [[Agon]], and was subsequently banished from the council for his experiments. To obtain freedom, Phaedar created a clone of himself and killed it so he would not be missed, then ventured into the outside world to perform his experiments.",
        "bio": "Maelstrom is the son of [[Phaedar]], a member of the sub-species race of humanity known as the Inhumans. Phaedar was a geneticist in [[Attilan]], but his [[Glossary:C#clone|cloning]] experiments met with disapproval from the Genetics Council; he lost a bid for leadership of the council to [[Agon]], and was subsequently banished from the council for his experiments. To obtain freedom, Phaedar created a clone of himself and killed it so he would not be missed, then ventured into the outside world to perform his experiments. \n\nPhaedar eventually mated with a woman named [[Morga]], of the [[Deviants]], a genetically unstable sub-species. They raised Maelstrom in Deviant Lemuria in his early years, but Morga was put to death for having relations with an outsider, and Maelstrom was made a slave. Phaedar eventually rescued Maelstrom, but he was now as much against the Deviants as his father was against the Inhumans.  \n\n[[image:Maelstrom.jpg|thumb|left]] Maelstrom and Phaedar’s superior knowledge of genetics revolutionized humanity’s scientific community from the early 1900’s on, and they shared their knowledge with humans including Herbert Wyndham (the [[High Evolutionary]]), to whom they provided some of the Deviants’ subterranean slaves to aid him in constructing the Citadel of Science on [[Wundagore|Mount Wundagore]]. They also aided his assistant Miles Warren (the [[Jackal]]), and Wladyslav Shinski of the Enclave. Notes of theirs wound up in the possession of the mad [[Glossary:B#bio-|bio-]]engineer [[Zola, Arnim|Arnim Zola]], and one of their laboratories was found by the [[Mutants|mutant]] [[Magneto (Magnus)|Magneto]], who used their equipment to create the [[Glossary:S#superhuman|superhuman]] [[Alpha the Ultimate Mutant]]. Maelstrom and Phaedar recruited the minions Gronk, Helio and Phobius from among the ranks of the Deviants and Inhumans, and were also aided by [[Deathurge]], who was actually serving the [[Glossary:C#cosmic|cosmic]] entity [[Oblivion]]. Over time, Phaedar and Maelstrom would transfer their minds into cloned bodies to perpetuate their existence, but Phaedar eventually became too weak to continue the process. Experiments that Phaedar and Maelstrom performed granted Maelstrom the ability to harness kinetic energy. At some point, Maelstrom mated with a Deviant named Medula, and she secretly bore him a son, the almost human-looking Ransak the Reject, now taken into slavery just as his father had been. \n\nOne of Maelstrom and Phaedar’s associates, Dr. Hydro, had been provided with a sample of the [[Glossary:T#Terrigen Mist|Terrigen Mist]] which grants [[Inhumans]] their powers, and he used it to transform people into amphibians (“Hydro-Men”). When the Inhumans sought to cure the Hydro-Men, they were surprised to find that their Terrigan Mist was involved, and with the aid of [[Mister Fantastic|Mr. Fantastic]], created an Anti-Terrigan Mist Compound, which would undo its effects. When Maelstrom learned of the compound’ invention, he sent his minions to obtain a sample. Although the minions obtained the sample, they could not avoid capture; Maelstrom had Deathurge kill them to prevent their immanent interrogation, and then resurrected them in new clone bodies. Regardless, his actions put the [[Thing (Benjamin Grimm)|Thing]] and the Inhumans on his trail, and they invaded Maelstrom’s lab. Phaedar died in his sleep while Maelstrom was battling [[Black Bolt]], the son of [[Agon]], and Maelstrom had Deathurge kill his current body so that he could escape the conflict in an new one. He destroyed his laboratory so that the Inhumans could not study it. \n\nIn a new body, Maelstrom stole into Olympia, city of the [[Eternals]], as the Eternals were gathering their population to join their forms together into the [[Uni-Mind]]. Maelstrom created a device to siphon the Uni-Mind’s kinetic energies into himself, but the [[Avengers]] defended the Eternals, releasing them from the Uni-Mind. When [[Starfox]] attempted to use his powers to make Maelstrom surrender, Maelstrom had himself slain by Deathurge again. \n\nIn his next scheme, Maelstrom used knowledge gleaned from the Uni-Mind to construct a device which would siphon the entire Earth’s kinetic energy into himself, gradually slowing its rotation and tearing the planet apart. Opposing him, the Avengers forced him to absorb more energy than he could contain, spreading his molecules across the universe. As Maelstrom began to draw his body back together again, he encountered the cosmic being [[Kronos]] and learned of the abstract powers that governed the universe from him. Maelstrom sought out the entity [[Anomaly (manifestation)|Anomaly]] and slew it, assuming its role in the cosmic universe, and made a formal alliance with Oblivion, offering up the universe to his patron. \n\n[[image:Malestorm.jpg|thumb|Maelstorm Obtaing Cosmic Awareness|left]]To set his plans in motion, Maelstrom sought the power of [[Glossary:C#cosmic awareness|cosmic awareness]], which was guarded by the entity [[Eon]]. Eon foresaw his approaching death, and charged his protector of the universe [[Quasar (Wendell Vaughn)|Quasar]] (Wendell Vaughn) to prevent it; however, another servant of Oblivion called the Unbeing temporarily unmade Quasar’s heroic identity, allowing Maelstrom an opportunity to arrive on Earth undetected, although Quasar regained his identity from Unbeing’s counterpart Origin. Maelstrom tricked Quasar into thinking that the threat he had prepared for was the Russian [[Glossary:S#super-villain|villain]] the [[Presence]] so that he would lower his guard. He also weakened Quasar’s relationship with Eon by killing Quasar’s father Gilbert Vaughn. Eon kept Gilbert’s death a secret from Quasar, although, when it finally came out, Quasar felt betrayed and refused to continue serving Eon. Needing Quasar’s quantum bands to enter Eon’s realm, Maelstrom, flanked by his lovers the Weird Sisters and his minions, assumed the identity of Malcolm Stromberg. Posing as a client for the security firm Quasar ran in his [[Glossary:S#secret identity|secret identity]], Maelstrom tricked Quasar into entering his home with his friends, then threatened their lives to force him to surrender. Since Malestrom was unable to remove the Quantum Bands from Quasar’s wrist while he was alive, Maelstrom sliced his hands off, and used the Bands to find Eon. When Quasar finally died, Maelstrom took the Quantum Bands for himself. \n\nTrying to prevent Maelstrom from taking cosmic awareness from Eon, Quasar’s spirit destroyed Eon’s brain, but Maelstrom had already achieved his goal. With his newfound powers, Maelstrom slowed the Earth’s rotation, and then set out to destroy the universe by halting all movement, generating a massive black hole. Maelstrom confronted many of the universe’s great powers to revel in his superiority over them, including [[Thanos]], then-wielder of the six [[Infinity Gems]]. Quasar continued to oppose Maelstrom. Their battle carried them over a black hole, whose forces crushed Maelstrom. \n\nThe cosmic entity [[Infinity]] chose Quasar as her champion against Oblivion, and Oblivion summoned forth Maelstrom’s spirit to battle Quasar to determine the fate of the universe. Quasar bested Maelstrom when he demonstrated that, due to an alteration Origin had made to him when she recreated him earlier, he himself had become an anomaly, and therefore challenged Maelstrom’s role as Anomaly. Maelstrom died, and the black hole ceased to exist. \n\nMaelstrom’s minions and the Weird Sisters attempted to revive him using captured Deviants whose kinetic energy he could drain. The Eternals and the [[Fantastic Four]] joined together to halt Maelstrom’s resurrection, but when he learned that one of the Deviants was Ransak the Reject, his own son, he refused to take his life, and shrank into the [[Microverse]]. \n\nMaelstrom was converted into proto-natural force as he descended, and claimed to behold the grand design of the universe. He became determined to learn the secret of the universe by destroying it. To do so, he stole a chronal accelerator from the [[Glossary:R#Roxxon Oil|Roxxon Oil]] Corporation to speed the universe to its demise. The [[Great Lakes Avengers]] opposed him, but he killed their teammate [[Dinah Soar]] and escaped. He hired [[Batroc's Brigade]] to aid him in gathering the other components he needed, and to serve as bodyguards against [[Glossary:S#super-hero|super-heroes]]. When Maelstrom finally activated the chronal accelerator, the Great Lakes Avenger [[Mister Immortal|Mr. Immortal]] confronted him with the suggestion that with all life gone, his own existence would have no meaning, just an eternity of loneliness. Mr. Immortal shot himself in the head as a means of demonstrating a way out of loneliness. Maelstrom followed suit, but was unaware that Mr. Immortal could not die, and the hero shut off the chronal accelerator as soon as he revived. Protesting that he had been tricked, Maelstrom’s spirit was brought to Oblivion by [[Doorman (DeMarr Davis)|Doorman]], Deathurge’s new replacement.",
        "categories": [
            "Avengers",
            "Cosmic",
            "Deceased",
            "Fantastic Four",
            "People who used to be dead but aren't anymore",
            "Villains"
        ]
    }
}