{
    "id": 1011304,
    "name": "Thundra",
    "description": "Thundra was quite possibly her world's greatest female specimens, and as she won countless battles against the men, she was revered as the Sisterhood's greatest hero.",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/c/80/4ce5a61df19e5",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011304",
    "comics": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011304/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/24252",
                "name": "All-New Savage She-Hulk (2009) #2"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/23418",
                "name": "Quasar (1999) #2"
            }
        ],
        "returned": 2
    },
    "series": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011304/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/7231",
                "name": "All-New Savage She-Hulk (2009)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/6682",
                "name": "Quasar (1999 - 1994)"
            }
        ],
        "returned": 2
    },
    "stories": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011304/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/51928",
                "name": "Destiny Amidst The Ruins",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/53731",
                "name": "4XLS 2 of 4",
                "type": "interiorStory"
            }
        ],
        "returned": 2
    },
    "events": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011304/events",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/events/318",
                "name": "Dark Reign"
            }
        ],
        "returned": 1
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011304/thundra?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Thundra?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "blurb": "",
        "real_name": "Thundra",
        "aliases": "None",
        "identity": "No dual identity",
        "occupation": "Ruler, warrior",
        "citizenship": "United Sisterhood Empire of North America, Earth-8009; Polemachus (by marriage); formerly United Sisterhood Republic, Earth-715",
        "place_of_birth": "Greater Milago, Midwestern Republic, United Sisterhood Republic, Earth-715",
        "relatives": "[[Arkon]] (consort), [[Lyra]] (daughter, Earth-8009), [[Superia]] (alleged ancestor)",
        "groups": "[[Lady Liberators]]; formerly [[Code Red]], [[Nth Command]], [[Grapplers]], [[Lethal Legion]], [[Frightful Four]]",
        "education": "Military schooling",
        "height": "7'2\"",
        "weight": "350 lbs.",
        "eyes": "Green",
        "hair": "Red",
        "powers": "Thundra possesses [[Glossary:S#superhuman|superhuman]] strength, endurance, agility and durability",
        "abilities": "Thundra has received military training since the age of eight and is an expert in multiple forms of armed and unarmed combat",
        "weapons": "Thundra wields a four foot heavy chain, which is either worn as a belt or attached to her wrist. At least on one occasion, she had a mace fastened to the end of it.",
        "paraphernalia": "Thundra, being the leader of North America's Sisterhood and co-leader of Polymachus, has access to the magic and technology of two worlds. This includes time and dimensional travel through the Sisterhood's chrono-gates and D-Belts, and Polemachus' cross-dimensional \"lightning bolts.\" Thundra has access to the Sisterhood's Learning Cubes, Brain Tapes and their extensive genetic manipulation and birthing techniques. One of her most valued items is her Computer Cryo-Chamber. With this small floating device, Thundra can record and playback messages and store a DNA sample – namely Lyra's – indefinitely until such a time the apparatus can be delivered back to her people, assuming the Cyro-Chamber isn't tampered with by outside forces.",
        "debut": "Fantastic Four #129 (1972)",
        "origin": "",
        "significant_issues": "",
        "main_image": "Thundra_new.jpg",
        "bio_text": "Thundra was born in one of the many possible futures of the planet [[Earth]]. In her time, the sexes were divided into two warring factions. Where men were one time physically superior to their feminine counterparts, the women had genetically enhanced themselves to level the playing field. Since both sides would not use the other for reproduction, they had to develop their own methods such as cloning. Finally,  [[The United Sisterhood Republic]] rose to power, and it was into this world Thundra was born.",
        "bio": "Thundra was born in one of the many possible futures of the planet [[Earth]]. In her time, the sexes were divided into two warring factions. Where men were one time physically superior to their feminine counterparts, the women had genetically enhanced themselves to level the playing field. Since both sides would not use the other for reproduction, they had to develop their own methods such as cloning. Finally,  [[The United Sisterhood Republic]] rose to power, and it was into this world Thundra was born.\n\nThundra was quite possibly her world's greatest female specimens, and as she won countless battles against the men, she was revered as the Sisterhood's greatest hero. Due to circumstances not yet known at this time, another Earth – Machus of [[Earth-74101]] – started to merge with Thundra's world at the dawn of the 24th century. The elders sent Thundra back in time to humiliate Earth's greatest male and to collect samples of his DNA in order to clone more powerful children. Once she arrived in the past, Thundra was noticed by the [[Wizard]]. He told her he would bring her to the most powerful male if she joined his [[Frightful Four]], so she did. The Wizard led her to one of his most hated enemies, the [[Thing (Benjamin Grimm)|Thing]], and Thundra attacked him with her new allies. Thing was in the company of [[Medusa]], but it was his nobility that forced Thundra to rethink her position. [[Sandman (William Baker)|Sandman]] attempted to kill the rocky warrior, but Thundra saved Thing's life. She also aided the rest of the [[Fantastic Four]] when Wizard threatened the life of [[Richards, Franklin|Franklin Richards]] – son of [[Mister Fantastic]] and the [[Invisible Woman]]. Despite her gestures of goodwill, Thundra still helpd the Fright Four to escape and would return at a later time to challenge Thing to a rematch. The fight ended when Mister Fantastic temporarily transformed the Thing back into Ben Grimm, removing his powers and forcing Thundra to halt her assault. Thundra, deciding Thing was the greatest male warrior, would find herself caught in a love triangle with [[Masters, Alicia|Alicia Masters]] for the affections of the Thing, but Ben was too devoted to Alicia to entertain any of her advances. Nevertheless, Thundra would go on to help the Fantastic Four against the Frightful Four and [[Sub-Mariner|Namor, the Sub-Mariner]], when he attacked Manhattan.\n\nThundra was kidnapped by [[Mahkizmo|Mahkizmo the Nuclear Man]] when he traveled into the past from his home, Machus. He was considered the greatest warrior of his Earth, but that wouldn't stop the Fantastic Four from following. Medusa also gave chase and brought the Sisterhood with her. However, a nuclear explosion caused Mahkizmo to temporarily discorporate and merged two Earths into one, [[Earth-7412]]. Afterward, Thundra was returned to the Fantastic Four's time, and went her own way. The Frightful Four would renew their grudge with the Thing, and Thundra was there to help him. She also, along with [[Tigra (Greer Nelson)|Tigra]] and the [[Impossible Man]], would help the Fantastic Four against [[Brute (Reed Richards)|Brute]] – a creation of the [[High Evolutionary]] – and two androids designed by the [[Mad Thinker]]. She eventually found a friend in [[Hyperion (Zhib Ran)|Hyperion]] of the [[Squadron Sinister]] and fought against the [[Ms. Marvel (Carol Danvers)|Ms. Marvel]] and the [[Avengers]] defending him. A covert subdivision of the [[Roxxon Oil|Roxxon Corporation]], [[Nth Command]], introduced Thundra to a wrestling promoter, and she soon found herself in the ring battling the [[Grapplers]]. Thundra was drugged by [[Titania (Davida DeVito)|Titania]] and lost her match, but Roxxon still gave her an offer she couldn't refuse. Telling her they could return her to the future if she would smuggle equipment into [[Project PEGASUS]], she agreed, but once she saw the Thing, Thundra surrendered to him without revealing what she was doing. She escaped during a power outage but returned to assist Thing [[Quasar (Wendell Vaughn)|Quasar]], [[Goliath (Bill Foster)|Bill Foster]] and the [[Aquarian]] against the [[Nth Man]]. For her help Project: Pegasus forgave her earlier actions.\n\nThundra tracked her benefactors at Roxxon only to have them arrange a meeting with Hyperion. He brought Thundra to the Nth Command where they showed her their Nth Projector. This technology was said to be able to take her to a version of her world that never merged with Machus. Thundra stole the Projector, and she and Hyperion would soon battle the Thing. Learning the device was going to explode, Thundra professed her love for the Thing one last time before returning home. The Projector sent Thundra to [[Earth-8009]] where she took her place at the head of the United Sisterhood Empire of North America. Some of the warriors of Machus remained there and constructed a six-armed android able to weaken the Sisterhood on a genetic level. Thundra returned to modern day Earth, bringing the Thing back to the future where he defeated the android, and she finally came to terms she would never have him as her husband since his heart continued to belong to Alicia. Thundra sought out other dominant males and eventually traveled to the world of Polemachus where she met that world's champion, [[Arkon]]. The meeting between Thundra and Arkon led to a war between their worlds, and the Avengers and Fantastic Four had to intervene until the deciding battle came down to both civilizations greatest warriors. The battle of the sexes turned to romance, and Thundra returned to Polemachus to rule by Arkon's side. Political differences between Thundra and the male dominated society of Polemachus caused those in power to repeatedly attempt to sway the public against her. Their schemes were thwarted, but some outside help was usually required to do so. The Avengers, [[Quicksilver]] and even Arkon himself had to get involved to ensure Thundra's name not be soiled. Thundra and Arkon agreed to use modern technological acceptance and gender equality to balance the old ways of Polemachus, but many in power still opposed them. \n\nTo bolster the morale of her people, Thundra returned to the past in a quest to challenge the mightiest mortal man who ever walked the Earth. Her target was none other than the incredible [[Hulk (Bruce Banner)|Hulk]], but Thundra had a secret agenda. Scraping the inside of Hulk's cheek during their struggle, Thundra took enough cell samples to return to her time with and be the first woman in generations to become pregnant. The birth of her daughter would ensure the Sisterhood's continued rule for ages. [[Lyra]] was that child, and she would gain attributes from both parents to become the greatest warrior of her time. With the future secure, Thundra went back to modern day Earth and became briefly involved in a dispute between the [[Inhumans]], Medusa and her younger sister, [[Crystal]], while in a wilderness camp she started to empower females. When the [[She-Hulk]] called out for help, Thundra was one of the many females who would become the [[Lady Liberators]]. Together, the Liberators fought against [[Enmity]] and her agent, [[Unum]], the [[Red Hulk]], and the [[Winter Guard]] while fighting for refugees in a foreign land. After the fight with the Red Hulk, Thundra agreed to a secret alliance with him. Red Hulk told her the [[Intelligencia]] would come for her, offering the chance to get her back home if she helped them, but he assured her they wouldn't hold up their end of the bargain. He told Thundra if she allied herself with him, he would make good on the deal, and being that she needed to get home in order to guarantee Lyra would be born, Thundra accepted Red Hulk's offer. When the Red Hulk had to find [[Domino (Neena Thurman)|Domino]] because his identity had been compromised, Thundra was part of his team dubbed [[Code Red]]. She proved her loyalty to the Red Hulk when [[Doc Samson|Samson]] betrayed the red giant with the help of a [[Red She-Hulk]]. \n\nRed Hulk took her aside and told her the [[Leader (Samuel Sterns)|Leader]] and [[M.O.D.O.K.]] would not let her go so easily. He gave her something to contact him should they confront her while she was alone. The Red Hulk proved to be correct when the Wizard paid Thundra a visit, asking her to be a part of his Frightful Four once again. He knew about the DNA sample she hoped to have a child with, and when she refused to join – most likely because Wizard wanted her to deceive her friends, so he could kidnap Mister Fantastic – [[Klaw]] and [[Trapster]] attacked. Thundra was against the ropes, but before long, reinforcements arrived in the form of a red goliath who made quick work of Wizard's crew. After they were alone, Thundra told Red Hulk all about Lyra, and why it was so important she make it back to her time. She also told him Lyra had arrived in the present, and the two must never meet at all costs. Red Hulk and Thundra parted ways, and that's when disaster struck. An enraged Lyra found her mother, blaming her for the prejudice the Sisterhood had against her because she had a father. Lyra told Thundra how she was exiled, and it was all Thundra's fault because she promised Lyra no one would ever find out about the pregnancy. Thundra, afraid everything she had worked so hard for would come undone, slammed Lyra into a rock face. Horrified she injured her daughter, Thundra left in a hurry. Red Hulk encountered Lyra, now a part of the Frightful Four, but he dared not tell Thundra. Instead, he took Thundra to [[Latveria]] to find a time machine to send her back home. The Intelligencia had already kidnapped [[Doctor Doom (Victor von Doom)|Doctor Doom]], so they figured there would be no one to offer any resistance. Doom's technological defenses were down, but his magical safeguards were still in place. Red Hulk and Thundra were attacked by Nosferatu – savage [[Glossary:V#vampire|vampire]] creatures – which began to drain Red Hulk almost to the point of defeat, but Thundra used the time machine to jolt them half a day into the future, and into the sunlight, saving his life. She was in the process of burying the time machine in the exact spot the Sisterhood would find it in the future, but Red Hulk finished the job after they used it to send Thundra home.",
        "categories": [
            "Heroes",
            "Hulk",
            "Fantastic Four",
            "Women"
        ]
    }
}