{
    "id": 1011060,
    "name": "Ego",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/c0/4c00310350431",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011060",
    "comics": {
        "available": 4,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011060/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/32771",
                "name": "Astonishing Thor (2010) #2"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17518",
                "name": "Avengers (1998) #35"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/5844",
                "name": "Avengers Assemble Vol. 4 (Hardcover)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/39520",
                "name": "Essential Thor Vol. 5 (Trade Paperback)"
            }
        ],
        "returned": 4
    },
    "series": {
        "available": 4,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011060/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/9858",
                "name": "Astonishing Thor (2010)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/354",
                "name": "Avengers (1998 - 2004)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1816",
                "name": "Avengers Assemble Vol. 4 (2007)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/14475",
                "name": "Essential Thor Vol. 5 (2011 - Present)"
            }
        ],
        "returned": 4
    },
    "stories": {
        "available": 3,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011060/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/37398",
                "name": "Interstellar Intrigues",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/73878",
                "name": "Cover #73878  ",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/89661",
                "name": "Essential Thor Vol. 5 (2011) #1",
                "type": "cover"
            }
        ],
        "returned": 3
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011060/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011060/ego?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Ego?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Ego",
        "identity": "Known",
        "aliases": "Nu-Xandar, The Living Planet",
        "occupation": "Inapplicable",
        "place_of_birth": "The Black Galaxy",
        "groups": "Unofficial member of the [[Elders of the Universe]]",
        "citizenship": "Inapplicable",
        "education": "Inapplicable",
        "relatives": "[[Ego-Prime]] (clonal scion)",
        "height": "4165 miles in diameter",
        "weight": "Unrevealed",
        "eyes": "None",
        "hair": "None",
        "powers": "Ego is a planet sized entity that has immeasurable intelligence, and incalculable strength. Its stamina and durability are god-like, and it can fly through space at warp speed. Since Ego is essentially a \"living planet\", it has total control over its total mass down to the molecular level. It can shift its surface to appear as if it had a giant face, or grow enormous tentacles. It can make itself look like either a paradise, to lure unsuspecting travelers to their doom, or a barren world and can use its mass to create plant-like growths or humanoid bodies to carry it consciousness. Ego has an internal organ system that has giant tunnels, or arteries, a brain-like organ that is buried deep within its surface, and digestive organs to digest the living beings it absorbs into its body. Ego also has an immune system that will attack an entity that resists being absorbed.",
        "abilities": "Ego possesses knowledge over alien technology that is far more advanced than that of the Earth's",
        "weapons": "None",
        "paraphernalia": "A powerful sidereal propulsion unit attached to his south pole by [[Galactus]]",
        "debut": "Thor #132 (1966)",
        "origin": "(alleged) Fantastic Four #235 (1981)",
        "significant_issues": "Thor #132-133, Thor #161, Thor #227-228, Fantastic Four #234-235, Rom #69, Silver Surfer #4, Silver Surfer #22, Maximum Security: Dangerous Planet 1-shot, Maximum Security limited series #1-3, Became new HQ for the Nova Corps (Nova #20-21, 2009); Expelled Nova Corps from its being and seeks revenge (Nova #29-30, 2009)",
        "main_image": "Ego.jpg",
        "bio_text": "",
        "bio": "Within the Black Galaxy, one mass developed differently from the others. Evolving over millions of years, it grew to the size of a planet and developed intelligence and consciousness along with the ability to move its planet-sized mass by its own will. This planet became known as \"Ego, the Living Planet\". In its evolution, Ego developed organ-like masses under its surface, one of which is similar to a brain. As all sentient beings, Ego began to plan what its role in the universe would be.\n \nEgo’s first plot involved an interstellar conquest, which only led him to a confrontation with [[Thor (Thor Odinson)|Thor]], the God of Thunder, and the [[Recorder]]. Fleeing Ego, the [[Rigellians]] attempted to colonize Earth. Opposed by Thor, they explained their dilemma to him. Thor journeyed into the Black Galaxy to meet Ego. Ego, fascinated to meet a being from outside his space, engaged Thor in battle so that it could test its \"anti-body\" creations. Thor ravaged Ego’s surface with severe storms that caused the massive entity to be stunned. After Ego was defeated, it abandoned its plans for interstellar attack and vowed not to leave the Black Galaxy.\n\nThe next time Ego encountered the mighty Thor was during a battle with [[Galactus]]. Galactus had just recently consumed a world that had been home to the [[Wanderers]], surviving members of an Archeopian extraterrestrial race. Thor decided that Galactus was the bigger threat and he took Ego’s side against the world devourer. In gratitude, Ego allowed its surface to become the new home of Wanderers.\n\nA portion of Ego’s mass was taken by the Rigellian colonizer [[Nile, Tana|Tana Nile]] who hoped  that it could transform other uninhabitable worlds into worlds where life could flourish. In an unforeseen event, the piece of Ego gained its own consciousness and called itself [[Ego-Prime]]. Ego-Prime eventually made its way to Earth, which it sought to transform to resemble itself. In combat with Thor, Ego-Prime's energies were stolen and used to empower three mortals that would become members of the [[Young Gods]]. The weakened Ego-Prime was taken prisoner by the [[Stranger]], who stored it within his laboratory world.\n\nDriven insane by the removal of Tana Nile's sample, Ego devoured the Wanderers. Desperate for energy, Galactus again tried to devour Ego, but was outmatched and forced to flee. Recognizing the Ego had gone insane, Galactus dispatched his herald [[Firelord]], Thor, and [[Hercules (Heracles)|Hercules]] against Ego. To win the fight, Galactus attached a self-designed sidereal propulsion unit to the south pole of Ego, forcing the planet to be driven through space, away from the populated areas of the universe. However, Ego gained control over the thruster. Seeking revenge on Galactus, Ego traveled to Earth, but instead found opposition in the [[Fantastic Four]]. [[Mister Fantastic]] directed the [[Thing (Benjamin Grimm)|Thing]] to sabotage Ego's sidereal propulsion unit, which Ego could not seem to remove from its body. Ego was broken apart by the gravitational pull of the sun when the engine failed. \n\nHowever, Ego's consciousness still existed in every remaining portion of itself. Ego gradually reformed itself and repaired the damage done to the propulsion unit. Ego expended much of its energy in doing so and had to bring its energy reserves back up. Disguising itself as an idyllic, paradise-like sphere, it lured a party of [[Dire Wraiths]] to establish a base on its surface. Ego then absorbed them into his being in order to replenish his energy. But, ROM landed on Ego, seeking fellow Space Knights trapped within the planet along with the Dire Wraiths, and battled the living planet. Rom saved his fellow Space Knights and sent the Dire Wraiths to Limbo before Ego could consume them.\n \nEgo then allied himself with the [[Elders of the Universe]] claiming to be one himself. He allowed the Elders to even meet on its surface to discuss their plans. However, Ego is not the sole survivor of a particular race that was dedicated to one specific pursuit, so he did not qualify for membership. Still, it joined in their plot against Galactus and battled the [[Silver Surfer]], eventually capturing and attempting to absorb the power cosmic of the former herald. But, the Surfer seized control of the thruster and threatened to steer Ego into the sun, ensuring his release.\n\nEgo later encountered the [[Korbinites|Korbinite]] fleet, led by [[Beta Ray Bill]], and attacked them, destroying several ships. When Ego revealed to Bill that it was being driven mad by Galactus' thruster, Bill had the fleet destroy the thruster. Ego offered to make itself the Korbinites' new home, but Bill refused, suspicious of Ego and knowing that the Korbinites would resent Ego for having killed some of them. Bill left Ego deserted.\n\nThe enigmatic [[Celestials]] had transformed the Black Galaxy into a new member of their race, and this Celestial made contact with Ego. The [[High Evolutionary]] investigated this, and as Ego was being consumed by an immense \"Super-Ego\", speculated that Ego might be a single manifestation of a larger being, and that more than one Ego may exist. More Celestials came to examine Ego's dilemma, but how Ego escaped the Super-Ego is unknown.\n\nEgo began searching for worlds that he could \"wake up,\" so it would not be alone in the universe. If Ego could not wake a planet, it would deem it unworthy and destroy it regardless of the life forms that may have lived on the surface. [[Professor X|Charles Xavier]] led a group of [[Skrulls]] to Ego in order to stop its actions, and with the assistance of the Silver Surfer, they almost succeeded in halting its insane plan. Xavier looked into the mind of Ego and found madness, which immediately told him that Ego could not be reasoned with. He decided that he would have to shut Ego's mind down, and as he began the process, a starship belonging to the alien race, the [[Ruul]], intervened and shocked Ego into unconsciousness. This was going on at a time when an interplanetary council was deciding the fate of the Earth and ultimately declared it a prison planet for all alien criminals, including Ego.\n \nThe Ruul somehow managed to manipulate Ego's mass into a human sized vessel, but once on Earth, Ego started to expand. The heroes of Earth knew they only had a small amount of time to get Ego off the planet before it absorbed everything into itself. During the course of an investigation, [[U.S.Agent]] discovered that the Ruul were actually evolved members of the [[Kree]] race and had manipulated the interplanetary council for their own purposes. They had placed power conduits all over the Earth, so that once Ego expanded fully (which they knew would happen) and absorbed the Earth, they would take control of Ego and use its massive power for universal conquest. The Ruul, along with [[Ronan]] the Accuser, freed the [[Supreme Intelligence]] from captivity so that they would have a leader once more. Unfortunately for the Ruul, their plans would fail as Reed Richards created a device that enabled [[Quasar (Wendell Vaughn)|Quasar]] to absorb Ego into himself. With Ego gone and the council now aware of how they were tricked, the decision to make Earth a prison planet was reversed and the Ruul were defeated. Quasar, not wanting to endanger the Earth in case Ego escaped, decided that he would go into exile. \n\nRecently, Ego was among the beings who assaulted [[Thanos]] while he possessed the Heart of the Infinite. How Ego escaped from within Quasar has not been chronicled.\n\n[[image: Egos_revenge.jpg|225px|right|thumb|Ego demands retribution for having been violated by the Nova Corps]] Recently, the Xandarian [[Worldmind]] implemented its control over Ego's consciousness and took it for the new headquarters of the [[Nova Corps]]. Ego has been dubbed Nu-Xandar, and is currently occupying the same orbit as Earth with a gravimetric field around it as to not cause major destruction upon the planet. When the [[War of Kings|war between the Kree and Shi'ar]] broke out, Worldmind took Ego away from Earth in an attempt to stop the conflict, but not before stripping [[Nova (Richard Rider)|Nova]] of his powers. Quasar helped the de-powered Nova reach Nu-Xandar with the use of his [[Quantum Bands]]. Upon reaching his destination, Nova discovered it was actually Ego who was taking control of Worldmind, so Nova lobotomized the Living Planet, leaving Worldmind free of its influence. The Nova Corps continued to use the catatonic Ego as their base until the [[Inhumans]] unwittingly created a massive hole in the universe with a bomb meant to obliterate their Shi'ar enemies. A spacecraft, the [[Resolute Duty]], emerged after an absence of thirty-five years, and it brought with it the means to free Ego. A bounty hunter called [[Monark Starstalker]] damaged Worldmind's systems, enabling Ego to repair himself quicker and reassert control over his body. The Nova Corps needed to evacuate fast, but aboard the Resolute Duty there was another battle raging. [[Mindless Ones]] had followed the ship through [[The Fault]] with the intention of liberating their captured leader. Nova had Worldmind create a portal to transport the Mindless Ones and their leader inside Ego's brain, giving him a more immediate threat than the Corps to attend to. Ego was forced to flee when [[Philo, Zan|Zan Philo]], captain of the Resolute Duty, turned the ship's massive energy cannon's on him. Even though the Nova Corps triumphed that day, Worldmind was certain they'd cross paths with Ego again.",
        "categories": [
            "Villains",
            "Cosmic"
        ]
    }
}