{
    "id": 1011047,
    "name": "Turbo",
    "description": "As Turbo, young journalist Michiko Musashi is the latest in a line of heroes who have worn the turbine-powered flying armor.",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/00/4c00322ddea0c",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011047",
    "comics": {
        "available": 3,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011047/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/10084",
                "name": "Marvel Comics Presents (1988) #166"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/10085",
                "name": "Marvel Comics Presents (1988) #167"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/15848",
                "name": "The Loners (2007) #3"
            }
        ],
        "returned": 3
    },
    "series": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011047/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2039",
                "name": "Marvel Comics Presents (1988 - 1995)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1938",
                "name": "The Loners (2007 - 2008)"
            }
        ],
        "returned": 2
    },
    "stories": {
        "available": 3,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011047/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/23110",
                "name": "Cutting Class",
                "type": ""
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/23116",
                "name": "Cutting Class Part 2",
                "type": ""
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/32363",
                "name": "3 of 6 - 6XLS",
                "type": "cover"
            }
        ],
        "returned": 3
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011047/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011047/turbo?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Turbo_%28Michiko_Musashi%29?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Michiko \"Mickey\" Musashi",
        "aliases": "Torpedo Sue",
        "identity": "Secret",
        "occupation": "Adventurer, investigative journalist",
        "citizenship": "U.S.A.",
        "place_of_birth": "Hartford, Connecticut",
        "relatives": "Unidentified parents",
        "groups": "[[Loners]], Los Angeles Times staff; formerly [[New Warriors]], partner of Mike Jeffries",
        "education": "Journalism degree from Long Island University",
        "height": "5'6\"",
        "weight": "120 lbs.",
        "eyes": "Brown",
        "hair": "Black",
        "powers": "None",
        "abilities": "Unrevealed",
        "weapons": "None",
        "paraphernalia": "Mickey Musashi is highly intelligent, a trained journalist, and is inventively resourceful in crisis situations. She has some experience in unarmed combat and extensive training in self-propelled aerobatics. Musashi is fluent in both Spanish and English. She seems to have a natural aptitude for operating cybernetic control systems. Her Turbo armor enables her to fly at speeds of up to 5000 miles per hour via small, nuclear-powered jet turbine units attached to the suit's wrists and ankles; she can maintain top speed for up to six hours before the suit's power runs down. She can also use the suit's turbines to generate powerful gusts of high-speed wind; a wide-angle wind blast covering a large area can reach speeds of 50 miles per hour within a range of up to 500 feet, while more concentrated, narrow-focus wind blasts can reach speeds of 100 miles per hour within a 200-foot range. If timed properly, the turbines can release a series of short, high-speed air blasts that strike with tremendous concussive force, a \"hyperblast\". By applying a similar turbine setting while throwing a punch, the suit's wearer can deliver a powerful \"hyperpunch\". A double \"hyperpunch\" strikes with force equivalent to blows from beings with Class 100 superhuman strength; however, Turbo can moderate the force of a \"hyperpunch\" to avoid injuring her targets. By reversing the motion of her turbine fans, she can create powerful suction sufficient to draw objects towards her. She can also use her suit's turbines to create short-lived cyclones or waterspouts by accelerating and directing large masses of air in her immediate vicinity, but tends to avoid this tactic since the results can be unpredictable. Turbo can reconfigure the appearance of her armor at will (notably changing its overall color or the shape of its helmet and turbines), though the suit's functions seem to remain the same regardless of such superficial alterations.",
        "debut": "New Warriors #28 (1992)",
        "origin": "",
        "significant_issues": "[[OHOTMU:Bibliography-AZ11#Turbo (Musashi)|Official Handbook of the Marvel Universe Bibliography]]",
        "main_image": "Trbo.jpg",
        "bio_text": "",
        "bio": "As Turbo, young journalist Mickey Musashi is the latest in a line of heroes who have worn her turbine-powered flying armor. The armor was invented by Yugoslavian scientist Eugene Stivak, who was working for his uncle, U.S. senator Eugene Stivak. The elder Stivak was secretly in league with hostile extraterrestrials known as the [[Dire Wraiths]], who hoped that a combination of human and Wraith technology could produce battle armor capable of destroying the Wraiths' longtime foes, the [[Galadorians|Galadorian]] [[Spaceknights]]. Incorporating Wraith technology supplied by Senator Stivak, Eugene's turbine-propelled \"Torpedo\" armor was supposedly intended for U.S. military use, but Eugene discovered that his uncle was actually a subversive plotting the overthrow of the American government. Eugene stalled for time by supplying his uncle with inferior \"Rocketeer\" armors based on his Torpedo designs, then stole the only functioning Torpedo suit and set out to destroy the design plans so that it could not be duplicated. Wearing the Torpedo armor, Eugene was accused of being a criminal and accidentally killed during a mistaken skirmish with the costumed hero [[Daredevil (Matthew Murdock)|Daredevil]]. When insurance salesman Brock Jones tried to help the dying Eugene, Stivak told him everything he knew about the Torpedo armor, gave the armor to Jones, and begged him to complete his mission. As the new Torpedo, Jones outfought Senator Stivak's Rocketeers and destroyed the Torpedo suit plans. Enjoying these adventures, Jones remained occasionally active as a superhero, eventually learning the full truth about his armor's alien heritage. The Torpedo became a friend and ally to the Galadorian Spaceknight Rom and a hated enemy of the Dire Wraiths, who ultimately killed Jones in battle when they overran his small town home in Clairton, West Virginia.\n\nThe Wraiths who killed Jones were a mystically-inclined faction, indifferent to technology and unaware of the Torpedo suit's significance, so they left it behind. With Jones dead and his immediate family either killed or in hiding, the Torpedo suit and some of Brock's other belongings were eventually packed up and sent to his cousin, Phillip Jeffries, who stored it in his attic and forgot about it. Years later, Phillip's son Mike had become a freshman engineering major at Long Island University, and was searching for a costume for a Halloween party at his school. A lifelong superhero fan and avid comic book reader, Mike assembled a generic superhero suit for himself from various odds and ends, but he had also promised to supply a costume for his best friend, journalism major Mickey Musashi. Finding the Torpedo armor in his family's trunk and mistaking it for a conventional Halloween costume, Mike gave the \"incredibly goofy-looking\" armor to Mickey, who wore it to the party that night. Meanwhile, a group of scientists who had worked in the lab that produced the Torpedo armor detected its reactivation; donning Rocketeer armor, they crashed the party in search of the Torpedo suit, attacking Mike and Mickey. Instinctively activating the armor's turbines, Mickey swiftly defeated the Rocketeers, calling herself \"Torpedo Sue\" after misinterpreting a Rocketeer's half-finished remark about the \"Torpedo suit\". Mike was amazed, and appalled that he had given away the sort of super-powers he had always dreamed of having.\n\nUnaware of the armor's origins, Mickey and Mike decided to keep it and took turns using it. Mickey was a natural, mastering the suit's basic functions with ease, but Mike's command of the suit's abilities was clumsy and far more limited. Despite this, Mike wanted to use the suit as a superhero. Mickey, however, was only interested in using the armor's high-speed flight capability for world travel, and she repeatedly visited Europe. During one of these transatlantic voyages, she stumbled upon armed smugglers in league with the super-criminals Cardinal and Sea Urchin. Mickey fled the scene after the smugglers shot at her, but she later felt shamed into investigating further when she saw news reports of the [[New Warriors]], heroes as young as herself, clashing with the same smuggling ring. Calling herself Turbo, Mickey helped the New Warriors capture [[Sea Urchin]], [[Harrier|Cardinal]] and the rest of the smugglers. Later, an overenthusiastic Mike Jeffries also went into action under the alias Turbo, using the armor to aid the New Warriors and other heroes against the shadow-powered madman [[Asylum (Henrique Gallante)|Darkling]].\n\nDespite Mickey's reluctance to play superhero, she and Mike began training with the New Warriors so that they could use their suit better, and they helped their mentor [[Nova (Richard Rider)|Nova]] defeat the criminal Air Force team during one of these training sessions. The Turbo duo eventually became official Warriors after Mickey helped the group defeat the [[Sphinx (Anath-Na Mut)|Sphinx]], initially serving as reservists; however, Mike virtually never saw any action with the team, since the far more capable Mickey was invariably called in when the group needed Turbo. Mickey gradually became a full time member of the Warriors despite herself, but she eventually tired of her superhero life and resolved to retire as Turbo, figuring Mike would take over; however, after Dire Wraith queen [[Volx]] murdered Mike and usurped the armor, a fighting-mad Mickey helped the Warriors defeat Volx and reclaimed the armor, resolving to continue as Turbo in Mike's memory. Having gotten used to sharing the suit, Mickey offered to split custody of it with non-powered Warriors teammate [[Hindsight]] (an awkward superhero fan very much like Mike), but the Warriors drifted apart and broke up before anything came of that potential partnership.\n\nRejoining the Warriors after they regrouped, Turbo drastically reconfigured her armor using designs Mike had drawn up before his death. She also began dating arson investigator Dalton Beck, unaware that Beck was secretly the criminal mercenary [[Firestrike]] and that crimelord Joe Silvermane had hired Beck to eliminate Turbo and steal her armor. Mickey fell deeply in love with Dalton, even sharing her secret identity with him, and Dalton found himself falling for her despite his original intentions. Though he had opportunities to kill Mickey and steal her armor, he could not bring himself to do it. When Mickey finally discovered the truth about Dalton, he helped the Warriors capture his former partners in the Heavy Mettle criminal mercenary squad, and he tried to win Mickey back. Unmoved even after Dalton saved her during the battle, Mickey rejected Dalton's apologies and turned him over to the authorities. She later reconsidered and told the imprisoned Dalton she was willing to give him a second chance, only to learn that he was entering the witness protection program and would never see her again. Heartbroken, Turbo almost started a rebound romance with teammate Nova, but it never quite clicked.\n\nAfter helping the Warriors capture petty super-criminal [[Southpaw]], Mickey had an epiphany and decided to stop playing superhero, resolving to do something more meaningful with her life. Finishing school, she landed a job on the Los Angeles Times with the help of her friend [[Green Goblin (Phil Urich)|Phil Urich]], a Times staffer and similarly young journalist who had encountered the New Warriors during his short-lived stint as a heroic version of the Green Goblin. Shortly after Mickey moved to Los Angeles, she and Phil founded [[Loners]], a support group for young ex-superheroes. Wealthy entrepreneur and former young adventurer [[Jones, Rick|Rick Jones]] took an interest in their group and offered them a million dollars to apprehend the Runaways, a group of unsupervised teenage adventurers in need of guidance. Reluctantly going back into superhero action, Turbo and her partners pursued the [[Runaways]], clashed with them repeatedly, and later saved the Runaways by destroying the killer robot [[Ultron]]. Impressed by this victory, Jones offered to fund Turbo's group on an ongoing basis if they continued working together as superheroes. Turbo, Urich and their partners warily agreed, and have remained active as both superheroes and a support group for troubled super-youth.",
        "categories": [
            "Heroes",
            "Women"
        ]
    }
}