{
    "id": 1011223,
    "name": "Skaar",
    "description": "The Hulk fathered a son while on the planet Sakaar, but thought him killed while still in his mother's womb; he was wrong.",
    "modified": "2011-02-28T10:37:48-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/9/20/4ce18a92c7a50",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011223",
    "comics": {
        "available": 13,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011223/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/29378",
                "name": "Incredible Hulk Vol. 3: World War Hulks (Trade Paperback)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/29541",
                "name": "Incredible Hulks (2009) #602 (SHS VARIANT)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/28668",
                "name": "Incredible Hulks (2009) #603 (ZOMBIE VARIANT)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/29979",
                "name": "Incredible Hulks (2009) #603 (SHS VARIANT)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/29830",
                "name": "Incredible Hulks (2009) #605 (DJURDJEVIC 70TH ANNIVERSARY VARIANT)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/30015",
                "name": "Incredible Hulks (2009) #607 (MCGUINNESS VARIANT)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/31071",
                "name": "Incredible Hulks (2009) #608 (VARIANT)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/30431",
                "name": "Incredible Hulks (2009) #609 (VARIANT)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/36049",
                "name": "Incredible Hulks (2009) #625"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/36578",
                "name": "Incredible Hulks: Planet Savage TPB (Trade Paperback)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/38542",
                "name": "Skaar: King of the Savage Land (2011) #1"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/38505",
                "name": "Skaar: King of the Savage Land (2011) #1 (TAN VARIANT)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/38545",
                "name": "Skaar: King of the Savage Land (2011) #5"
            }
        ],
        "returned": 13
    },
    "series": {
        "available": 4,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011223/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/10261",
                "name": "Incredible Hulk Vol. 3: World War Hulks (2011)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/8842",
                "name": "Incredible Hulks (2009 - 2011)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/12968",
                "name": "Incredible Hulks: Planet Savage TPB (2010 - Present)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/13882",
                "name": "Skaar: King of the Savage Land (2011)"
            }
        ],
        "returned": 4
    },
    "stories": {
        "available": 16,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011223/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/63909",
                "name": "INCREDIBLE HULK VOL. 3 #1",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/79784",
                "name": "INCREDIBLE HULKS 625",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/79787",
                "name": "Cover #79787",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/81181",
                "name": "Interior #81181",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/84553",
                "name": "SKAAR: KING OF THE SAVAGE LAND 1 TAN VARIANT ",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/84554",
                "name": "SKAAR: KING OF THE SAVAGE LAND 1 TAN VARIANT ",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/84627",
                "name": "SKAAR: KING OF THE SAVAGE LAND 1",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/84628",
                "name": "SKAAR: KING OF THE SAVAGE LAND 1",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/94043",
                "name": "SKAAR: KING OF THE SAVAGE LAND #5 (of 5)",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/94784",
                "name": "Incredible Hulks (2009) #602, SHS VARIANT",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/94785",
                "name": "Incredible Hulks (2009) #603, SHS VARIANT",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/94786",
                "name": "Incredible Hulks (2009) #603, ZOMBIE VARIANT",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/94787",
                "name": "Incredible Hulks (2009) #605, DJURDJEVIC 70TH ANNIVERSARY VARIANT",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/94793",
                "name": "Incredible Hulks (2009) #607, MCGUINNESS VARIANT",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/94822",
                "name": "Incredible Hulks (2009) #608, VARIANT",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/94824",
                "name": "Incredible Hulks (2009) #609, VARIANT",
                "type": "cover"
            }
        ],
        "returned": 16
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011223/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011223/skaar?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Skaar?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "blurb": "",
        "real_name": "Skaar",
        "aliases": "Son of Hulk, Sakaarson, Worldbreaker",
        "identity": "No dual identity",
        "occupation": "Warrior",
        "citizenship": "Sakaar",
        "place_of_birth": "Crown City, Sakaar",
        "relatives": "[[Hulk (Bruce Banner)|Robert Bruce Banner]] (Hulk, father), [[Caiera|Caiera]] (mother, deceased), [[Hiro-Kala]] (twin brother), [[Lyra]] (half-sister), [[Banner, Brian|Brian]] and Rebecca Banner (grandparents, deceased), others",
        "groups": "None",
        "education": "No formal education",
        "height": "(Shadow) 5'2\"; (Skaar) 6'6\"",
        "weight": "(Shadow) 105 lbs. (Skaar) 400 lbs.",
        "eyes": "Green",
        "hair": "Black",
        "powers": "Skaar's gamma-spawned and Old Power heritage grants him superhuman strength, lifting at least 90 tons. He possesses superhuman stamina and durability, is particularly immune to the affects of fire and can rapidly regenerate from wounds. Skaar's powerful legs muscles allow him to leap through the air up to 600' vertically or 1000' horizontally. Using the Old Power, Skaar can make his skin harder than stone and increase his strength while he touches ground; he can also manipulate stone and rock, using the power to levitate boulders. At the height of his connection to the Old Power on Sakaar, Skaar could create earthquakes and sense the life forces of other beings anywhere on the planet. Skaar can transform into a childlike Shadow form in which he can still access some of the Old Power, but cannot use his gamma-induced powers.",
        "abilities": "",
        "weapons": "Skaar has been known to wield very large staffs and swords.",
        "paraphernalia": "",
        "debut": "World War Hulk #5 (2007)",
        "origin": "",
        "significant_issues": "",
        "main_image": "Skaar_442.jpg",
        "bio_text": "Born in fire. Raised by monsters. Destined to destroy. He is the son of Hulk, '''Skaar'''.",
        "bio": "Born in fire. Raised by monsters. Destined to destroy. He is the son of Hulk, '''Skaar'''.\n\n== Abandoned on a Savage Planet ==\n[[image:Acotilletta2--Skaar_Sakaar442.jpg|165px|left]]The catastrophe on [[Sakaar]] which caused the death of [[Caiera]] and the [[Hulk (Bruce Banner)|Hulk]] to seek revenge on those he held responsible gave birth to a new kind of monster. A lone child emerged from the charred waste the planet was left in. He grew quickly, and without parents to raise him so did his rage. Taken in by savage creatures, the child learned at a young age to kill in order to survive. Soon, he was given a name – Skaar – and his story was just beginning. Skaar was proclaimed a prophet by some and a demon by others, but all he cared about was claiming his birthright – the [[Glossary:O#Old Power|Old Power]]. There were those who would oppose him, but after suffering so many hardships since birth, Skaar only knew how to [[Trials of Skaar|endure]].\n\n\n== Return of the Silver Savage ==\n[[image:Acotilletta2--Skaar_vs_Surfer442.jpg|225px|left]]The [[Silver Surfer]] was trapped on Sakaar at one time and forced to fight in the arena of the [[Red King]]. After he was freed by Hulk, he was able to return to his master's side. It is unrevealed if his master sought retaliation for imprisoning his [[Heralds of Galactus|herald]], but [[Galactus]] was going to devour the planet. Hoping to warn the population - giving them enough time to evacuate - the Silver Surfer returned and was met with violence. Skaar viciously attacked the Surfer and managed to enslave him again with an [[Obedience Disks|Obedience Disk]]. \n\nHell-bent on destroying [[Axeman Bone]] and his army, Skaar persisted in fighting a war that only delayed his people from escaping Sakaar's imminent destruction. Caiera's spirit tried to reason with her son after she took the Old Power from him. Skaar said he only wanted to cleanse the planet of those he believed were evil, but a vision shown to him by the Surfer illustrated how everyone on Sakaar would die once Galactus arrived. Skaar tricked his mother into thinking he saw the error of his ways, but once she restored his power, Skaar doomed his people by destroying their means of escape. Caiera was left with no choice but to banish him to [[Earth]]. Before he was completely sucked through the wormhole, Skaar watched as his mother sacrificed herself to Galactus hoping to sate his hunger with an enormous amount of Old Power. The Silver Surfer said her final act would save billions since the Old Power could sustain his master for years to come. Skaar chose to defile Caiera's memory and awakened Galactus' need to feed once more with a blast of his Old Power, and then he was gone.\n\n== Daddy Issues ==\n[[image:Acotilletta2--Skaar_transformation442.jpg|150px|left]]On Earth, Skaar didn't find peace as an encounter with the [[Fantastic Four]], [[She-Hulk]] and [[H.A.M. M.E.R.]] forced [[Green Goblin (Norman Osborn)|Norman Osborn]] to bomb the battlefield, seemingly killing him in the process. Skaar didn't die that day, but he learned he could transform into a young boy. His inner child despised everything Skaar stood for, but Skaar only had one thing on his mind – to find the Hulk and kill him for abandoning him on Sakaar. He blamed his father for every horrible thing he had to bear on his home world, and he would have the chance to pay him back when the Hulk finally arrived. Banner suppressed the personality known as the Green Scar, leaving the \"Savage Hulk\" in his place, but this incarnation was still more than a match for Skaar. While Hulk had no memory of his son, this didn't stop the raging titans from nearly causing a nuclear catastrophe during their brawl. After Hulk and the [[Warbound]] averted disaster, Skaar deemed Hulk wasn't worthy enough to kill and left.\n\n\n== Training Days ==\n[[image:Acotilletta2--Skaar_vs_Juggernaut442.jpg|200px|left]]Skaar allied with Banner, now freed of his Hulk persona courtesy of the [[Red Hulk]]. Banner wanted to train his son should the Green Scar return and decided Skaar needed to learn all the things his savage childhood denied him; aspects like teamwork, developing friendships and resisting temptation. Skaar's training resulted in several pairings with deadly sparring partners. His first battle pit Skaar against Cain Marko, the powerhouse known as [[Juggernaut]]. The conflict ended badly for Marko as Skaar used a combination of strength and Old Power to punch him into orbit. Next on Banner's list of playmates was [[Daken]]. This meeting almost led to disaster when Skaar transformed back into a child and asked Daken to kill him, forcing Banner and [[Wolverine (James Howlett)|Wolverine]] to save him. A friendly game of football with [[Jones, Rick|A-Bomb]] and [[Korg]] nearly turned deadly when the [[Jones, Marlo Chandler|Harpy]] attacked. Fearing his wife, [[Ross-Banner, Betty|Betty]], had become the creature once more, Banner saved her from Skaar's blade. When it was revealed to be Marlo, A-Bomb took her away. Finally, Skaar's last lesson would be taught while fighting one of Hulk's oldest foes, [[Tyrannus]]. Skaar was tempted to join Tyrannus and his horde of monsters, but he chose to drive the villain back to his underground lair instead. Skaar received a hero's parade for saving the city. \n\n== Fall of the Hulks ==\n[[image:Acotilletta2--Skaar_Avengers_Smash.jpg|175px|left]] When a collection of the smartest criminal minds on the planet came together in a group called the [[Intelligencia]], Banner became their prime target. In their pursuit to destroy the Hulk they besieged several others to help further that goal. One of the Intelligencia's first acquisitions was a man who betrayed them in the past, [[Doctor Doom (Victor von Doom)|Doctor Doom]]. They used the [[Hulk (Cosmos Automation)|Cosmic Hulk]] to invade [[Latveria]] and abduct the mad dictator. Skaar attempted to thwart the Intelligencia's plans, but Cosmic Hulk was too powerful, and Skaar had to be saved by Banner. Doom was taken, but Skaar got a second chance to prevent a kidnapping when the Red She-Hulk assaulted the [[Avengers]]. More brutal than anticipated, Red She-Hulk beat her opponents and took [[Yellowjacket (Henry Pym)|Henry Pym]]. The only chance they had left was to take the fight to the Intelligencia where Skaar met his half-sister, [[Lyra]], and several other heroes who allied with Banner against them. However, once Banner was captured by his enemies, Skaar was forcibly ejected from the [[Hellcarrier]] and temporarily on his own. \n\n\n== World War Hulks ==\n[[image:Acotilletta2--Skaar_vs_Hulk442.jpg|200px|left]] Skaar did what he knew best – fight. He fought against the Intelligencia's army of Hulks marching on the nation's capitol. He fought against some of the [[\"Hulked-Out Heroes\"]] running amok. He found a way back to the Hellcarrier and saved Banner from death at the hands of the Red She-Hulk – nearly killing her in the process by running her through with his sword. From the moment Skaar arrived on the planet he had been fighting and waiting for the opportunity to kill the Hulk, and even though he walked away from it the first time they met, he would get another chance. In order to free those transformed into Hulks, Banner drew all the radiation back inside his body, becoming the Hulk once more. Father and son would again meet on the field of battle, and Skaar was ready for a rematch. The son of Hulk was first to attack with the intent to kill, and try as he might Hulk appeared to be taking the worst of the blows between Skaar's strength and his deadly Old Power. Betty came to the aid of her ex-husband, but even the power of the Red She-Hulk could not slow Skaar's onslaught. In an attempt to get rid of her, Skaar lashed out and inadvertently placed several onlookers in jeopardy. When the Hulk set aside their differences to save innocent lives, Skaar finally realized his father was not a monster as Banner said. Skaar decided not to fight any longer and shifted back into a child. Banner saw a little something of him inside the boy and chose to embrace him and make sure his son knew he would be there for him - always. \n\n== Sibling Rivalry ==\n[[image:Acotilletta2--Skaar_vs_Hiro-Kala442.jpg|200px|left]] Skaar watched as his new family adjusted to one another when a sudden, horrific sensation shot through him. [[Hiro-Kala]], the twin brother he never met, was using the Old Power to propel the planet [[K'ai]] toward the Earth in an attempt to destroy the father who abandoned him on Sakaar. Both siblings shared a similar story save for the fact that Skaar changed his opinion of the Hulk, and he knew Hiro-Kala was evil and unable to see the light. Skaar also knew his father was unprepared to do what was necessary to save the world – kill Hiro-Kala. Skaar used his Old Power to operate one of the stone ships of the Shadow People to take the Hulks into space, and once on K'ai Skaar wanted to confront his brother despite the protests of the Hulk. [[Korg]] and [[Jones, Rick|A-Bomb]] were assigned to watch Skaar, but he eventually gave them the slip and met Hiro-Kala face-to-face. While Banner helped the planet heal itself, Skaar imprisoned Hiro-Kala in a rock tomb essentially making him a part of K'ai and ending the threat to Earth. The Hulks went home, and K'ai was brought back to the [[Microverse]] by [[Rann, Arcturus|Arcturus Rann]] and the [[Enigma Force]].",
        "categories": [
            "Cosmic",
            "Hulk"
        ]
    }
}