{
    "id": 1011153,
    "name": "Proemial Gods",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/2/f0/4c002f51c9436",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011153",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011153/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011153/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011153/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011153/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011153/proemial_gods?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Proemial_Gods?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "blurb": "",
        "base_of_operations": "The Living Universe",
        "debut": "Hearlds of Galactus #2 (2007)",
        "significant_issues": "(Annihilation: Silver Surfer #3) Aegis and Tenebrous were released from their imprisonment, when the prison world of Kyln was destroyed by the Annihilation Wave. (Annihilation: Silver Surfer #4)Thanos' new found ally Skreet is identified as a Chaos Mite by Aegis and the Fallen one is returned to Thanos. (Heralds of Galactus #2) The origin of the Proemial Gods, and the death of Aegis and Tenebrous.",
        "current_members": "They are all believed to be deceased.",
        "former_members": "[[Aegis (Lady of All Sorrows)]], [[Antiphon the Overseer]], [[Brio|Brio of Life]], [[Diableri|Diableri of chaos]], [[Tenebrous|Tenebrous of the Darkness Between]]",
        "other_members": "Unrevealed",
        "main_image": "Proemial_Gods.jpg",
        "bio_text": "In a time when the Living Universe was young, and was full of chaos. There was beauty, but it was the beauty of the void, formless and without intent. The cosmic Consonance deemed that there be order and balance to this chaos. The universe does not measure time, but by natural sequence, a balance was struck and the cosmic consonance was set. From the chaos came order, and from order intent. They became the caretakers, conceived through intent. Each of them had been tasked to maintain the cosmic consonance. They were without will and without awareness of anything but the task set before them. They existed to serve the living Universe. They were the Proemial Gods.",
        "bio": "In a time when the Living Universe was young, and was full of chaos. There was beauty, but it was the beauty of the void, formless and without intent. The cosmic Consonance deemed that there be order and balance to this chaos. The universe does not measure time, but by natural sequence, a balance was struck and the cosmic consonance was set. From the chaos came order, and from order intent. They became the caretakers, conceived through intent. Each of them had been tasked to maintain the cosmic consonance. They were without will and without awareness of anything but the task set before them. They existed to serve the living Universe. They were the Proemial Gods.\n\n\n\n[[image: Aegis_small_hed.jpg|100 pixel image|100px|left]][[Aegis (Lady of All Sorrows)]] was tasked with culling the living universe of divergences and aberrations.\n\n\n[[image: Tenebrous_small_hed.jpg|100 pixel image|100px|left]][[Tenebrous|Tenebrous of the Darkness Between]], tasked with the black, the living matter that binds the universe and makes it whole.\n\n \n[[image: Antiphon_Small_Hed.jpg |100 pixel image|100px|left]] [[Antiphon the Overseer]], was the first among the equals to be tasked with monitoring the cosmic consonance.\n\n\n\n\n[[image: Diableri_small_hed.jpg  |100 pixel image|100px|left]][[ Diableri|Diableri of Chaos]], became order unchecked and led the entropy.\n\n\n\n\n[[image: Brio_small_hed.jpg  |100 pixel image|100px|left]][[Brio|Brio of Life]], was tasked with the welfare of fledgling life forms.\n\n\n\n\n\n\nIt was through the wicked [[Diableri]], that the Chaos Sprites were born into the universe of chaos. They were small beings that possessed cosmic power beyond measure. [[image:Chaos_Sprites.jpg|100 pixel image|thumb|'''Chaos Sprites'''|right]] They were Diableri’s eyes and ears. They were minute sentinels tasked by their master to sow chaos in order. They also served the cosmic consonance. After escaping the [[Crunch]] cascade cosmic powered prison called the [[Kyln]]. [[Aegis (Lady of All Sorrows)|Aegis]], noticed the small winged woman on the shoulder of [[Thanos|Thanos of Titan]]. She inquired, if that was a Chaos Mite. The [[Chaos Mites]] were the first born of the [[Glossary:B#Big Bang|creation event]]. They were Alpha life forms deemed unstable by the cosmic consonance. Aegis was curious as to how [[Skreet]] survive the great purge of the universe. Skreet pledged to never tell because she might have to hide again. It is possible that she was spawned from the Sprites of Diableri, this mystery goes unsolved, and is still under investigation.\n\nThe Gods shepherded the young Universe, maintaining the delicate balance between order and chaos. As a result the Living Universe expanded and flourished. Life thrived on countless worlds, each life form unique from the other. They were formed by the choices made and the actions taken, by those serving the cosmic consonance. The better they performed their task, the less they were needed to perform their assigned task. The Living Universes' need for them lessened, and the Proemial Gods started to diminish from existences. One of their members, whose functions evolved into awareness and that awareness, had become dark ambition. Diableri of chaos would not see himself erased from the Living Universe. So he embarked on a mission to remake the Universe in his own image.\n\nFor his new found purpose Diableri corrupted the purpose of the Proemial Gods, many of them came to embrace his dark ambitions; those most loyal to him were Aegis and Tenebrous. The Proemial beings became engaged in a War of Gods, and Gods died. Had Diableri not brought his war to [[Galactus]] he would have achieved his dark ambitions.\n\nThis recount of Universal history comes from the World Devourer Galactus, as he prepares his noble [[Heralds of Galactus|Herald]] the [[Silver Surfer]] to track down Aegis and Tenebrous. Galactus sought revenge for their interference in the [[Annihilation]] conflict allowing both he and the Silver Surfer to become lab rats to Thanos of Titan. Not only did Thanos experiment on Galactus, while he was looking for a way to extract the Power Cosmic from their very beings, he turned Galactus into cosmic cannon. Galactus sent the Surfer to track down the two Proemial Gods. He was instructed find them and wait for him to come and assist him. Galactus wanted to rid the Universe of them, before they could continue the wicked mission of Diableri. \n\n[[image:The_Kyln_Prison.jpg|100 pixel image|thumb|'''The Proemial Gods were imprisoned in the Kyln Prison'''|left]]The Surfer tracked them back to the ruins of Kyln, were they had found the deceased body of their brother [[Antiphon the Overseer]] floating in the prison’s wreckage. The Surfer attacked and defeated Aegis and Tenbrous by using the power of the Crunch Cascade itself as a weapon. Galactus arrived to witness the impossible triumph of his Herald.",
        "categories": [
            "Annihilation",
            "Deceased",
            "Cosmic",
            "Villains"
        ]
    }
}