{
    "id": 1011038,
    "name": "Bug",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/8/30/4c00323e50dda",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011038",
    "comics": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011038/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/22433",
                "name": "Annihilation Classic (Hardcover)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/23284",
                "name": "Bug (1997) #1"
            }
        ],
        "returned": 2
    },
    "series": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011038/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/6056",
                "name": "Annihilation Classic (2008)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/6667",
                "name": "Bug (1997)"
            }
        ],
        "returned": 2
    },
    "stories": {
        "available": 5,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011038/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/52096",
                "name": "Cover #52096",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/52097",
                "name": "Apples & Origins",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/52098",
                "name": "The Help Bug Right the Time/Space Continuum Board Game",
                "type": ""
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/52099",
                "name": "What's Wrong With this Picture",
                "type": ""
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/52100",
                "name": "Bug's Catch All Activity Page",
                "type": ""
            }
        ],
        "returned": 5
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011038/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011038/bug?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Bug?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "blurb": "A warrior and master thief from Inner Space - the loveable incorrigible member of the Microns, Bug!",
        "real_name": "Unpronounceable by humans",
        "aliases": "The Galactic Warrior, \"Loverbug\"",
        "identity": "No dual identity",
        "occupation": "Adventurer, master thief",
        "citizenship": "Kaliklak",
        "place_of_birth": "Planet Kaliklak, Microverse",
        "relatives": "Wartstaff (father, deceased), Queen Esmera (mother, deceased)",
        "groups": "[[Guardians of the Galaxy]]; formerly Microns, Micronauts",
        "education": "Personal training by a master thief",
        "height": "(Microverse) 6'1\"; (Earth) 6\"",
        "weight": "(Microverse) 163 lbs.; (Earth) 1.4 oz.",
        "eyes": "Yellow",
        "hair": "Dark green",
        "powers": "Bug can cling to walls and has exceptional agility. He has extraordinary sight, with enhanced",
        "abilities": "Bug is a master thief, and skilled warrior, proficient with most any weapon.",
        "weapons": "Bug's chosen weapon is a rocket lance, which can fire varying intensities of energy, and can",
        "paraphernalia": "Bug has occasionally used a telepathically controlled glider-pac to enable flight.",
        "debut": "Micronauts #1 (1978)",
        "origin": "None",
        "significant_issues": "See [http://www.marvel.com/universe/OHOTMU:Bibliography-AZ2#Bug the OHotMU Online Bibliography]",
        "main_image": "Bug.jpg",
        "bio_text": "[[image:Bug-Unmasked.jpg|left]]Bug is an Insectivorid master thief and adventurer from the planet Kaliklak in the Microverse (a.k.a. Inner Space), a \"sub-atomic\" realm actually accessed via the energies of shrinking. Known as a humorous, lighthearted flirt, he is also a charismatic leader and adept warrior. Bug was raised on Kaliklak during the tyranny of the near-immortal evil Baron, and he trained under a master thief. He eventually rose to lead a gang of rebels, running raids against Baron Karza's forces. Betrayed by his father, Wartstaff, he was captured by the colonial governor. Bug escaped in a fighter craft, encountering a Raider spacecraft in which the stoic armored Acroyear, crown-prince of the planet Spartak, was bound by his traitorous brother, Shaitan. Bug rescued Acroyear, and Shaitan fled. Though opposites in temperament, Bug and the king formed an unbreakable bond of friendship. They were eventually captured, sent to the empire's central planetary system, Homeworld, and forced to fight in Baron Karza's Pleasure Pits. During one battle, [[Rann, Arcturus|Commander Arcturus Rann]] returned from a millennium-long telepathic journey across the Microverse which he had spent in suspended animation aboard his ship, the H.M.S. Endeavor, with his roboid companion, Biotron. Greeted with hostility from Baron Karza's Dog Soldiers, Rann was imprisoned with Bug and Acroyear. They escaped the Pit and fled along with Princess \"[[Marionette]]\" Mari and her roboid, Microtron, forming a team that later became known as the Microns. Breaching the Spacewall surrounding the Microverse, the group landed on Earth (Earth-616) in Daytona Florida at roughly one-twelfth their normal relative size. They befriended teenager Steven Coffin and his father, Ray. Separated from the team, Bug followed the Coffins to the laboratory of Prof. Philip Prometheus at Cape Canaveral's Human Engineering Life Laboratories (H.E.L.L.). There Bug defended Steven from the mad professor, who wished to use his Prometheus Pit, a passageway between Earth and the Microverse, to learn the science of Inner Space and transcend the limitations of his cybernetic body. Reunited, Bug and the team encountered the [[Man-Thing]], while Baron Karza used the Pit to enter Earth. The Baron aspired to conquer Earth, but was repelled by the power of [[Captain Universe]], wielded by Ray Coffin.",
        "bio": "[[image:Bug-Unmasked.jpg|left]]Bug is an Insectivorid master thief and adventurer from the planet Kaliklak in the Microverse (a.k.a. Inner Space), a \"sub-atomic\" realm actually accessed via the energies of shrinking. Known as a humorous, lighthearted flirt, he is also a charismatic leader and adept warrior. Bug was raised on Kaliklak during the tyranny of the near-immortal evil Baron, and he trained under a master thief. He eventually rose to lead a gang of rebels, running raids against Baron Karza's forces. Betrayed by his father, Wartstaff, he was captured by the colonial governor. Bug escaped in a fighter craft, encountering a Raider spacecraft in which the stoic armored Acroyear, crown-prince of the planet Spartak, was bound by his traitorous brother, Shaitan. Bug rescued Acroyear, and Shaitan fled. Though opposites in temperament, Bug and the king formed an unbreakable bond of friendship. They were eventually captured, sent to the empire's central planetary system, Homeworld, and forced to fight in Baron Karza's Pleasure Pits. During one battle, [[Rann, Arcturus|Commander Arcturus Rann]] returned from a millennium-long telepathic journey across the Microverse which he had spent in suspended animation aboard his ship, the H.M.S. Endeavor, with his roboid companion, Biotron. Greeted with hostility from Baron Karza's Dog Soldiers, Rann was imprisoned with Bug and Acroyear. They escaped the Pit and fled along with Princess \"[[Marionette]]\" Mari and her roboid, Microtron, forming a team that later became known as the Microns. Breaching the Spacewall surrounding the Microverse, the group landed on Earth (Earth-616) in Daytona Florida at roughly one-twelfth their normal relative size. They befriended teenager Steven Coffin and his father, Ray. Separated from the team, Bug followed the Coffins to the laboratory of Prof. Philip Prometheus at Cape Canaveral's Human Engineering Life Laboratories (H.E.L.L.). There Bug defended Steven from the mad professor, who wished to use his Prometheus Pit, a passageway between Earth and the Microverse, to learn the science of Inner Space and transcend the limitations of his cybernetic body. Reunited, Bug and the team encountered the [[Man-Thing]], while Baron Karza used the Pit to enter Earth. The Baron aspired to conquer Earth, but was repelled by the power of [[Captain Universe]], wielded by Ray Coffin. \n\nBack home in the Microverse via the Pit, Bug traveled to Spartak. When Baron Karza's fleet attacked, Bug made a daring move causing an explosion launched Bug into hyperspace, where he crash landed on his home planet. Feared dead, Bug survived and discovered his old gang had been corrupted by his father, Wartstaff. Reunited with his lover, Jasmine, they ejected Wartstaff and launched a surprise attack against the colonial governor at the Central Nest. Bug was victorious, but his father was shot down. Unbeknownst to Bug, Rann had become one with the Enigma Force (the power behind the Microverse) and defeated Baron Karza. Bug and Jasmine returned to Homeworld for the victory celebration.\n\n[[image:Bug-mutated.jpg|left|thumb|mutated by Odd John]]Bug and the team left for new adventures, teaming with the [[Fantastic Four]] against the emotional assault of [[Psycho-Man]]. During the battle, a reptilian alien killed Jasmine, devastating Bug. They fled to Earth again, where Bug was captured by a man called Odd John, who mutated Bug into a savage creature and planned an insect invasion of Earth. Bug was restored thanks to [[Ant-Man (Scott Lang)]]. Alongside his team, Bug later faced the evil computer Computrex, [[Mentallo]], the [[Fixer]], and the Toymaster (revealed to be Prof. Prometheus). Back on Homeworld, Mari's brother, Prince Argon (Force Commander) betrayed his love, Slug, under Baron Karza's mentally implanted orders. Utilizing Argon's body, Baron Karza was reborn. With [[Fury, Nick|Nick Fury]] and [[S.H.I.E.L.D.]], Bug and his team defended Earth from Baron Karza and [[Hydra|Hydra's]] forces. Bug rescued an artifical Spartakian warrior named Dagon, who betrayed them, destroying Rann's roboid. Extracting the knowledge of the Enigma Force from Rann, Baron Karza eradicated the manifestations of the Enigma Force. Kaliklak's queen, Esmera, sacrificed herself using her stinger upon Baron Karza while Acroyear utilized Spartak's Worldmind again. The Baron was defeated, but Rann was left in mind-shock, while Spartak was in ruins. Bug learned that in order to save Rann, revive the Enigma Force and repair the Spacewall, they needed to retrieve three keys of the Microverse. Aided by the roboid Nanotron and the Prince of Sandzone, Bug and the team located two keys in Homeworld's lands of Oceania and Polaria, while Acroyear discovered the third on Tropica (adding Devil and Fireflyte to the team in the process). In Aegypta, Argon again became a tyrant like Baron Karza and captured Bug and his team, seeking the keys to augment his power. The team escaped and used the keys to restore the Enigma Force to Rann, who, with [[Doctor Strange|Dr. Strange]], then unified the Spacewall before the Microverse collided with the Earth and the Macroverse. \n\nBug and the Micronauts traveled again to Earth, pursued by Argon's mercenaries. The evil Dr. Nemesis shrank Bug, Marionette and Acroyear back to the Microverse, where they aided the rebellion against Argon. The Baron physically emerged from the husk of Argon, where he had been incubating. Rann returned to Homeworld, but was powerless to defeat Baron Karza; the team fled in Rann's new ship, the Bioship, now joined by [[Huntarr]], a living weapon. The Baron began a wave of genocide against all his enemies. While Rann meditated with Fireflyte to convince the manifestations of the Enigma Force to aid them, Bug journeyed to Prisonworld seeking allies. Frustrated by Rann's seclusion while seeking transcendence, his lover Mari began a brief affair with Bug. The team ventured to Kaliklak for help, where the planet was under attack by battle-beetles. With Jasmine's sister, Treefern, Bug ushered in the hatching of a new queen, Lyca. Though indebted, Kaliklak could offer no aid, a war against the beetles being their first priority. Bug and his team joined forces with the [[X-Men]] to aid Baron Karza against the Entity, an evil psychic manifestation of Professor X threatening the Microverse; Baron Karza eventually lost his arsenals and his armies to the Entity. On Homeworld, Baron Karza executed all save those he transformed into monstrous Unmen in the Body Banks. When he faced the Enigma Force, Baron Karza chose mortality over power and immortality, since the latter would strip him of his desire for conquest. Thus, he was unable to withstand the combined might of the heroic team's final assault upon him.\n\nWith Baron Karza slain and Homeworld in ruins, the team set out upon new voyages of peace into the Microverse. On the Endeavor II, with reconstructed versions of their roboids, Bug, Rann, Acroyear, Huntarr and Mari sought rest on the planet Fiame. A warpdrive malfunction sent them far beyond the known portion of the Microverse, where they discovered a Child of the Makers, a huge alien lifeform which mutated Huntarr further. Using an egg from the Child to power the ship, they encountered a friendly intelligent race called the Children of the Dreaming Star. Mari reunited with Rann, leaving Bug despondent until he met the alien shapeshifter Solitaire, who assumed a pleasing form as an Insectivorid Marionette. The two fell in love but, feeling out of place, they left for Kaliklak. However, after imagining a series of assaults on his allies, Bug flew back to them. The team discovered they were dying of radiation poisoning released by the Child of the Makers, but the alien egg hatched a creature that mutated Huntarr so he could rebuild his friends' bodies. When Devil, Homeworld's sole survivor, became distorted while trying to transport across the Microverse, the team decided to return to Homeworld. They learned Baron Karza's slaughter of Homeworld tore a wound into the planet's sentient Worldmind, causing it to go mad, spreading its pain across the Microverse and corrupting the Enigma Force. While Rann retired for a contemplative life, the egg's hatchling evolved into a being called Scion who aided the team's return to Homeworld. Bug and the other Micronauts ultimately sacrificed themselves, their bodies and spirits re-seeding Homeworld with life and ending the pain of the maddened Worldmind, though he was saddened that Solitaire had refused to join him. \n\nHowever, this was not the end of Bug. A reborn Baron joined the mad titan [[Thanos]] in a plot to destroy all \"subatomic\" realms. Restored in the process, Bug, Rann, and Mari teamed with Earth's X-Men against the villains, and in the ensuing struggle all \"sub-atomic\" realms were merged into a single reality. Soon after, Bug, Rann, and Mari helped Earth's [[Cable]], [[Domino]], and [[Kane, Garrison|Garrison Kane]] rescue [[Copycat]] from Psycho-Man. Joined by Dexam, a cybernetic victim of the Body Banks, Bug opposed Baron Zebek - a new tyrant from Aegyptus patterning himself after Baron Karza - in Tropica's city Antica. Baron Zebek was defeated with the aid of [[Alpha Flight]], having arrived from Earth via the Prometheus Pit. Following the Negative Zone's [[Annihilus]] in jaunts through Earth space and time, Bug witnessed many key moments in the early years of the Heroic Age. Calling themselves the Microns, Bug, Rann, and Mari also helped [[Photon_(Genis-Vell)|Captain Marvel (Genis-Vell)]] search for [[Drax]] in the Microverse. They discovered Dexam had betrayed them to Visalia of K'ai, and later fought Psycho-Man and Captain Marvel's evil twin, the alternate future clone Fredd. \n\nNote: Bug’s speech is interspersed with a \"tik\" sound due to an Insectivorid’s chitinous membrane in the throat. Bug has an aversion to water.",
        "categories": [
            "Cosmic"
        ]
    }
}