{
    "id": 1011311,
    "name": "Ultimo",
    "description": "Ultimo was a robotic construct that was developed several thousand years ago on an unknown world, which the Mandarin eventually discovered and claimed as his own creation.",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/5/50/4c002e5d2432b",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011311",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011311/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011311/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011311/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011311/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011311/ultimo?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Ultimo?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "blurb": "Robot killer from the stars!",
        "real_name": "unknown",
        "aliases": "The Doomsday Machine, The Devastator, He-Who-Destroys",
        "identity": "",
        "occupation": "destroyer of worlds",
        "citizenship": "",
        "place_of_birth": "unknown planet outside solar system",
        "relatives": "",
        "groups": "",
        "education": "",
        "height": "(when disassembled) 100 ft.",
        "weight": "undetermined",
        "eyes": "yellow",
        "hair": "none",
        "powers": "enormous strength (approx. class 100); virtually unlimited endurance and durability",
        "abilities": "",
        "weapons": "disintegration beams fired from eyes",
        "paraphernalia": "",
        "debut": "(shadow only) Tales of Suspense #76 (1966); (fully seen) Tales of Suspense #77 (1966)",
        "origin": "(in part) Iron Man #24 (2000)",
        "significant_issues": "buried under a volcano (Tales of Suspense #78, 1966); Thor drove Ultimo back into volcano after brief battle (Avengers Annual #1, 1967); re-emerged under the Mandarin’s control, used against Iron Man and the Yellow Claw (Iron Man #69-#71, 1974); sent by Russian sub (in conjunction with the Mandarin) to Washington DC, buried in lava by Iron Man (Iron Man #95-#96, 1977); re-emerged again at Mt. Acheron (Iron Man #298, 1993); destroys remote-controlled Iron Man severely injuring Tony Stark (Iron Man #299, 1993); battled Iron Legion, defeated by Iron Man (Iron Man #300, 1994); reappeared as inert power source for Stark-Fujikawa, became reactivated (Iron Man #23, 1999); defeated by Iron Man, disassembled by SHIELD (Iron Man #25, 2000)",
        "main_image": "Ultimo.jpg",
        "bio_text": "Ultimo was a robotic construct which was developed several thousand years ago on an unknown world. At some point in the past (probably in the early-mid 19th century) Ultimo attacked the planet Rajak and wiped it clean of life. A group of surviving Rajaki were off-planet during the attack, and hunted Ultimo down for what he had done. However, the giant robot proved too powerful for the Rajaki, and it was Ultimo who ended up pursuing ''them.'' The Rajaki led Ultimo into a meteor shower near Earth; the meteors knocked both Ultimo and the Rajaki ship to Earth. Ultimo crashed in China, and the Rajaki ship in what would become Washington State.",
        "bio": "Ultimo was a robotic construct which was developed several thousand years ago on an unknown world. At some point in the past (probably in the early-mid 19th century) Ultimo attacked the planet Rajak and wiped it clean of life. A group of surviving Rajaki were off-planet during the attack, and hunted Ultimo down for what he had done. However, the giant robot proved too powerful for the Rajaki, and it was Ultimo who ended up pursuing ''them.'' The Rajaki led Ultimo into a meteor shower near Earth; the meteors knocked both Ultimo and the Rajaki ship to Earth. Ultimo crashed in China, and the Rajaki ship in what would become Washington State.\n\nThe [[Mandarin]] eventually discovered Ultimo and altered his programming to suit his needs. He claimed that Ultimo was his own creation; the only thing, however, that the Mandarin actually created (besides the different programming) was an artificial blue skin for the robot. Mandarin utilized Ultimo numerous times against [[Iron Man (Anthony Stark)|Iron Man]], including once in the nation’s capitol, Washington D.C. During that battle, Iron Man trapped Ultimo beneath the Earth’s crust. As a result, the robot meandered through the planet’s magma absorbing an enormous amount of energy. Years later, while Iron Man was in battle with a rock-like creature dubbed the Earth Mover near Mt. Acheron in California, Ultimo re-emerged ''sans'' his blue skin, significantly taller and much more powerful. He vaporized the Earth Mover and destroyed a remote unit Iron Man, and then went about destroying anything in his path.\n\n[[Rhodes, James|Jim Rhodes]] cobbled together several of Tony Stark’s closest confidantes to wear old suits of Iron Man armor in order to meet the Ultimo threat. This group was dubbed “The Iron Legion” and proved successful only in slowing down the behemoth robot. It took Tony Stark in a new suit of Iron Man armor to figure out how to stop it; he planted a device on Ultimo’s back which caused lightning to strike it, thereby shutting down all of its systems. \n\nUltimo remained in the possession of [[Stark Enterprises]], and then eventually the new [[Stark-Fujikawa]]. Tony Stark was not part of the latter company and hence had no say (nor knowledge) of that company’s plan to use Ultimo as a floating power source. He was quite dismayed when he discovered what had become of the dangerous robot. However, his protests were met with deaf ears by his cousin [[Stark, Morgan|Morgan Stark]], now part of Stark-Fujikawa. Sometime later, two entities known as Sapper and Golden-Blade attacked the Stark-Fujikawa craft which laid atop Ultimo, attempting to siphon energy from it. Their attack unknowingly reactivated Ultimo, even as Sapper – who turned out to be the sole-surviving Rajaki – realized what the Stark-Fujikawa ship really was. \n\nOnce awakened, Ultimo probed Sapper’s mind, learned who he was, and then continued to pursue that which he originally did before he crashed to Earth – the Rajaki starship. The major problem was that the city of Spokane, Washington laid right in Ultimo’s path. Eventually, Iron Man placed a systems tap on Ultimo which permitted him to access the robot’s internal programming. He ordered Ultimo to stop and shut down, and after a few unsuccessful tries, Ultimo finally ceased his advance and deactivated. SHIELD arrived and began to disassemble the giant android.",
        "categories": [
            "Villains",
            "Deceased"
        ]
    }
}