{
    "id": 1011082,
    "name": "Elixir",
    "description": "",
    "modified": "2013-11-01T16:26:56-0400",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/5/d0/52740e1b4ad81",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011082",
    "comics": {
        "available": 6,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011082/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/23971",
                "name": "Cable (2008) #13"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/23972",
                "name": "Cable (2008) #13 (OLIVETTI (MW, 50/50 COVER))"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/24171",
                "name": "Cable (2008) #14"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/24172",
                "name": "Cable (2008) #14 (OLIVETTI (MW, 50/50 COVER))"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/4071",
                "name": "New X-Men (2004) #25"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/4767",
                "name": "New X-Men: Childhood's End Vol. 2 (Trade Paperback)"
            }
        ],
        "returned": 6
    },
    "series": {
        "available": 3,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011082/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/4002",
                "name": "Cable (2008 - 2010)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/749",
                "name": "New X-Men (2004 - 2008)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1667",
                "name": "New X-Men: Childhood's End Vol. 2 (2006)"
            }
        ],
        "returned": 3
    },
    "stories": {
        "available": 5,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011082/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/3405",
                "name": "2 of 4 - Crusade",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/53172",
                "name": "Cable (2008) #13 - Int",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/53174",
                "name": "Cable (2008) #13, 50/50 Variant - Int",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/53567",
                "name": "Cable (2008) #14 - Int",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/53569",
                "name": "Cable (2008) #14, 50/50 Variant - Int",
                "type": "interiorStory"
            }
        ],
        "returned": 5
    },
    "events": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011082/events",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/events/298",
                "name": "Messiah War"
            }
        ],
        "returned": 1
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011082/elixir?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Elixir?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Joshua \"Josh\" Foley",
        "identity": "Secret",
        "occupation": "Adventurer,Student",
        "place_of_birth": "Flushing, Queens, New York",
        "groups": "Formerly [[X-Force]], [[New X-Men]], [[New Mutants]] Squad, [[Xavier Institute]] Student Body",
        "citizenship": "U.S.A",
        "education": "Currently in high school level courses",
        "aliases": "None",
        "relatives": "Howard Foley (father), Grace Foley (mother), two unidentified older brothers, Danielle Moonstar (legal guardian)",
        "height": "5'9\"",
        "weight": "157 lbs.",
        "eyes": "Blue",
        "hair": "Blond",
        "powers": "Elixir is an Omega-Level Mutant, able to control organic matter on a genetic level; so far he has only demonstrated the ability to heal including eyesite and restoring a heart from nothing, restore suppressed mutations, cause temporary (yet painful) defects, alter his color, and kill.",
        "debut": "New Mutants #5 (2003)",
        "origin": "",
        "significant_issues": "",
        "main_image": "Elixir442.jpg",
        "bio_text": "Joshua Foley is an omega-class mutant whose abilities have yet to reach their full potential.  Formerly a member of the mutant-hating Reavers, Foley was recruited as a student for the Xavier Institute by teacher Danielle Moonstar.  His parents disowned him soon after, leading Moonstar to become his legal guardian.With nowhere else to go, Josh reluctantly went to the X-Mansion, being roomed with Prodigy - a situation that neither of them initially found appealing.  Josh sent a letter home which only caused his parents to make their disowning of him formal, handing his legal guardianship to the school (specifically, Moonstar).  Initially, Josh became friends with the group who would later become the Hellions squad, particularly Hellion, but after finding out about Josh's history with the Reavers, they rejected him too, and the [[New Mutants]] intervened to save him.  After this, he (reluctantly at first) started hanging around with them.",
        "bio": "Joshua Foley is an omega-class mutant whose abilities have yet to reach their full potential.  Formerly a member of the mutant-hating Reavers, Foley was recruited as a student for the Xavier Institute by teacher Danielle Moonstar.  His parents disowned him soon after, leading Moonstar to become his legal guardian.With nowhere else to go, Josh reluctantly went to the X-Mansion, being roomed with Prodigy - a situation that neither of them initially found appealing.  Josh sent a letter home which only caused his parents to make their disowning of him formal, handing his legal guardianship to the school (specifically, Moonstar).  Initially, Josh became friends with the group who would later become the Hellions squad, particularly Hellion, but after finding out about Josh's history with the Reavers, they rejected him too, and the [[New Mutants]] intervened to save him.  After this, he (reluctantly at first) started hanging around with them.\n\n\nShortly after this, a depowered [[Wolfsbane]] (Rahne Sinclair) visited the mansion.  Having only heard about her timid early days, Josh was instantly smitten by the new \"wild child\" Rahne (much to Laurie's dismay, just as she was plucking up the courage to ask him out).  After Rahne was rejected for a teaching post due to immaturity, Josh sneaked out of the X-Mansion at night to a bar where she was playing pool. Over the course of a conversation, he rationalized that her new attitude was a way of letting out instincts she had previously been able to blame on \"the wolf.\" Eventually, as they were returning to the mansion, she realized that she did want \"the wolf\" back, contrary to her previous declarations. As they kissed, he healed away the effects of the weapon that had depowered her - but she lost control as this happened, slashing him open and howling to the moon.[[Wallflower]] (Laurie Collins, looking for Josh, came across this scene and (for the first time) managed to control her power to scare Rahne away. But she couldn't return the favor from before to heal the mortally-wounded Josh (who didn't automatically heal because he needs to do it consciously).\n\n\nAs he was rushed to the mansion's infirmary, [[Beast]] (in response to the question of how he reversed Wolfsbane's depowering) revealed the full potential of Josh's power for the first time - he could manipulate all the body's functions on a genetic level. The fact that Josh only healed was simply a result of his inexperience. They put him on an I.V. drip, but with Archangel, the mansion's other healer, not present, there was little hope. Prodigy, however, realised that he could heal himself if only he was awake: and [[Surge]] said she could wake him up with a small jolt. Reluctantly, Beast went along with this, disconnecting his drip. Surge woke him up, and Laurie kept him calm long enough to for him to heal his wounds. There was one side-effect though which shocked him - for one reason or another, he had turned his skin and hair to a reflective gold (Dani Moonstar speculated it was because he wanted to be the \"golden boy\" - and injured as he was, he didn't have full control over this instinct). \n\n\nSince the mansion's destruction and rebuilding under [[Cyclops (Scott Summers)|Cyclops]] and [[Emma Frost]], the student body has been organized into six-member squads - although for Josh, this simply meant a formalizing of the New Mutants group. When Rahne was finally accepted onto the teaching staff after this, she tried to break off her relationship with him (he even went out on a date with Laurie during this period). Despite Josh's argument that there is less than three years of an age gap, Rahne pointed out that she was a teacher now, and she shouldn't be dating a student. This didn't last, however, and they attempted to keep it secret, until Rahne saw him on a date with Laurie, and broke the relationship off for good, feeling it would be healthier for him to date another student. While he was depressed in the immediate aftermath, however, Josh eventually realized that it was for the best and pursued a relationship with Laurie - until Wither, who had seen Rahne and Josh's breakup, announced it in his jealousy to break Josh and Laurie up. He succeeded, and Rahne resigned from her job and left the school as a result.As a result, the rest of the team - bar Surge - ostracized him for some time, with his roommate David (Prodigy) particularly harsh towards him. In addition, he lost it while dancing with [[Magma (Amara Aquilla)|Magma]] at the school dance after seeing David and Laurie kiss - unbeknownst to him, as a result of Laurie using her powers to make David kiss her with the aim of making Josh jealous - ranting at the two of them before storming out.\n\n\nConstantly craving the admiration and recognition of his fellow students, Foley, now a member of the Institute's New Mutants squad, is prone to egotistic and inconsiderate actions, which, contrary to his intentions, tend to result in disapproval and resentment. His not yet fully realized healing abilities are a variable which should not be underestimated.\n\nAfter M-day, Josh tried to heal [[Wallflower]] when her arm was accidentally dessicated by Wither, and then made the grade as a New X-Man. However, he failed to fix Laurie's arm, nor could he save any of the ex-mutant students when their bus was bombed by Stryker's men. Josh went into severe depression and lashed out at everyone, even slamming Colossus in the head after a Danger Room workout. Then, Josh saw Wallflower's assassination at the hands of a Purifier sniper and he snapped. At this point he was able to reverse his power and induce boils or blisters on [[Wolverine (James Howlett)|Wolverine]] when the X-Man tried to hold him back. When Wlliam Stryker began his assault on the mansion josh was sitting in the infirmary motionless and depressed, when he finally came to his scences he became enraged over the death of laurie, he left the infirmary  and proceeded to kill stryker causing his skin to turn from gold to black and him falling into a catonic state.\n\nWhen [[X-23]] was mortaly wounded during the New [[X-men]]'s  battle with [[Nimrod]], [[Hellion]] rushed her to the mansion to be healed by Josh, though very reluctant Josh healed her, reverting his skin to its gold color except for a few black spots.  At the memorial for the students killed in the bus crash by Stryker, Josh announced his plan to learn how to fully control his powers.  Josh had asked [[Beast]] to teach him all he knew about the human annatomy, but because he thought it would take too long he decided to ask for help from the [[Stepford Cuckoos]].  The Stepford Cuckoos preformed a type of brain drain while Beast was sleeping one night transfering all the knowledege Beast knew about the human body into Josh. After the brain drain was preformed Elixir, along with the other students of the mansion, were transfered down into [[limbo]] by the demon [[Belasco]].",
        "categories": [
            "Heroes",
            "X-Men",
            "Mutants"
        ]
    }
}