{
    "id": 1011016,
    "name": "Darwin",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/2/60/4c003269b12a4",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011016",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011016/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011016/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011016/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011016/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011016/darwin?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Darwin?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Armondo Munoz",
        "identity": "Secret",
        "occupation": "Adventurer; former student",
        "place_of_birth": "New York City, New York",
        "groups": "[[X-Factor Investigations]]; formerly [[X-Men]]",
        "citizenship": "U.S.A.",
        "education": "Muir-MacTaggert Research & Development Institute, New York; Biltmore Academy for Advanced Education, New York; unidentified middle school",
        "aliases": "The Evolving Boy",
        "relatives": "None known",
        "height": "6'4\"",
        "weight": "150 lbs",
        "eyes": "(originally) Brown; (currently) White (no visible iris)",
        "hair": "None",
        "powers": "Darwin's mutation is in a state of continual reaction, adapting to whatever his current situation demands.  For example, if placed in total darkness his eyes automatically adapt to allow him to see; if underwater he grows functioning gills; if exposed to fire his body becomes fireproof; if falling, his bones soften and his body elasticizes to cushion his landing; or if exposed to the void of space, he stops requiring oxygen and the density of his skin and internal structure increase.  His mutation's adaptivity seems limitless; however, he lacks conscious control, and his adaptations are purely instinctive.  Thus far, Darwin's mutation has not displayed any capacity for generating energy beyond converting his physical form into same.  It has also afforded him a genius-level intellect, and he has shown the capacity to learn new skills and languages with only limited exposure.",
        "debut": "X-Men: Deadly Genesis #2 (2006)",
        "origin": "X-Men: Deadly Genesis #2 (2006)",
        "significant_issues": "",
        "main_image": "Darwin442.jpg",
        "bio_text": "Born a strange looking mutant, Armando Munoz was left alone with his mother at age 4 after his father rejected him and left.  His mother resented Armando for his father's selfishness and Armando resolved to make her happy again.  Four years later, testing revealed his genius-level intelligence and private academies offered to fund continuing education; which of course pleased his mother, albeit not for reasons Arando would hope for.  His mother gladly enrolled him in the Biltmore Academy boarding school, where he was bullied relentlessly for years due to his appearance until, at age 15, his latent mutant ability manifested and he fought back, subconsciously hardening his hands and beating the bullies unconscious.  Later, during a visit home, he saved his mother's life after her smoking caused a fire.  The senior scientist at Biltmore tested Armando and published a paper about his ability that 'outed' him as a mutant and dubbed him \"Darwin, the Evolving Boy.\"",
        "bio": "Born a strange looking mutant, Armando Munoz was left alone with his mother at age 4 after his father rejected him and left.  His mother resented Armando for his father's selfishness and Armando resolved to make her happy again.  Four years later, testing revealed his genius-level intelligence and private academies offered to fund continuing education; which of course pleased his mother, albeit not for reasons Arando would hope for.  His mother gladly enrolled him in the Biltmore Academy boarding school, where he was bullied relentlessly for years due to his appearance until, at age 15, his latent mutant ability manifested and he fought back, subconsciously hardening his hands and beating the bullies unconscious.  Later, during a visit home, he saved his mother's life after her smoking caused a fire.  The senior scientist at Biltmore tested Armando and published a paper about his ability that 'outed' him as a mutant and dubbed him \"Darwin, the Evolving Boy.\"  \n\nRejected by his mother, Armando attempted suicide, but his mutation saved him.  The resident psychiatrist recommended Armando to renowned geneticist [[MacTaggert, Moira|Moira MacTaggert]], who took him in and began training him in the use of his powers.  He and MacTaggert's other young students were later recruited by Moira's colleague [[Professor X|Professor Charles Xavier]] to join his [[X-Men]] and rescue the team's original members from the living island [[Krakoa]].  The monster killed three of Darwin's teammates, but not before they sent him and [[Vulcan (Gabriel Summers)|Kid Vulcan]] to safety deep underground.  After the X-Men hurled Krakoa into space, unaware of the two survivors, Darwin instinctively converted himself into pure energy and bonded with Kid Vulcan, trying to keep them both alive.  \n\nYears later, the reality-altering \"[[House of M|M-Day]]\" event revived Kid Vulcan.  Darwin's consciousness also reawakened inside Vulcan, but he was helpless to prevent Vulcan's vengeful attacks on the X-Men.  Telepathically liberated by [[Marvel Girl (Rachel Summers)|Rachel Summers]], during the conflict, Darwin regained physical form as his mutation quickly rebuilt his body.  After recuperating at Xavier's Institute, Darwin agreed to help Xavier locate Vulcan, who had left Earth bound for the interstellar [[Shi'ar|Shi'ar Empire]] of his birth.  \n\nRejoining the X-Men, Darwin helped commandeer a Shi'ar ship and they set off in pursuit of Vulcan.  Only to be ambushed by [[Warskrulls]]. Darwin witnessed Xavier's kidnapping and secretly hitched a ride on the kidnapper's shuttle, which arrived at the Shi'ar High Council's Starways.  Attempting to rescue Xavier, Darwin was captured and imprisoned after seeing former Shi'ar Majestor [[Neramani, D'Ken|D'Ken]] reclaim the throne.  Confronted by Vulcan, Darwin learned of his plans to marry D'ken's sister [[Deathbird]] and to execute Xavier on their wedding day.  At the ceremony at the site of the [[M'kraan Crystal]] dimensional nexus, Darwin witnessed an assault on the ceremony by the X-Men and their allies, deposed Shi'ar Majestrix [[Neramani, Lilandra|Lilandra]] and interstellar pirates, known as the [[Starjammers]].  \n\nWhen Vulcan threw Xavier into the Crystal, Darwin dove in after him, protected from the Crystal's mind-shattering effects by his mutation.  Darwin rescued Xavier and retreated with him to the X-Men's ship, unaware that Lilandra had pre-programmed it to return them to Earth to ensure Xavier's safety.  \n\nLater, when the [[Hulk (Bruce Banner)|Hulk]] sought to kidnap Xavier, Darwin opposed him alongside the X-Men, the [[New X-Men]] and [[X-Factor Investigations]].  Darwin's power reacted by absorbing the gamma energy from the Hulk; however, Darwin was forced to leave the battle when his power instinctively teleported him away in response to Hulk's savage assault.",
        "categories": [
            "Heroes",
            "Mutants",
            "X-Men"
        ]
    }
}