{
    "id": 1011200,
    "name": "Luminals",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/8/b0/4c002f1f80d5c",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011200",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011200/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011200/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011200/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011200/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011200/luminals?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Luminals?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "base_of_operations": "Xarth Three; [[Knowhere]]",
        "debut": "Nova #8 (2008)",
        "origin": "Unrevealed",
        "significant_issues": "Battled Nova in a case of mistaken identity, transformed into zombies, but eventually destroyed (Nova #8-9, 2008); Dispatched to take out an A.W.O.L. Drax, but it was the Luminals that were defeated (Guardians of the Galaxy #5, 2008); Opposed the Guardians of the Galaxy during the Skrulls invasion of Knowhere (Guardians of the Galaxy #4-6, 2008); Fought with the Guardians of the Galaxy against the Universal Church of Truth (Guardians of the Galaxy #21, 2010)",
        "current_members": "[[Brightstorm]], [[Cynosure (female)|Cynosure]] (Lena Sendak), [[Drone]], [[Impact]], [[Jarhead]], [[Korda]], [[Toxin (Luminal)|Toxin]], other unidentified members",
        "former_members": "[[Crater]], [[Cynosure (zombie)|Cynosure]] (Sean Sendak), [[Discharge]], [[Faze]], [[Massdriver]], [[Mendez]], [[Suspensor]], several unidentified members",
        "other_members": "several unidentified members",
        "main_image": "Luminals_3.jpg",
        "bio_text": "[[image: Luminals_before.jpg|left|300px|thumb|Luminals before they were transformed by Abyss]]In a desperate attempt to rid themselves of their nemesis, [[Abyss (alien)|Abyss]], the members of the cosmic group known as the Luminals traveled to the edge of the universe to a place called [[Knowhere]] hoping to throw his imprisoned body out of existence forever. The Luminals are the global protectors of the planet Xarth Three, and are the equivalent of Earth's [[Avengers]].",
        "bio": "[[image: Luminals_before.jpg|left|300px|thumb|Luminals before they were transformed by Abyss]]In a desperate attempt to rid themselves of their nemesis, [[Abyss (alien)|Abyss]], the members of the cosmic group known as the Luminals traveled to the edge of the universe to a place called [[Knowhere]] hoping to throw his imprisoned body out of existence forever. The Luminals are the global protectors of the planet Xarth Three, and are the equivalent of Earth's [[Avengers]].\n\n\nUnfortunately for all the inhabitants of Knowhere, Abyss had other plans and started a killing spree from inside his prison, turning the citizens into [[Glossary:Z#zombie|zombies]]. [[Nova (Richard Rider)|Nova]] unintentionally stumbled upon Knowhere as he was trying to escape a [[Phalanx (species)|Phalanx]] converted [[Gamora]] and [[Drax]], and met up with a frightened woman [[Worldmind]] identified as the Luminal, [[Suspensor]]. Nova attempted to calm her when she was attacked by unknown forces and transformed into a zombie right before Nova’s eyes. [[image: Luminals.jpg|right|200px|thumb|Luminals after they were transformed by Abyss]]She attacked, and Nova defended himself which led to Suspensor's accidental death. [[Cynosure (zombie)|Cynosure]] (Sean Sendak), [[Crater]] and [[Discharge]] arrived on the scene too little too late and believed that Nova murdered their teammate. Unable to protect himself against the three most powerful Luminals, Nova had to escape. The Luminals returned to the coffin-like prison in which Abyss was contained and informed him that they were going to end his life once and for all. Abyss, threatened with extinction, attacked the rest of the Luminals just as he attacked Suspensor, and the entire team was now part of his zombie army. Soon after, the Luminals along with other converted individuals attacked Nova and his new ally, [[Cosmo (dog)|Cosmo]]. Nova finally sealed Abyss in his prison once again, and the Luminals along with the rest of the zombies dissipated into nothing. \n\nNot long after the team calling themselves the [[Guardians of the Galaxy]] took Knowhere as their base of operations, a new [[Cynosure (female)|Cynosure]] (Lena Sendak) emerged along with a new team of Luminals. Cynosure was not only the new leader of Xarth Three's protectors, but she was also serving as the Council Deputy for one of the delegates on Knowhere. During the [[Secret Invasion|Skrull infiltration]] that destroyed the Continuum Cortex, Cynosure sent her team after the missing [[Drax]], when it was suspected he could be a [[Skrulls|Skrull]].  Three of her finest, [[Massdriver]], [[Impact]] and [[Brightstorm]], were left defeated and in intensive care following a furious battle with the Destroyer. Nine more members of the Luminals followed suit. After a fight between Cosmo and some of the Guardians of the Galaxy, Cynosure and the Luminals found the Skrulls seemingly under the protection of Cosmo and the Guardians and engaged them in combat. However, Cosmo, after watching a Skrull nearly sacrifice himself to protect him, unleashed a massive telekinetic blast that disabled both the Guardians of the Galaxy and the Luminals. \n\nThe Luminals remained at odds with the Guardians even when they should have been working together – as in the exploration of the tear in the universe dubbed [[The Fault]]. Cynosure, determined to show the Luminals needed no assistance, sent a small group into the fissure which resulted in dire consequences. An alien entity attached itself to Massdriver, and upon her return to Knowhere, she mercilessly attacked the newest Guardian member, [[Moondragon]]. The alien burst forth from Massdriver's head, killing her in the process, and sought out another host body. Moondragon willingly allowed the entity to inhabit her form in order to save Cynosure from being killed. The Luminals wanted the beast to stand trial for killing one of their own, and against the wishes of Guardian leader, [[Star-Lord (Peter Quill)|Star-Lord]], Cynosure shackled herself to Moondragon to force her to the trial. However, the [[Universal Church of Truth]] wanted the alien for themselves and kidnapped both females, taking them far from Knowhere. The Luminals had no choice but to work with Guardians to save their teammates and called in every active, reserve, honorary and retired member to attack the Church. With the battle won, and both women safe and secure on Knowhere once more, Cynosure had a newfound respect for the Guardians and made a unified front against counsel delegates when they wanted to throw the Guardians off Knowhere.",
        "categories": [
            " Cosmic",
            "Heroes"
        ]
    }
}