{
    "id": 1011204,
    "name": "Mindworm",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/d0/4c002f18eabe7",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011204",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011204/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011204/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011204/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011204/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011204/mindworm?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Mindworm?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "William Turner",
        "identity": "Publicly known",
        "occupation": "None",
        "place_of_birth": "New York",
        "groups": "None",
        "citizenship": "U.S.A. with a criminal record",
        "education": "High-school equivalent from orphanage",
        "aliases": "None",
        "relatives": "Mother and father (both deceased)",
        "height": "6'1\"",
        "weight": "210 lbs.",
        "eyes": "Brown",
        "hair": "Brown",
        "powers": "Mindworm was a mutant with the ability to leech thoughts and emotions from those around him. This power eventually could drain the victim to death. The Mindworm originally linked to brains to feed and fight off loneliness but he could also read minds, unleash mental force waves and illusions, inflict brain damage, invade dreams, draw people to him and mentally command them.",
        "features": "Oversized cranium, unblinking eyes | debut = Amazing Spider-Man #138 (1974)",
        "creators": "this has not been updated yet",
        "main_image": "Mindworm.jpg",
        "bio_text": "An experimental government lab infected a residential community - causing William Turner to be born a mutant with an enlarged head and sharp, piercing eyes. Young William could sense thoughts and feelings but he was also a psychic parasite who unknowingly drained his mother until she eventually died. His terrified father fled and was killed by a speeding car. Unclear of his role in these tragedies, William nevertheless felt guilt and responsibility. He was sent to an orphanage where a bully routinely beat him until William did something to devastate his attacker's brain. From then on, William worked hard to develop a muscular body as well as honing his powerful brain.",
        "bio": "An experimental government lab infected a residential community - causing William Turner to be born a mutant with an enlarged head and sharp, piercing eyes. Young William could sense thoughts and feelings but he was also a psychic parasite who unknowingly drained his mother until she eventually died. His terrified father fled and was killed by a speeding car. Unclear of his role in these tragedies, William nevertheless felt guilt and responsibility. He was sent to an orphanage where a bully routinely beat him until William did something to devastate his attacker's brain. From then on, William worked hard to develop a muscular body as well as honing his powerful brain.\n\n\nUpon leaving the orphanage, William sought a secluded spot where he could drain emotions from his neighbors without being detected. Now calling himself the Mindworm, William chose an abandoned home in Far Rockaway and leeched nourishment off the community for years - drawing residents, zombie-like, around his home. But [[Spider-Man (Peter Parker)| Peter Parker]]'s visit to [[Flash Thompson]]'s apartment alerted Spider-Man to Mindworm's presence. With Spider-Man resistant to his mental powers, Mindworm resorted to using a crushing bear hug, but his comments about \"hearing\" Spidey's mind prompted the web-slinger to clap his hands over Mindworm's ears, severing his link with his victims. Feeling devastatingly alone, Mindworm was taken into custody by the police.\n\n\nDenied the emotional nourishment of others' minds, Mindworm was hospitalized. Though appearing comatose he actually was working to focus his mental strength to gain revenge on Spider-Man from a distance. Instead, he had a dream that was so psychically potent it drew the sleeping Peter Parker inside it as well. With the wall-crawler's help, Mindworm realized that his feelings stemmed from his guilt over his parents' deaths. Now understanding his anguish, he regained the use of his body and turned his back on his vampiric past. Unfortunately, William slipped into robbery and, caught by Spider-Man, was sent to [[Ravencroft]] and later the [[Cage]], where he was nearly set free by the [[Rhino]]. Out of prison and mentally ill, William took to alcohol and lived on the streets where Spider-Man found him telepathically broadcasting his misery throughout an entire city block. Unsure of how to help, Spider-Man delayed too long while William was murdered by some street thugs.",
        "categories": [
            "Spider-Man",
            "Mutants",
            "Spider-Man Villains",
            "Deceased"
        ]
    }
}