{
    "id": 1011073,
    "name": "Bloodaxe",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/40/image_not_available",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011073",
    "comics": {
        "available": 5,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011073/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/11778",
                "name": "Thor (1966) #450"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/11779",
                "name": "Thor (1966) #451"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/11780",
                "name": "Thor (1966) #452"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/11783",
                "name": "Thor (1966) #455"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/11784",
                "name": "Thor (1966) #456"
            }
        ],
        "returned": 5
    },
    "series": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011073/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2083",
                "name": "Thor (1966 - 1996)"
            }
        ],
        "returned": 1
    },
    "stories": {
        "available": 6,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011073/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/17240",
                "name": "Thor (1966) #450",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/17242",
                "name": "And They Shall Call Thee... Bloodaxe",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/17247",
                "name": "Thor (1966) #451",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/17249",
                "name": "Thor (1966) #452",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/17259",
                "name": "Thor (1966) #455",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/17262",
                "name": "Thor (1966) #456",
                "type": "interiorStory"
            }
        ],
        "returned": 6
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011073/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011073/bloodaxe?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Bloodaxe?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Jackie Lukus",
        "identity": "Known",
        "aliases": "None",
        "occupation": "Architect, former vigilante",
        "place_of_birth": "Unrevealed",
        "groups": "None",
        "citizenship": "U.S.A.",
        "education": "Masters degree in architecture",
        "relatives": "Unrevealed",
        "height": "Unrevealed",
        "weight": "Unrevealed",
        "eyes": "Blue (as Lukus), Red (as Bloodaxe)",
        "hair": "Brown (as Lukus), None (as Bloodaxe)",
        "powers": "None (as Lukus), Superhuman strength , endurance and durability on the same levels of a being as powerful as  [[Thor (Thor Odinson)|Thor]] (as Bloodaxe)",
        "weapons": "Bloodaxe possessed the enchanted axe of [[Executioner (Skurge)|Skurge, the Executioner]] which afforded her all of the mystical powers that the original bearer had at his command",
        "paraphernalia": "Bloodaxe fashioned a costume from the enchanted magic held within the Executioner’s axe",
        "debut": "Jackie Lukus (Thor #409, 1989); Bloodaxe (Thor #450, 1992)",
        "origin": "Thunderstrike #22",
        "significant_issues": "Thor #450-452, Thor #455-456, Thunderstrike #1, Thunderstrike #9, Thunderstrike #11-12, Thunderstrike #17-18, Thunderstrike #22-24",
        "main_image": "Bloodaxe.jpg",
        "bio_text": "",
        "bio": "When Leena Moran, an alias used by the [[Enchantress]] while she was living among mortals on Earth, discovered that her beloved [[Heimdall]] was in trouble in her home of [[Asgard]], she planned on using the enchanted axe of the [[Executioner (Skurge)|Executioner]] to aid him. Without warning, she was attacked in the apartment she shared with Susan Austin by [[Skoll|Skoll, the Wolf god]] who was acting on the orders of his master, [[Karnilla]], and the two disappeared in a flash of light leaving the axe behind. Hearing sounds of a struggle, the being that would soon be known as Bloodaxe was instantly overcome with a feeling of power and bloodlust upon picking up the enchanted weapon. Filled with false thoughts of now being above the law, this murderous vigilante started killing small time thugs and drug dealers despite protests of the local authorities. One such instance brought the mighty Thor and [[Balder|Balder, the Brave]] into the equation, but the supremely powerful Bloodaxe, along with a little help from the corrupt Karnilla, bested the Thunder god on their first meeting.\n\nBloodaxe would soon return for the lure of power was too much too resist, but this next appearance would not go unnoticed. [[Doctor Strange (Stephen Strange)|Doctor Strange]]  sensed the immense mystical power held within the axe and went to investigate the source. To learn more about his origins, Bloodaxe went to the place where he first discovered the axe, the apartment of Susan Austin and Leena Moran, but the astral form of Doctor Strange spooked Bloodaxe and the two fought in front of the frightened woman. The chaos that followed brought the police including their special task force [[Code: Blue]], and the newly formed super team called [[Earth Force]]. The woman was saved and Bloodaxe retreated, but this would not be the last time the axe called out to its new owner.  \n\nThe one true Thor would soon return and Eric Masterson took the name of [[Thunderstrike]], and Bloodaxe would become his greatest enemy. While tracking down the villain known as [[Carjack]], Bloodaxe encountered his old rival, still in the guise of Thor, and claimed yet another victory over him. However, their next meeting did not end in Bloodaxe's favor, and the enchanted weapon that granted the awesome powers the vigilante had grown so accustomed to was lost. Bloodaxe eventually found the axe again at Masterson’s home, and began to stalk Thunderstrike while claiming a few more lives in the process such as the villain [[Whyteout]]. Bloodaxe also spent some time admiring other vigilantes who shared in his brand of justice such as the woman known as [[Sangre]]. The hatred between Bloodaxe and Thunderstrike grew with every meeting, but the Egyptian God of death, [[Seth]], forced a temporary alliance between them. The union was ended when Bloodaxe tried to kill two of Seth’s servants, [[Mongoose]] and [[Quicksand]], and Thunderstrike couldn’t take it anymore. Bloodaxe was separated from the Executioner’s axe during their vicious battle and was kept away from it for a duration of sixty seconds. After that the transformation back to the murderer’s human form occurred, and Eric couldn’t believe whose face was behind the mask. His girlfriend, Jackie Lukus, was Bloodaxe all along. Injured, Lukus was taken away from the scene by Code: Blue, but the Bloodaxe entity had not been beaten yet.\n\nThunderstrike took the axe in hopes of ridding the world of the Death god, but the wickedness that was Bloodaxe grew inside him. It was revealed that the evil of Bloodaxe was the culmination of the original Executioner’s foul deeds stored within his enchanted axe, and it took everything Eric Masterson had to fight and defeat the Bloodaxe entity, but it was at the cost of his own life. Jackie Lukus was eventually released from police custody after they determined she was sane and merely acting under the influence of the axe while she committed her crimes. She visited Eric’s grave and thanked him for all he'd done for her, and she hoped that she could prove herself worthy enough of the second chance he had given her.",
        "categories": [
            "Villains",
            "Women",
            "Magic",
            "Thor"
        ]
    }
}