{
    "id": 1011111,
    "name": "Fantastick Four",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/4/80/4c0030a052a1c",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011111",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011111/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011111/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011111/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011111/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011111/fantastick_four?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Fantastick_Four_%28Earth-311%29?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel 1602 (Earth-311)]]",
        "base_of_operations": "Mobile",
        "debut": "Marvel 1602 #4",
        "significant_issues": "Marvel 1602 #4 (intro)",
        "current_members": "[[Richards, Reed (Earth-311)|Reed Richards]], [[Storm, Susan (Earth-311)|Susan Storm]], [[Storm, Jonathon (Earth-311)|Jonathan Storm]], [[Thing (Earth-311)|Captain Benjamin]]",
        "former_members": "",
        "other_members": "",
        "main_image": "1602_Fantastik.jpg",
        "bio_text": "Ten years before the events of 1602, a man named [[Richards, Reed (Earth-311)|Sir Richard Reed]] traveled aboard a ship called the Fantastic to the New World, searching for knowledge. His old friend,[[Thing (Earth-311)|Captain Benjamin]], piloted the ship. A young man named [[Storm, Jonathon (Earth-311)|Master Storm]], who had killed a man in a duel and had been sent away by the Queen, followed along with Reed and his own sister, [[Storm, Susan (Earth-311)|Susan Storm]], who flew from a man in London Town whom she was betrothed to, but didn’t want to marry. Their ship soon found its way into the Sargasso sea, and there they ran into a curtain of light-a byproduct of the instability of their universe-that changed the four forever, giving them each fantastic powers.",
        "bio": "Ten years before the events of 1602, a man named [[Richards, Reed (Earth-311)|Sir Richard Reed]] traveled aboard a ship called the Fantastic to the New World, searching for knowledge. His old friend,[[Thing (Earth-311)|Captain Benjamin]], piloted the ship. A young man named [[Storm, Jonathon (Earth-311)|Master Storm]], who had killed a man in a duel and had been sent away by the Queen, followed along with Reed and his own sister, [[Storm, Susan (Earth-311)|Susan Storm]], who flew from a man in London Town whom she was betrothed to, but didn’t want to marry. Their ship soon found its way into the Sargasso sea, and there they ran into a curtain of light-a byproduct of the instability of their universe-that changed the four forever, giving them each fantastic powers.\n\nThe four traveled around the world helping people and defending the weak and troubled from forces that would harm them. Though they kept in touch with family and friends over the years, one day they just suddenly disappeared-and were presumed dead. But the four were not dead; they were actually captured by the Latverian ruler, [[Doctor Doom (1602)|Count Otto von Doom]], who imprisoned them in specially made cells around and underneath his castle, Doomstadt. The Captain, with his new strength, was kept in a small hole within solid rock, with only enough room to stand up, but not move his arms. Jonathan Storm was kept underneath a waterfall, to keep his flaming powers from freeing him. His sister was trapped with a glass pillar, within Doom’s own bedroom, to act as a decoration. Finally, Sir Reed was kept in a sealed rock cell, with only a thin grate on the outside, to keep him from using his stretching powers to escape. Doom continued to visit Sir Reed, demanding that he teach him all the knowledge he had gained, and had continued to gain, as well as consulting him when he found new, strange oddities.\n\nOver the years, the Captain raged against his rock prison, often forcing Doom to punish his whole crew in order to stop him from rocking against his stone walls, in an attempt to escape. But one year, Benjamin found a crack, and since they were already without food for a week, he rocked powerfully back and forth, with nothing left to lose. His thrashings freed the imprisoned blind man, known as a [[Daredevil (1602)|devil]], as well as the old man who kept the staff of [[Thor (1602)|Thor]], both from an above-ground cell of the castle. This attempt also freed Susan, whose prison shattered into pieces, in time for her to attack Doom’s consort, [[Black Widow (1602)|Natasha]], seemingly killing her, though she appeared later. After Susan freed her brother, her brother in turn freed Sir Reed, and along with the Captain they exacted their revenge on their captor at the top of his castle, during an attack from [[Professor X (1602)|Carlos Javier]] and his witchbreed group. Doom attempted to use a device he had been given by the old man with the staff, but only succeeded in scarring his face and nearly ending his life when he exposed it to Thor’s lightning.\n\nThe four from the Fantastic soon joined Javier’s group aboard their ship and traveled to the New World, equally concerned about the approaching Apocalypse. Landing at the Roanoke Colony, Reed put his scientific genius to work on the problem of the time rift, eventually coming up with a plan that involved the help of the ex-[[Magneto (1602)|Grand Inquistor Enrique]], lightning from the Thunder God, Thor, and the return of the future [[Captain America (Earth-311)|Captain America]]. The rest of the assembled heroes assisted him, and the rift in the universe was soon healed. But instead of fixing the mistakes and reverting the world to what it used to be, the universe separated from the standard universe, and the four from the Fantastick were left in a pocket universe with personalities and powers that existed long before their time.",
        "categories": [
            "Marvel 1602"
        ]
    }
}