{
    "id": 1011219,
    "name": "The Fury",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/5/c0/4c002f0d934b6",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011219",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011219/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011219/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011219/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011219/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011219/the_fury?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Fury?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "",
        "real_name": "Fury",
        "aliases": "None",
        "identity": "No dual identity",
        "occupation": "Exterminator of super beings",
        "citizenship": "U.K. (Earth-238)",
        "place_of_birth": "U.K. (Earth-238)",
        "relatives": "None",
        "groups": "Formerly used by the Status Crew",
        "education": "None",
        "height": "7’6”",
        "weight": "600 lbs.",
        "eyes": "Gold",
        "hair": "None",
        "powers": "Virtually invincible, the Fury’s main weapon was a powerful blaster; it could develop other specialized weapons as required. Lacking conscious thought, it used cold logic and highly attuned instinct in battle, learning from each encounter so that no attack on it worked twice. It could sense and track targets across dimensions, and developed the ability to travel inter-dimensionally. Its strength, reflexes, running speed and durability were superhuman, and it could rebuild itself using available materials so long as part of it remained intact.",
        "abilities": "",
        "weapons": "",
        "paraphernalia": "",
        "debut": "Marvel Super-Heroes #387 (1982)",
        "origin": "",
        "significant_issues": "",
        "main_image": "Thefury.jpg",
        "bio_text": "Created by the mutant [[Mad Jim Jaspers (Earth-238)|Mad Jim Jaspers]] of Earth-238, the Fury was the ultimate killing machine, an adapting cybiote unleashed on the superhumans of its world, programmed to spare only its creator. It methodically hunted down and slew every other superhuman on the planet. Only one victim escaped its purge; [[Captain UK|Captain U.K.]] (Linda McQuillan) was teleported interdimensionally to Earth-616 by her husband Rick, moments before the Fury murdered him. Frustrated by being unable to kill Jaspers, its mission otherwise completed, the Fury was placed into storage.",
        "bio": "Created by the mutant [[Mad Jim Jaspers (Earth-238)|Mad Jim Jaspers]] of Earth-238, the Fury was the ultimate killing machine, an adapting cybiote unleashed on the superhumans of its world, programmed to spare only its creator. It methodically hunted down and slew every other superhuman on the planet. Only one victim escaped its purge; [[Captain UK|Captain U.K.]] (Linda McQuillan) was teleported interdimensionally to Earth-616 by her husband Rick, moments before the Fury murdered him. Frustrated by being unable to kill Jaspers, its mission otherwise completed, the Fury was placed into storage.\n\nWhen [[Captain Britain (Brian Braddock)|Captain Britain]] of [[Earth-616]] (Brian Braddock) and his companion [[Jackdaw (elf)|Jackdaw]] arrived on Earth-238, the Fury was reactivated. It swiftly slew both of its new targets, though Captain Britain was reconstructed and returned to Earth-616 by [[Merlyn]]. Instinctively aware its job was incomplete, the Fury modified itself to pursue, unbothered by the raging reality warp Jaspers’ mutant powers had precipitated; doggedly single minded, it survived the destruction of its entire reality performed to prevent Jaspers’ warp from spreading to other timelines. Reaching Earth-616, it tracked its prey to Braddock Manor, coming upon the former Captain U.K. in the grounds, and would have slain her, had Merlyn not intervened. Captain Britain and his allies, the cross-dimensional mercenaries the Special Executive, engaged the Fury in battle; after sustaining a number of fatalities, they buried it under several tons of rock while it was temporarily confused by its inability to detect the temporally displaced Zeitgeist.\n\nThe Fury dug its way out and pursued Captain Britain to London, unconcerned by reality once more breaking down due to Earth-616’s version of [[Mad Jim Jaspers (Earth-616)|Jaspers]]. Finding its target fighting 616’s Jaspers, it reasoned this alternate Jaspers was not protected by the programming which had prevented it killing its creator, and attacked him. Having extensively improved itself during its pursuit of Captain Britain, the Fury proved capable of holding its own against Jaspers, finally transported them to the void where its own reality had once been. Lacking material to manipulate, Jaspers reverted to human form, and the Fury swiftly slew him. It returned to Earth-616, severely weakened, and Captain Britain and U.K. took the opportunity to destroy it before it could recover.\n\nThe unfortunate Sidney Crumb subsequently mutated into a monster as a result of a near miss with the Fury when it first arrived on Earth-616, but otherwise the cybiote appeared to be gone for good. However, the [[X-Men]] recently found a version of the Fury in the caverns beneath Braddock Manor, which they later learned had been created by [[Braddock, Jamie|Jamie Braddock]] to test them. It fought the team to a standstill before they managed to send it into a miniature black hole. It (or a Fury dimensional counterpart from another reality in the multiverse) briefly managed to return to Earth-616, but was sent back into the interdimensional void through the combined efforts of Earth-9411's Captain Britain and Spider-Man.\n\nMad Jim Jaspers has also returned, seemingly brought back to life by the [[Scarlet Witch (Wanda Maximoff)|Scarlet Witch’s]] recent reality warp and manifesting some of the Fury’s physical traits.",
        "categories": [
            "Villains"
        ]
    }
}