{
    "id": 1011310,
    "name": "Justin Hammer",
    "description": "",
    "modified": "2010-11-08T15:51:15-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/e/e0/4ce18ab1be1f6",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011310",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011310/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011310/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011310/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011310/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011310/justin_hammer?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Hammer,_Justin?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Justin Hammer",
        "identity": "No dual identity",
        "occupation": "Industrialist, criminal financier",
        "place_of_birth": "Surrey, England",
        "groups": "Notable agents include, but are not limited to: [[Blizzard (Donald Gill)]], [[El Toro Negro]], [[Force]], [[Spymaster (Number One)|Spymaster]], and [[Whiplash (Mark Scarlotti)|Whiplash]]",
        "citizenship": "Citizen of Monaco",
        "education": "Degree in commerce and business",
        "aliases": "None",
        "relatives": "Justine Hammer ([[Crimson Cowl (Justine Hammer)|Crimson Cowl]], daughter)",
        "height": "6’",
        "weight": "170 lbs.",
        "eyes": "Blue",
        "hair": "Gray",
        "abilities": "Justin Hammer seldom engaged in direct combat, instead employing varieties of special agents or devices.",
        "weapons": "None",
        "paraphernalia": "None",
        "powers": "None",
        "debut": "Iron Man #120 (1979)",
        "origin": "",
        "significant_issues": "Frames Iron Man for murder, is tracked by Stark who clears his name after battling Hammer’s agents (Iron Man #124-127, 1979); Retires to space station, in final battle with Iron Man, accidentally frozen and set adrift in space (Iron Man: Bad Blood #1-4, 2000)",
        "main_image": "MikeFichera--Justin-Hammer-main.jpg‎",
        "bio_text": "Justin Hammer was one of the world’s foremost industrialists and head of numerous design and manufacturing firms. Hammer established his primary base of operations aboard an immense floating villa, usually located in the Mediterranean. Hammer was also secretly funding the activities of many super-criminals, providing them with advanced weaponry from his factories and often deploying them against his business rivals. In exchange for his services, Hammer would traditionally claim 50% of what his clients stole.",
        "bio": "Justin Hammer was one of the world’s foremost industrialists and head of numerous design and manufacturing firms. Hammer established his primary base of operations aboard an immense floating villa, usually located in the Mediterranean. Hammer was also secretly funding the activities of many super-criminals, providing them with advanced weaponry from his factories and often deploying them against his business rivals. In exchange for his services, Hammer would traditionally claim 50% of what his clients stole.\n\nWhen the country of Carnelia prepared to offer a lucrative business contract to Hammer’s rival [[Stark International]], Hammer’s employee Philip Barnett developed a device which could override the cybernetic controls of [[Iron Man (Anthony Stark)|Tony Stark's]] Iron Man armor. (Hammer was unaware that Stark himself was Iron Man.) When Iron Man went to the United Nations to represent Stark International in a meeting with Carnelian ambassador Sergei Kotznin, Hammer used his control over the armor to force Iron Man’s repulsor beams to activate, firing a blast through Kotznin’s chest. The scandal that erupted resulted in Stark International losing its bid with Carnelia, enabling Hammer to step in and claim the contract. However, Iron Man eventually captured Barnett and forced him to testify against Hammer, clearing Iron Man’s name.\n\nAt some point, Hammer had purchased data on the designs for the Iron Man armor from the original [[Spymaster (spy)|Spymaster]], who had confiscated them from Stark International. Hammer used the stolen plans to design equipment for his operatives. Hammer’s operative [[Force|Force (Clayton Wilson)]] began to regret serving Hammer and went to Stark for aid; Stark helped fake Force’s death but while analyzing Force’s armor, Stark realized that Hammer had obtained his technology. Unable to confront him legally, Stark deleted Hammer’s files and personally destroyed the circuitry of each associate who had benefited from Hammer.\n\n[[image:Justinham.jpg|left|thumb|125px]]Hammer secretly obtained ownership of Stane International, which had once been Stark International. After learning that Stark’s health was in dire straits, Hammer formed an alliance with other Stark rivals to hasten Tony’s demise so that they could divide Stark Enterprises among them. Hammer had Stane International, disguised as Stark Enterprises, provide knowingly faulty equipment to a nuclear facility run by Akane Fusion in Japan. When the Akane facility exploded, they recruited the Masters of Silence to assassinate Stark. However, Tony untangled the deception and recruited the Masters of Silence to assist him against Hammer; besting Hammer and his forces, Iron Man forced him to sign Stane International’s holdings back to Tony Stark.\n\nSome time later, Hammer discovered that he had cancer and would soon die; he relocated to a space station in Earth’s orbit, believing that null-gravity would prolong his life. Determined to bring down his greatest rival, he again employed Philip Barnett and hired the [[Spymaster (Nathan Lemon)]] and Espionage Elite to assault Stark and plant “rogue cells” designed by Barnett within Tony’s body.\n\nOver time, these cells activated and began to adversely affect Stark, causing him to first become more aggressive and competitive, then increasingly pragmatic and violent. Tony was released from the cells by his friends [[Jocasta]] and [[Rhodes, James|James Rhodes]], and Iron Man confronted Hammer aboard his space station.\n\nHammer managed to incapacitate Iron Man within an energy field suspended over a pool of water, but when he saw that Barnett was attempting to flee the station in an escape pod, he activated the pod’s self-destruct device.\n\nUnfortunately for Hammer, the pod was too close to the station and the explosion knocked him into the pool. Iron Man set himself free from the field and blasted a hole through the station’s hull; Hammer was blown into space with the water and instantly froze; observing Hammer’s frozen body drifting in space, Iron Man reflected that his foe would now “live forever.”\n\nHammer’s legacy lives on in his daughter Justine, the [[Crimson_Cowl_(Justine_Hammer)|Crimson Cowl]].",
        "categories": [
            "Villains",
            "International",
            "Deceased"
        ]
    }
}