{
    "id": 1011412,
    "name": "Iron Fist (Wu Ao-Shi)",
    "description": "",
    "modified": "2014-03-05T13:39:42-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/7/03/53176f05a6851",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011412",
    "comics": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011412/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/15864",
                "name": "Immortal Iron Fist (2006) #7"
            }
        ],
        "returned": 1
    },
    "series": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011412/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1140",
                "name": "Immortal Iron Fist (2006 - 2009)"
            }
        ],
        "returned": 1
    },
    "stories": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011412/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/32396",
                "name": "Story A 1 of 1",
                "type": "interiorStory"
            }
        ],
        "returned": 1
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011412/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011412/iron_fist_wu_ao-shi?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Iron_Fist_(Wu_Ao-Shi)?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Wu Ao-Shi",
        "identity": "Secret",
        "aliases": "Pirate Queen of Pinghai Bay",
        "occupation": "Former warrior of [[K'un-Lun]], mercenary, thief",
        "place_of_birth": "K'un-Lun",
        "groups": "None",
        "citizenship": "Citizen of K'un-Lun",
        "education": "Unrevealed",
        "relatives": "Unidentified fisherman (betrothed), unidentified children",
        "height": "Unrevealed",
        "weight": "Unrevealed",
        "eyes": "Brown",
        "hair": "Black",
        "powers": "Wu Ao-Shi, as with all others who held the mantle of Iron Fist, could concentrate and focus her chi into her fists and make them as hard as iron. Also, she could presumably use the powers of the Iron Fist in all the ways that [[Iron Fist (Danny Rand)|Danny Rand]] is learning to use them.",
        "abilities": "Wu Ao-Shi was trained by Lei Kung, the Thunderer, to become a master of K’un-Lun martial arts in both armed and unarmed combat. She is an extraordinary athlete and gymnast as well.",
        "weapons": "Wu Ao-Shi, on occasion, used a bow which would fire arrows charged with the Shou-Lao chi making her enemies fall as if lightning from God had destroyed them",
        "paraphernalia": "None",
        "debut": "Immortal Iron Fist #2 (2007)",
        "origin": "Immortal Iron Fist #7 (2007)",
        "significant_issues": "Origin and story of the last woman to hold the mantle of Iron Fist (Immortal Iron Fist #7, 2007)",
        "main_image": "Iron_Fist_(Wu).jpg",
        "bio_text": "Even as a young girl, Wu Ao-Shi was considered to be very difficult. Perhaps it was that very character trait that led [[Kung, Lei|Lei Kung the Thunderer]] to taker her under his tutelage. The Thunderer came to meet Wu shortly after she stole from a local merchant. The merchant wanted to teach her a lesson, but the young girl would not accept her punishment so readily. Instead, she freed herself from her bonds and delivered a blow so fierce to the merchant that the local law enforcement would be called upon to resolve the matter. Lei Kung stepped in and spoke for the girl saying her actions were of self defense against a known neighborhood scoundrel. After that, Lei Kung began instructing Wu Ao-Shi in the ways of [[K'un-Lun]] martial arts and put her on the path to becoming the [[Iron Fist (disambiguation)|Iron Fist]].",
        "bio": "Even as a young girl, Wu Ao-Shi was considered to be very difficult. Perhaps it was that very character trait that led [[Kung, Lei|Lei Kung the Thunderer]] to taker her under his tutelage. The Thunderer came to meet Wu shortly after she stole from a local merchant. The merchant wanted to teach her a lesson, but the young girl would not accept her punishment so readily. Instead, she freed herself from her bonds and delivered a blow so fierce to the merchant that the local law enforcement would be called upon to resolve the matter. Lei Kung stepped in and spoke for the girl saying her actions were of self defense against a known neighborhood scoundrel. After that, Lei Kung began instructing Wu Ao-Shi in the ways of [[K'un-Lun]] martial arts and put her on the path to becoming the [[Iron Fist (disambiguation)|Iron Fist]]. \n\nAs with all those who held the mantle before her, Wu Ao-Shi had to defeat [[Shou-Lao the Undying]] in order to claim the power of the Iron Fist for herself. However, the power she craved was not the only thing Wu had claimed. During her training, she met a fisherman with whom she fell deeply in love with. One day this fisherman found two rings made of silver inside a fish he had caught and that night he proposed. She accepted, but in her heart, Wu Ao-Shi knew that they both had different lives to lead. She was destined to become the Living Weapon of K'un-Lun, and he was destined to fish. Wu did indeed fight the beast and bested Shou-Lao faster than any before her, and when it was over, she emerged the immortal Iron Fist. Unfortunately, the fisherman was distraught at the violence that filled his love’s life, and even though Wu blessed the rings they wore with her chi so he knew she loved him and was near, and that she still lived, the fisherman left her and K’un Lun once the city came into contact with the Earth. Wu did not accept his decision and she, too, left the Heavenly City in search of her love. \n\nHowever, Wu's path was not an easy one, and in this strange new world she had to adapt to their ways. Finding out very quickly it took wealth to stay alive, she resorted to doing what she knew best. Wu became a mercenary and used her skills to make money. Eventually, word came from Pinghai Bay that the Wokou pirates had taken over the territory, and Wu, seeing opportunity to make a fortune by liberating the city and charging top dollar for it, set out for Pinghai Bay. However, her first attempt to overthrow the Pirate King ended with Wu being defeated because of superior numbers against her. She was escorted through the village as a prisoner on her way to be executed when a familiar ring began to glow around the neck of a familiar fisherman. The fisherman, surprised to see his love again, poisoned her guards and freed his betrothed, and Wu set off to have her revenge. Wu found a boat and met her enemies at sea. Using her chi to infuse the arrows she fired at them, “her enemies fell as if lightning from God had destroyed them.” She had eliminated the pirate fleet and Pinghai Bay was now under her rule. The immortal Iron Fist and the fisherman stayed with each other for the rest of their days, and Wu Ao-Shi was known as the Pirate Queen of Pinghai Bay. She was the last woman to ever carry the mantle of Iron Fist, but the reason behind that has yet to be revealed.",
        "categories": [
            "Heroes",
            "Women",
            "Deceased"
        ]
    }
}