{
    "id": 1011139,
    "name": "Cammi",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/d/a0/4c00309587477",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011139",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011139/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011139/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011139/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011139/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011139/cammi?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Cammi?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "blurb": "",
        "real_name": "Cammi",
        "aliases": "None",
        "identity": "No dual identity",
        "occupation": "Drifter, Combat Cruiser pilot, Elementary school student",
        "citizenship": "U.S.A.",
        "place_of_birth": "Coot’s Bluff, Alaska",
        "relatives": "Mavis Mother (deceased), Father (unnamed)",
        "groups": "Formerly United Front",
        "education": "Elementary school (incomplete)",
        "height": "4'7\"",
        "weight": "80 lbs.",
        "eyes": "Brown",
        "hair": "Brown",
        "powers": "She has no known super human powers.",
        "abilities": "Unlike many space-faring humans, Cammi possesses no mutant genes or super human abilities. Her years of playing video games on Earth have trained her to be an adept pilot of space vessels. Cammi is also a very manipulative individual and skilled at finding ways to fulfill her objectives.",
        "weapons": "None",
        "paraphernalia": "",
        "debut": "Drax The Destroyer #1 (2005)",
        "origin": "Born in Alaska",
        "significant_issues": "Cammi found the survivors of the fallen extraterrestrial prison ship Dredge 01 that was en route to the Kyln (Drax the Destroyer #1, 2005); Drax is defeated by Paibok the Power Skrull who had taken the form of the mad Titan Thanos. Cammi claimed the corpse of the dim-witted Drax (Drax the Destroyer #2, 2005); Cammi watches as Drax is resurrected from the dead (Drax the Destroyer #3, 2006); Drax, Cammi, Paibok and the remaining Blood Brother are removed from the Earth and taken into custody by the Omega Core (Drax the Destroyer #4, 2006); Cammi and Drax are set free on Xandar, because of Drax’s recent transformation, the Nova Corps cannot prove his identity (Annihilation: Prologue 2006); Nova encounters Drax and Cammi, and they sought transport off of Xandar (Annihilation: Nova #1, 2006); Cammi, Drax and Nova are saved by Quasar (Wendell Vaughn) (Annihilation: #1, 2006); Cammi joins the United Front on the Kree planet of Daedalus 5 and Phyla-Vell informs Drax that Moondragon has been taken hostage by Thanos (Annihilation: #2, 2006); Drax leaves Cammi in search of Moondragon (Annihilation: Nova #3, 2006); Starlord, Phyla, and Nova phase off the planet of Daedalus 5 leaving Cammi and Gamora behind. (Annihilation #4, 2007); Cammi was last seen with the very small but powerful Chaos Mite Skreet. (Annihilation #6, 2007).",
        "main_image": "Cammi HD.jpg",
        "bio_text": "Cammi was a ten year old elementary school student. She was raised in Coot's Bluff, Alaska. She lived with her mother Mavis, who had a problem with alcohol. Her father has been missing for quite sometime. Recently the [[Omega Core]] Prison Transport Vessel designated Dredge 01 departed from planet Earth en route for [[Kyln]] prison planetoid. Located at the the edge on the universe in the [[Crunch Cascade]]. The galactic level gangsters known as the [[Blood Brothers]] were transferred into the Omega Core's custody by Earth authorities. But before the Dredge 01 left the planet's orbit, a singularity drive failure caused it to crash on Earth outside of Coot's Bluff, Alaska, United States of America.",
        "bio": "Cammi was a ten year old elementary school student. She was raised in Coot's Bluff, Alaska. She lived with her mother Mavis, who had a problem with alcohol. Her father has been missing for quite sometime. Recently the [[Omega Core]] Prison Transport Vessel designated Dredge 01 departed from planet Earth en route for [[Kyln]] prison planetoid. Located at the the edge on the universe in the [[Crunch Cascade]]. The galactic level gangsters known as the [[Blood Brothers]] were transferred into the Omega Core's custody by Earth authorities. But before the Dredge 01 left the planet's orbit, a singularity drive failure caused it to crash on Earth outside of Coot's Bluff, Alaska, United States of America.\n\nTen-year-old Cammi and her friend [[Dex (child)|Dex]], students at the nearby Coot’s Elementary School, happened upon the five survivors of the crash: [[Drax the Destroyer]], [[Paibok|Paibok the Power Skrull]], the Blood Brothers, and [[Lunatik]]. Tricking the dim-witted Drax into thinking that she was his long lost daughter Heather Douglas ([[Moondragon]]), after doing so Cammi goaded him into a fight with the Blood Brothers.\n\nWhile waiting for a way to escape Earth, Paibok had grown tired of the feud between Drax and the Blood Brothers. Paibok transformed himself into the likeness of [[Thanos|Thanos of Titan]], and then impaled Drax through the head causing his death. A strange occurrence soon followed Drax’s death. Cammi claimed ownership of Drax’s dead corpse. The corpse began to smoke and melded into the ground beneath it.\n\n[[image:Cammi In-line.jpg|thumb|Cammi views the body of the fallen Blood Brother|left]] \t\nLater a new version of the Drax entity bursts through the harden earth. Cammi believed that she was the owner of the current Drax. So she followed him, as he began his mission of revenge on Paibok and his allies for killing him. Drax killed Lunatik and one of the Blood Brothers. Paibok activated a folded space distress beacon to turn himself into the Omega Core’s custody. Later, Paibok, Drax, Cammi, and the surviving Blood Brother had been taken into custody on the Omega Core Stockade Barge designated Dredge 02.\n\nCammi and Drax remained aboard Dredge 02 until it docked at the [[Xandar]] Cluster, Tranta System, Andromeda Galaxy, on its way to the Kyln. At Xandar the Omega Core Prison transport warden was forced to release Cammi and Drax, because this new Drax’s genetic matrix readings did not match the original readings recorded by the Omega Core. Drax had allegedly slaughtered 200,000 [[Skrull]] settlers, despite the fact that Omega core was fairly certain that the two Draxes are one in the same. They had decided to release the two prisoners. While Cammi and Drax were awaiting their pending release, the [[Annihilation|Annihilation Wave]] attacked the Xandar Cluster, thus destroying the prison.\n\nNow stranded Cammi and Drax began searching for transport off the planet, in the process they ran into [[Nova (Richard Rider)|Nova]] from Earth. They were the only known survivors of the attack on the Xandar Cluster. They found a [[Nova Corps]] Combat Cruiser, which was powered by the Nova Force that is stored inside of Richard Rider. They traveled 9 light years to the planet of Nycos, where they were met by the Protector of the Universe [[Quasar (Wendell Vaughn)|Quasar]] of Earth. They were attacked by Annihilus’ Command section of the Annihilation Wave. Nova infected the Annihilation Waves' command structure by using a virus developed by the Xandar's [[World Mind]]. Cammi appeared piloting a Nova Corps Combat Cruiser to rescue the heroes. The infected vessels began to self-destruct granting them safe passage out of the Xandar Cluster.\n\nCammi, Drax and Nova with the World Mind incorporated into his person traveled 9 light years into Kree space. They arrived on [[Daedalus 5]], in the [[Greater Magellanic Cloud]] where Nova assumed leadership of the intergalactic resistance movement known as the [[United Front]]. [[Star-Lord (Peter Quill)|Star-Lord]] served as Nova's chief aide and strategist. Bolstered mainly by the local [[Kree]] Forces, the resistance also included the Skrull [[Talos]], [[Ronan]], [[Gamora]] and her [[Graces]]. There greatest assets were the heralds [[Firelord]], [[Red Shift]] and [[Stardust]]. There mission was to prevent the Annihilation Wave from advancing any further into the positive matter universe.\n\n[[image:Phyla, Cammi, and Drax.jpg|thumb|Phyla, Cammi, and Drax|left|200px]]While on Daedalus 5, Drax was approached by [[Phyla-Vell]] the daughter of the Kree hero [[Captain Marvel (Mar-Vell)|Captain Marvel]]. She is the lover of his daughter Moondragon. Phyla informed Drax that Moondragon had been abducted by his sworn enemy Thanos. She gave Drax a package containing her severed ear, which confirmed the story of Moondragon's capture. Cammi asks if she can keep the ear. After a brutal battle with the [[Centurions]] from the [[Negative Zone]], Drax leaves Cammi behind with the United Front as he goes to rescue Moondragon.\n\nAfter single handedly killing Thanos, Drax returned with Moondragon, but there has been no report of Cammi's whereabouts, no one has seen her since these events.",
        "categories": [
            "Annihilation",
            "Women"
        ]
    }
}