{
    "id": 1011075,
    "name": "Swarm",
    "description": "Fritz von Meyer was once a Nazi scientist, the details of which remain unrevealed, although it is known he had access to looted gold from countless European capitals to fund his research.",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/8/50/4c0030df47ab2",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011075",
    "comics": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011075/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/5079",
                "name": "Sensational Spider-Man (2006) #30"
            }
        ],
        "returned": 1
    },
    "series": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011075/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/722",
                "name": "Sensational Spider-Man (2006 - 2007)"
            }
        ],
        "returned": 1
    },
    "stories": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011075/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/3011",
                "name": "2 of 3 - The Deadly Foes of Spider-Man",
                "type": "cover"
            }
        ],
        "returned": 1
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011075/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011075/swarm?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Swarm?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Fritz von Meyer",
        "identity": "Publicly known",
        "occupation": "criminal; former chemist/beekeeper; former Nazi scientist",
        "place_of_birth": "Unrevealed location in Germany",
        "groups": "The Exterminators; formerly [[Nazi Party]]",
        "citizenship": "Argentinean expatriate; citizen of Germany",
        "education": "Presumably post-graduate education",
        "aliases": "None",
        "relatives": "Unrevealed",
        "height": "6’5”",
        "weight": "Indeterminate",
        "eyes": "White",
        "hair": "None",
        "powers": "Swarm is a composite being of hundreds of thousands of bees driven by a human intelligence. Swarm is technically intangible, as his body is merely an aggregate of tiny forms, and he can fly through the air or assume any shape and size he desires. Swarm can also mentally influence the actions of other bees, the full range of which may extend over hundreds of yards in radius. At first, Swarm seemed capable of only controlling other bees, but he has exhibited the ability to communicate/control other insects as well.",
        "abilities": "Von Meyer was a brilliant scientist, and his expertise was not lost with his physical death. He often succeeded in mutating bees to gigantic size, and was often seen riding a monstrous queen bee.",
        "weapons": "None",
        "paraphernalia": "None",
        "debut": "Champions #14 (1977)",
        "origin": "Champions #15 (1977)",
        "significant_issues": "Pursued Interpol agent who stole queen bee to Los Angeles, vs Champions, left inert when Hercules threw queen into ocean & bees followed her (Champions #14-15, 1977); accidentally revived at Empire State University in New York, vs Spider-Man/Peter Parker, experimental insect repellent caused his bees to attack queen, left inert again (Peter Parker: The Spectacular Spider-Man #36-37, 1979); revived by nuclear blaster, vs Spider-Man/Peter Parker & others for blaster, bees again dispersed from body (Lethal Foes of Spider-Man #3-4, 1993); sought to destroy Rand-Meachum research facility, convinced to leave by Doctor Druid (Secret Defenders #18-19, 1994); connection to bees disrupted by Onslaught, sought to restore it, vs Spider-Man/Ben Reilly, defeated (Sensational Spider-Man #9-10, 1996); returned to Los Angeles, vs Runaways, defeated (Runaways #7, 2005)",
        "main_image": "Swarm.jpg",
        "bio_text": "Fritz von Meyer was once a Nazi scientist, the details of which remain unrevealed, although it is known he had access to looted gold from countless European capitals to fund his research. Von Meyer fled Germany at the end of World War II to settle in South America. A world expert on toxic poisons and apiculture (bee keeping,) he continued his research on breeding patterns of killer bees in comparative peace deep in the jungles.",
        "bio": "Fritz von Meyer was once a Nazi scientist, the details of which remain unrevealed, although it is known he had access to looted gold from countless European capitals to fund his research. Von Meyer fled Germany at the end of World War II to settle in South America. A world expert on toxic poisons and apiculture (bee keeping,) he continued his research on breeding patterns of killer bees in comparative peace deep in the jungles.\n\n\nOne day, he found a hive unlike any he had ever seen-- the bees exhibited no fear, an unusual passivity, and a highly developed intelligence. Believing that a nearby meteorite bombardment had somehow mutated the bees with radiation, von Meyer built a device that he hoped would reawaken the bees' killer instincts so that they could serve him. However, von Meyer had erred, so that, while the bees were no longer passive, they were not in his control. They began to swarm over von Meyer, killing him. In the midst of his death throes, his consciousness shredded, dissipating into the swarm of bees. Thus, von Meyer became an aggregate being, a living embodiment of the swarm, with his own scientific mind added to the mutant intelligence of the multitude of bees. Von Meyer claims to have used his powers to conquer, and at some point he must have developed giant mechanical bees that obey his commands.\n\nShortly afterward, the international police agency Interpol, in its quest to bring war criminals to justice, managed to track down von Meyer. One agent somehow managed to capture the queen bee of von Meyer's swarm, encasing it in amber and fleeing to the United States. Von Meyer, calling himself Swarm, followed, killing the agent who was attempting to flee on a ship but failing to recover the briefcase that held the trapped queen. At the same time, the [[Champions (of Los Angeles)|Champions]] were seeing off a friend of their member, [[Black Widow (Natasha Romanova)|Black Widow]]. They interrupted Swarm's attack, discovered the murder, and took the briefcase, unaware of its purpose. Swarm soon confronted the team directly, and during the attack, managed to free the queen. The queen was free to complete its mutation, begun earlier by von Meyer, and grew to gigantic size. The fight ended when the Champion [[Hercules (Heracles)|Hercules]], using his superhuman strength, threw the gigantic queen miles away. The bees of von Meyer's body were pulled away, following the queen, and left von Meyer as nothing but a skeleton.\n\nVon Meyer's skeleton was sent to New York's Empire State University biophysics department for further study. When the scientist started performing radiation tests on the skeleton, a queen bee that happened to be in the skull instantly began breeding millions of bees. (It is unclear whether this was the original queen bee somehow shrunken or a different one entirely.) Within moments, the entity of Swarm was reborn. Swarm decided to kill the scientist and launch a reign of terror on the campus. The scientist was rescued by [[Spider-Man (Peter Parker)|Spider-Man]], whose secret identity of Peter Parker had began work in the department as a teaching assistant, and Swarm turned his attention on Spider-Man, claiming that \"spiders and bees are natural deadly enemies.\" Spider-Man was saved only by smashing into nearby chemicals that happened to be some manner of insect repellant.\n\nSwarm immediately launched an attack on the city, hoping to cleanse the world of [[Humans|humankind]]. He also hoped to allow his queen bee to mutate and grow, and he began constructing a gigantic hive in the middle of the campus for this purpose. Parker learned from his fellow teaching assistants that they created more of the experimental insect repellant that saved Spider-Man's life. Pouring the chemicals on his costume and combining it with his web-fluid, Spider-Man once more confronted Swarm. The repellant caused the bees intense pain, and in their maddened state, they turned against each other. This also happened to the now-gigantic queen bee, whose hive refused to obey Swarm's commands and fled. Once more, von Meyer was reduced to nothing but a skeleton.\n\nSomehow, Swarm's intelligence survived, presumably due to the fact that he no longer needed the human skeleton upon which to manifest. Years later, experiments on a supercollider project at the [[Rand-Meachum Corporation|Rand-Meachum]] laboratories in Houston, Texas, began disrupting the migratory patterns of various insects and causing Swarm severe distress. Vowing revenge, Swarm used various insects under his control to surreptitiously sabotage the project. The insect attacks alerted the attention of a government watchdog group. The leader of the group contacted his old friend, [[Doctor Druid]], for help. Druid, in turn, manipulated events so that Doctor [[Yellowjacket (Henry Pym)|Henry Pym]] (in his [[Giant-Man]] identity) would unknowingly join his team of \"[[Secret Defenders]]\" to investigate.\n\nDoctor Druid and his regular allies confronted Swarm, who, frustrated on being discovered, hoped to use the destructive power of the supercollider to render all technology in the world useless, thus paving the way for insect life to become the rightful dominant lifeform on the planet. Druid psychically induced [[Archangel]] and [[Iceman]] (former members of the Champions) to converge on the site, and the battle was joined on multiple fronts. Ultimately, Druid was able to convince Swarm that if he truly believed that humankind would eventually destroy itself anyway, he shouldn't risk attracting the enmity of the human race and should simply wait for the inevitable destruction. Swarm agreed and fled. In the meantime, the other heroes were able to use their powers to stop the supercollider from overloading.\n\nWhen [[Onslaught (entity)|Onslaught]] was destroyed by [[Earth|Earth's]] heroes, the telepathic bond between von Meyer and his mutant bee colony was damaged. Swarm returned to New York, the place of Onslaught's destruction, to re-establish his psychic link or risk becoming discorporate again. He took over the Institute of Seismoharmonic Research to force its research team to adjust his body's vibratory field to restore him to full power, as bees fly by moving their wings so fast that they create a vibratory current they can ride on. In the meantime, a cloud of bees began forming over the city, attacking people and causing mayhem. This drew the attention of [[Scarlet Spider (Ben Reilly)|Spider-Man (Ben Reilly)]].\n\nSwarm's bees seemed to recognize and be afraid of Spider-Man, despite the fact that it was a different person in the costume, thus allowing the hero to enter the Institute unmolested and form a plan with the scientists. Spider-Man adjusted the equipment, so that, instead of allowing Swarm to pull together his bees, the bees' ability to fly was negated. Spider-Man easily captured the queen bee, professing to prevent Swarm from posing any future threat.\n\nWhen the cabal of villains known as the [[Pride]] was defeated by their children, it left Los Angeles and the West Coast with a power vacuum in its criminal community. Notified by its drones, Swarm appeared in Hollywood, claiming his rule over the city. He was opposed by the [[Runaways]] and taken down by their newest member, [[Mancha, Victor|Victor Mancha]], who used his powers to disrupt the electrical impulses that Swarm’s bees used for communication.",
        "categories": [
            "People",
            "Villains",
            "Spider-Man",
            "International"
        ]
    }
}