{
    "id": 1011059,
    "name": "Living Tribunal",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/2/a0/4c0031062f91f",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011059",
    "comics": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011059/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/5084",
                "name": "She-Hulk (2005) #12"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/5959",
                "name": "She-Hulk Vol. 4: Laws of Attraction (Trade Paperback)"
            }
        ],
        "returned": 2
    },
    "series": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011059/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/886",
                "name": "She-Hulk (2005 - 2009)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1896",
                "name": "She-Hulk Vol. 4: Laws of Attraction (2007)"
            }
        ],
        "returned": 2
    },
    "stories": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011059/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/4763",
                "name": "Cover #4763",
                "type": "cover"
            }
        ],
        "returned": 1
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011059/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011059/living_tribunal?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Living_Tribunal?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[http://www.marvel.com/universe/Category:Realities All Realities and Universes]",
        "real_name": "The Living Tribunal",
        "identity": "Known to other cosmic entities",
        "occupation": "Acting guardian and judge of the multiverse",
        "place_of_birth": "Unknown, perhaps inapplicable",
        "groups": "None",
        "citizenship": "Inapplicable",
        "education": "Unrevealed, perhaps inapplicable",
        "aliases": "None",
        "relatives": "Perhaps inapplicable",
        "height": "Inapplicable; appears to humans as a giant",
        "weight": "Inapplicable",
        "eyes": "No visible pupils or irises",
        "hair": "None known",
        "powers": "Possessing virtually limitless power, the Living Tribunal can survey the entire multiverse at once, obliterate planets or suns at will, and form impenetrable barriers around worlds or even whole universes. The Living Tribunal manifests itself in a three-headed form, each head represnting a different facet of its personality: the fully visible face represents equity; the fully hooded face represents necessity; and the half hooded face represents revenge. The face which addresses a plaintiff identifies which personality is guiding the Living Tribunal's decisions.",
        "debut": "Strange Tales #157",
        "origin": "Unrevealed",
        "significant_issues": "[[OHOTMU:Bibliography-AZ6#Living Tribunal|See Handbook Bibliography]]",
        "main_image": "l_trib.jpg",
        "bio_text": "The Living Tribunal was a vastly powerful conceptual being, one who had existed since the multiverse came into exsistene. The Living Tribunal's only superior was the [[One-Above-All]] (not to be confused with the [[Celestials|Celestial]] that was known as the [[One Above All (Celestial)|One Above All]]), an entity which was apparently responsible for all life in the multiverse, and possibly beyond, (this includes the Earth-616 [[Marvel Universe|Universe]], [[Earth X]], the [[Ultimate Universe]], and all other alternate and potential realities).",
        "bio": "The Living Tribunal was a vastly powerful conceptual being, one who had existed since the multiverse came into exsistene. The Living Tribunal's only superior was the [[One-Above-All]] (not to be confused with the [[Celestials|Celestial]] that was known as the [[One Above All (Celestial)|One Above All]]), an entity which was apparently responsible for all life in the multiverse, and possibly beyond, (this includes the Earth-616 [[Marvel Universe|Universe]], [[Earth X]], the [[Ultimate Universe]], and all other alternate and potential realities).\n\n'''NOTE:''' A universe is a single-[[Glossary:D#dimension|dimension]] reality, such as Earth-616. The [[Glossary:M#multiverse|Multiverse]] is the collection of alternate dimensions with a similar nature and universal hierarchy. Earth-616 and alternate Earths seen in the MU (which include beings like the [[Watchers|Watcher]], [[Eternity]], etc.) are within the same Multiverse. Realms lacking this hierarchy of power are outside of the Multiverse, but within the larger [[Glossary:O#Omniverse|Omniverse]]. Further, the realms with a Multiverse are divided into divergent earths, who share a common history and diverge at a specific point, and alternate Earths, who are similar, but possess many inherent differences. The Ominiverse is the collection of every single universe, dimension, etc. Everything is in the Ominiverse, and there is only one Ominiverse. Within the Ominiverse, collections of associated realms from different Multiverses are referred to as [[Glossary:M#megaverse|Megaverses]].\n\nThe Living Tribunal often interacted with other conceptual beings, serving as their arbiter and judge. The Living Tribunal appeared as a giant golden humanoid (using a [[M-Body]], created in the [[Dimension of Manifestations]]), with three cloaked faces, each representing a different personality. It has a blank space where a fourth face could be exhibited. The Living Tribunal has suggested that the fourth face became the enigmatic [[Stranger]]. The three faces made up the Tribunal’s head. They were: Equity, Necessity, and Vengeance. These represented the trinity of aspects of each universe. For example, in the main universe they were represented by [[Galactus]] (Equity), [[Eternity]] (Necessity), and [[Death (embodiment)|Death]] (Vengeance). \n\nEven beings such as  Eternity, [[Infinity]], Death and [[Oblivion]] were subject to the Living Tribunals authority. Unlike other conceptual beings, the Living Tribunal had no counterpart in other realities; only one Living Tribunal existed in the Multiverse, and it was responsible for all judgments. The Living Tribunal's apparent base of operations was a dimension known as  the [[Star Chamber]], and it was served by lesser creatures called the [[Magistrati]], who assisted in judging matters where the Living Tribunal could not intervene. The living Tribunal also helped fashion the twin cosmic entities the [[Brothers]], each who became the guardian of a different Megaverse, within the larger Omniverse but encompassing more than a single Multiverse.\n\nThe Living Tribunal was not guided by any personal motivation or desires, but was entirely impartial, acting only in what was determined to be the greater interest of the universe. The Living Tribunal was more than willing to sacrifice millions of lives for the sake of billions more, or even billions for the sake of trillions, and would not deign to address the concerns of any lesser beings without first establishing a plaintiff's importance.\n\nWhen the Earth-616 sorcerer [[Doctor Strange (Stephen Strange)|Doctor Strange]] brought the creature [[Zom]] to Earth in order to help drive off the sorceress [[Umar]], the Living Tribunal was forced to intervene and banished Zom from Earth before he could destroy humanity. However, Zom's mere presence on Earth had tainted all life with the creature’s evil, and the Living Tribunal informed Dr. Strange that the Earth would be destroyed for the greater good. After convincing the Living Tribunal that he was a powerful sorcerer, Dr. Strange won the right for a reprieve, gaining time to try and eliminate Zom's contamination. Dr. Strange received the [[Staff of Polar Power]] from the creature [[Nebulos]] to absorb the evil magic, most of which was contained within [[Baron Mordo (Karl Mordo)|Baron Mordo]], but once the staff took Mordo's excess power, Nebulos claimed it for himself. The Living Tribunal intervened to face Nebulos, and Dr. Strange helped the Living Tribunal who obliterated the planet [[Perilous]], and  Nebulos was buried in the rubble, he was presumed dead. The Living Tribunal destroyed the staff rather than destroying the Earth, eliminating the threat.  \n\nWhen Dr. Strange next encountered the Living Tribunal, he was informed that due to his works and heroes like him, the balance between good and evil on Earth had been tipped to good's favor, and that the Tribunal would have to release the [[In-Betweener]] to balance the two sides in the interest of the cosmic entities [[Lord Chaos]] and [[Master Order]]. Opposing the In-Betweener Dr. Strange was defeated. However, the spaceknight [[Rom]] argued on behalf of his mission to destroy the [[Dire Wraiths]], stating that the Wraiths might have tipped the scales on Earth to evil's benefit. Rom observed that his presence on Earth would act as a balance to the Wraiths' evil, and the Living Tribunal agreed with him, and withdrew the In-Betweener.\n\nThe [[Korvac (Earth-82432)|Korvac]] of [[Earth-82432]] accumulated such power that the Living Tribunal sealed that reality to prevent it from affecting others, removing the barrier only after that Korvac had used the [[Ultimate Nullifier]] to destroy himself and the entire universe. When Earth--616's omnipotent [[Beyonder]] threatened to eradicate Death itself, the living Tribunal joined other cosmic entities in manifesting before the Beyonder to halt him. Although the Beyonder succeeded in destroying Death, he soon realized that the universe needed Death, and his friend [[Dave]] sacrificed himself to become the new Death. When the Living Tribunal first encountered the [[Silver Surfer]], it submitted to him the concept that he was Galactus' opposite number, and allowed the Surfer to become one with the universe for a moment. The Surfer was awestruck by the experience. Later when [[Earth-89112]]'s reality was overrun with [[demons]], the Living Tribunal nearly destroyed it, but that Earth was redeemed by its counterpart of the [[Phoenix Force]], which eradicated all of the demons. The Living Tribunal then had the Phoenix Force depart from Earth.\n\nShortly after the funeral of the Earth-616 reality's cosmic entity [[Eon]], the living Tribunal was petitioned by many of reality's conceptual beings, who were threatened by the [[Thanos]]' ascendance to godhood after claiming the six [[Infinity Gems]] and conforming them into a weapon capable of universal destruction. The weapon would come to be known as the [[Infinity Gauntlet]]. Although Eternity argued that Thanos was seeking to supplant its role in the universe, the Living Tribunal simply observed that it was the nature of all life, and it was allowed to be played out. However, when the gems wounded up in the custody of [[Warlock, Adam|Adam Warlock]], the Living Tribunal ordered that the gems be divided among six caretakers and never be allowed to act in unison, as Warlock was deemed to unstable to retain such power. In doing so, the Living Tribunal demonstrated that his power surpassed that of the gems. Warlock would go onto form the [[Infinity Watch]], to safeguard the gems. \n\nWhen Warlock's evil side, the [[Magus (Adam Warlock)|Magus]] rendered Eternity comatose, Galactus argued for the Living Tribunal to remove its ban on the gems so that Warlock could use them to defeat the Magus. Although the Magus obtained the gems himself, he was soundly beaten because he lacked the [[Reality Gem]]; Infinity and Eternity defeated him, then had the restriction placed on the gems again. Eternity held a private hearing with the Living Tribunal to argue against the Infinity Watch's continued custodianship of the gems, but the Living Tribunal judged against Eternity. However, the Living Tribunal did confide to Eternity that because the Infinity Watch was within him, yet not under his control, he had obtained a gift of unpredictability which he should treasure.\n\nWhen the powerful [[Star Brand]] of [[Earth-148611 (New Universe)]] was inadvertently brought into the Earth-616 dimension by [[Quasar (Wendell Vaughn)]], it was wielded by his girlfriend [[Ballantine, Kayla|Kayla Ballantine]], then seized by [[Erishkigal]], a [[Deviants|Deviant]]. She attempted to conquer the [[Glossary:N#Nexus of all Realities|Nexus of all Realities]], and challenged the Living Tribunal. To determine the fate of the multiverse, they chose as champions Quasar and the Silver Surfer. When Quasar realized  he was Erishkigal's champion, he allowed himself to lose, and the Living Tribunal claimed  the Star Brand, returning it to Kayla for safe keeping. After the Stranger took the Star Brand from Kayla and used it to bring Earth-148611 into the 616 dimension, the Living Tribunal placed a barrier around the planet to keep the Star Brand energies from further contaminating the 616 reality. Kayla was left behind on that world because she had wielded the brand.\n\nWhen the formerly heroic mystic [[Doctor Druid]] summoned fourth the demon [[Slorioth]] in order to prematurely advance the [[War of the Seven Spheres]] which the mystical [[Vishanti]] were engaged in, the Vishanti summoned the Living Tribunal and it judged against Slorioth, banishing it from the Earth. When Thanos gained vast power again through the [[Heart of the Infinite]], the Living Tribunal joined champions from across realities to challenge him. Thanos destroyed all that existed with his power, but subsequently had a change of heart and restored reality, ridding himself of his power; the re-created universe lacked the terminal flaw which Thanos had sought to cure. \n\nRecently, the Magistrati employed Earth-616's [[She-Hulk]] to serve in the Star Chamber and assist them in judging cases from throughout the universe. During her time in the Star Chamber, She-Hulk earned the enmity of [[Zoma]] the Watcher for forcing his brother [[Qyre]] to be stricken silent. She also met the challenge of the [[Fallen One (Tryco Slatterus)|Champion of the Universe]] when he lorded over the population of Skardon with his [[Power Gem]], and ultimately bested him in combat. In the 31st century of Earth-691, the Living Tribunal was nearly usurped by the [[Protégé (Earth-691)|Protégé]], whose abilities to duplicate the powers of others allowed him to manifest the Living Tribunal's own power. Although the [[Guardians of the Galaxy]] struggled futilely against Protégé, it was [[Scathan(Earth-691)|Scathan]] the [[Celestials|Celestial]] who saved reality by judging against him, and the Living Tribunal absorbed the Protégé into itself to prevent him from endangering reality again.",
        "categories": [
            "Cosmic"
        ]
    }
}