{
    "id": 1011147,
    "name": "Korath",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/8/a0/4c002f7453eaa",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011147",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011147/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011147/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011147/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011147/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011147/korath?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Korath?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "blurb": "",
        "real_name": "Korath-Thak",
        "aliases": "The Pursuer",
        "identity": "Not publicly known on Earth.",
        "occupation": "Starforce member and servant to the Supreme Intelligence. Formerly a cyber-geneticist on Kreelar.",
        "citizenship": "Kreelar",
        "place_of_birth": "Unknown",
        "relatives": "None",
        "groups": "[[Starforce]]",
        "education": "Highly trained scientist.",
        "height": "6'",
        "weight": "290 lbs.",
        "eyes": "Blue",
        "hair": "Bald",
        "powers": "",
        "abilities": "Like all Kree, Korath is stronger and more durable than a comparable humanoid specimen. Since being implanted with the Pursuer templates these have been enhanced to an unrevealed degree. He has been trained in ancient Kree martial arts. He is  an novice in using his skills in battle.It is unknown if he has been transformed into a Ruul Kree.",
        "weapons": "Korath carries two beta batons capable of firing strong energy blast. He also uses protective body armor to fly. As a Kree agent he had access to scanners to find anomalous brain pattern from a crowd or detect power levels.",
        "paraphernalia": "",
        "debut": "[[Quasar]] #32 (1992)",
        "origin": "Korath was one of the scientists behind the cybernetic Pursuer warriors who turned the experiment upon himself when the project was abandoned by the Kree government. (Quasar #32 1992)",
        "significant_issues": "The Pursuer project consisted of a super powered template that could be applied to materials or living things, transforming them into super powered agents of the Kree. (Inhumans #11 1992) Korath was summoned to Hala by the Supreme Intelligence, along with [[Shatterax]] and [[Ultimus]] to become part of the Kree Starforce. ([[Captain America]] #399 1992); The [[Supreme Intelligence]] sent Korath, with Starforce, to assassinate the ruler of the [[ Shi'ar]], Lilandra. ([[Thor]] #446 1992); [[Lilandra]] sentenced Korath and the other members of Starforce to execution, but the [[Avengers]] fought the [[Imperial Guard]] for their lives. (Avengers West Coast #82 1992); After the decimation of the Kree empire, Lilandra assumed leadership of the Kree, and sent [[Deathbird]] to rule the planet as her viceroy.The Starforce would be her personal guard. (Avengers #347 1992); Starforce intercepted Quasar and his allies [[Makkari]] and [[Kismet|Her]] on Hala. The three heroes had come to assist Hala in rebuilding the planet, but [[Deathbird]] did not believe them, and instructed Korath and the others to attack. Quasar and his friends fled to avoid a pointless battle. (Quasar#35 1992); Admiral Galen-Kor and his criminal forces battled Deathbird and Starforce ([[Silver Surfer]]: Breakout, 1994); Korath and Starforce alongside the [[Underground Legion]], battled [[Lord Tantalus]] (Blackwulf #7-10, 1994-1995); Korath wound up settling on the planet of Godthab Omega. Korath was reunited with Ronan when he came to the planet in search of [[Nile, Tana|Tana Nile]]. ([[Annihilation]]: [[Ronan]] #1 2006)",
        "main_image": "Korath.jpg",
        "bio_text": "Korath-Thak is a brilliant cyber-geneticist who was one of the creators of the Pursuer project, creating an energy template that could transform any matter it touched into a form it could use to pursue and subdue its intended targets. The first use of the template was at the instigation of the Kree science council to bring the [[Inhumans]] of Earth to Hala to serve as conscripts in the Kree army. This action would insight the conflict that has come to be known as the \"War of Three Galaxies.\" The template was beamed to Earth but instead of hitting stones or metal as hoped, it hit and transformed cockroaches. In this form the Pursuer defeated the Inhumans Royal family; ([[Black Bolt]], [[Medusa]], [[Gorgon]], [[Karnak]], and [[Triton]]) until the Kree defector [[Falzon]] used an insecticide to stop the template.",
        "bio": "Korath-Thak is a brilliant cyber-geneticist who was one of the creators of the Pursuer project, creating an energy template that could transform any matter it touched into a form it could use to pursue and subdue its intended targets. The first use of the template was at the instigation of the Kree science council to bring the [[Inhumans]] of Earth to Hala to serve as conscripts in the Kree army. This action would insight the conflict that has come to be known as the \"War of Three Galaxies.\" The template was beamed to Earth but instead of hitting stones or metal as hoped, it hit and transformed cockroaches. In this form the Pursuer defeated the Inhumans Royal family; ([[Black Bolt]], [[Medusa]], [[Gorgon]], [[Karnak]], and [[Triton]]) until the Kree defector [[Falzon]] used an insecticide to stop the template.\n\n\nYears later the Pursuer project was canceled by Kree leaders Ael-Dann and Dar-Benn because they felt that their money was being wasted on a frivolous project. Bitter at their decision, Korath turned the template on himself, transforming him into a new Pursuer. He was secretly summoned by the Supreme Intelligence, he joined with the last Kree Eternal [[Ultimus]], armored kree [[Shatterax]], [[Att-Lass|Captain Att-Lass]], and [[Minn-Erva|Doctor Minn-Erva]], as the Kree super army Starforce. Their first mission was to capture the Avengers. The Avengers were allegedly on Hala to kill Ael-Dan and Dar-Benn, who were killed by the Shi'ar Deathbird instead. The Starforce was sent to assassinate the Shi'ar Majestrix [[Lilandra]] in retaliation, but were stopped by the Shi'ar Imperial Guard and a second team of Avengers.\n\nAfter the Nega bomb decimated the Kree, Starforce was forced to serve the new Shi'ar Deathbird as her personal guard on Hala. Pursuing the Armechadon Deviant Lord Tantalus they joined forces with Blackwulf and the Underground Legion. The Supreme Intelligence soon regained  control of the Kree Empire from the Shi'ar. Korath and some of the other members of the Starforce were considered to be defectors and exiled by the emerging Nu-Elite. The former Starfoce members found refuge on the backwater world of Godthab Omega. They lived in peace there with the other exile members of their race. They kept up with current events of the Kree Empire through primitive communication with sympathizers on various Kree hub worlds. \n\nRecently the newly exiled Ronan the Accuser (also a former member of the Starforce) found his way to Godthab Omega in search of the [[Rigellians|Rigellian]], Tana Nile. Korath informs Ronan that Tana Nile was last seen with [[Gamora]] as one of her [[Graces]]. Gamora battled Ronan in defense of Tana Nile. After the battle Ronan informed Korath that he sensed something was off on the planet. Korath agreed with him, but before they could investigate the planet was over run with the bug soldiers of [[Annihilus]]. They came to be  known as the Annihilation Wave. Ronan noticed while in battle that he had gained more control of his powers upon the waves arrival. Korath and Ronan managed to return to their ship where they herd the apprentice [[Shaper of Worlds]], [[Glorian]]. He yelled out that, he had the power to destroy the wave. Ronan led the survivors of Godthab Omega to Kree space where they joined the resistance led by Richard Rider, [[Nova]] of Earth. \n\nDuring the invasion of the Kree Empire by the techno-organic race known as the [[Phalanx]], Korath was assimilated in to their collective and made a Select. Now that he was basically a super soldier for the Phalanx he was sent on a mission to capture the supposed savior of the Kree race. The savior was revealed to be [[Warlock, Adam|Adam Warlock]]. Korath failed to capture Warlock due to the interference of [[Quasar (Phyla-Vell)|Phyla-Vell]] and [[Moondragon]].  On Hala in Phalanx command center, Kroath was destroyed by [[Ultron]] in front of Shatterax and [[Xemnu|Xemnu the Titian]].",
        "categories": [
            "Cosmic",
            "Deceased",
            "Villains"
        ]
    }
}