{
    "id": 1011056,
    "name": "Multiple Man",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/5/a0/4c00310e9dc27",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011056",
    "comics": {
        "available": 10,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011056/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/37881",
                "name": "Chaos War: X-Men (2010) #1"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/16505",
                "name": "X-Factor (2005) #24"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/12213",
                "name": "X-Factor (1986) #134"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/12226",
                "name": "X-Factor (1986) #146"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/23514",
                "name": "X-Factor Annual (1986) #6"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/23515",
                "name": "X-Factor Annual (1986) #7"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/23516",
                "name": "X-Factor Annual (1986) #8"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/23517",
                "name": "X-Factor Annual (1986) #9"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/21430",
                "name": "X-Factor Visionaries: Peter David Vol. 4 (Trade Paperback)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17979",
                "name": "X-Force (1991) #16"
            }
        ],
        "returned": 10
    },
    "series": {
        "available": 6,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011056/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/13588",
                "name": "Chaos War: X-Men (2010)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1035",
                "name": "X-Factor (2005 - Present)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2098",
                "name": "X-Factor (1986 - 1998)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/6689",
                "name": "X-Factor Annual (1986 - Present)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/5068",
                "name": "X-Factor Visionaries: Peter David Vol. 4 (2008)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/3633",
                "name": "X-Force (1991 - 2004)"
            }
        ],
        "returned": 6
    },
    "stories": {
        "available": 13,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011056/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/22168",
                "name": "Where's Guido?",
                "type": "pinup"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/22194",
                "name": "The Return of Multiple Man",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/33277",
                "name": "Heart of Ice 4 of 4",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/38236",
                "name": "X-Cutioner's Song Part 4",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/51884",
                "name": "King of Pain",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/51887",
                "name": "Shattershot Part 3",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/51888",
                "name": "Shattershot Part 3: The Historians of Things to Come",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/51893",
                "name": "Cover #51893",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/51894",
                "name": "Charon",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/51895",
                "name": "What Have You Got to Hide?",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/51901",
                "name": "Haven",
                "type": "pinup"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/51903",
                "name": "X-Factor",
                "type": "pinup"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/83440",
                "name": "Chaos War: X-Men (2010) #1",
                "type": "cover"
            }
        ],
        "returned": 13
    },
    "events": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011056/events",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/events/296",
                "name": "Chaos War"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/events/32",
                "name": "Kings of Pain"
            }
        ],
        "returned": 2
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011056/multiple_man?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Multiple_Man?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "James Arthur \"Jamie\" Madrox",
        "identity": "Publicly known",
        "occupation": "Private investigator, adventurer, former laboratory assistant, farmer",
        "place_of_birth": "Los Alamos, New Mexico",
        "Date_of_birth": "September 7th, 1953",
        "groups": "[[X-Factor Investigations]]; formerly [[X-Corporation]], [[X-Corps]], [[X-Factor]], [[Nasty Boys]] (duplicate only), [[Fallen Angels]] (duplicate only)",
        "citizenship": "U.S.A.",
        "education": "College-level courses",
        "aliases": "none",
        "relatives": "Daniel Madrox (father, deceased), Joan Madrox (mother, deceased)",
        "height": "5'11\"",
        "weight": "155 lbs.",
        "eyes": "Blue",
        "hair": "Brown",
        "powers": "Madrox creates an identical physical living duplicate of himself upon any physical impact, possibly via [[Glossary:E#extradimensional|extradimensional]] mass acquisition similar to the process used by [[Ant-Man]] or the [[Hulk (Bruce Banner)|Hulk]]. This process is spontaneous and cannot be prevented by Madrox. Although he can create multiple duplicates, and the duplicates themselves can also replicate, each is only able to create one duplicate at a time; he has been seen to produce around forty duplicates before no more would be created. The duplicates think, feel, and act independently, though usually guided by the original. Each tends to manifest one aspect of Madrox's personality, which increases in strength with lengthier separation from the original; these traits have recently become more extreme. Madrox is [[Glossary:T#telepathy|telepathically]] and [[Glossary:E#empathy|empathically]] linked to his duplicates, suffering severe, potentially fatal, trauma if one dies. Madrox can \"reabsorb\" his duplicates, gaining their new knowledge and skills. Similarly, he will acquire any physical injury - though not any actual toxin - from a duplicate; symptoms are typically lessened by half during absorption. If Madrox himself were killed, it is not known whether any existing duplicates would continue to function independently; it is virtually impossible to distinguish the original from the duplicates.",
        "paraphernalia": "Madrox's original costume absorbed kinetic energy, preventing accidental duplication. Madrox's strength was proportionately increased via this absorbed energy.",
        "abilities": "Madrox has acquired extensive knowledge and skills via his duplicates' experiences, such as human anatomy, speaking Russian, and Shaolin monk stealth techniques.",
        "debut": "Giant-Size Fantastic Four #4 (1975)",
        "creators": "Len Wein, Chris Claremont & John Buscema",
        "main_image": "Multiple man.jpg",
        "bio_text": "Jamie Madrox's [[Glossary:M#mutant|mutant]] ability was apparent at birth when a duplicate was created upon his being slapped by the doctor. Two weeks later, Jamie's father resigned from the Los Alamos Nuclear Research Center and moved his family to an intentionally isolated farm in Kansas at the suggestion of [[Professor X|Professor Charles Xavier]]. From a young age, Madrox was given a special suit to wear that would neutralize his mutant power, but before this could be explained to him a freak tornado killed his parents when he was 15.",
        "bio": "Jamie Madrox's [[Glossary:M#mutant|mutant]] ability was apparent at birth when a duplicate was created upon his being slapped by the doctor. Two weeks later, Jamie's father resigned from the Los Alamos Nuclear Research Center and moved his family to an intentionally isolated farm in Kansas at the suggestion of [[Professor X|Professor Charles Xavier]]. From a young age, Madrox was given a special suit to wear that would neutralize his mutant power, but before this could be explained to him a freak tornado killed his parents when he was 15.\n\nMadrox spent the next six years alone caring for his parents' farm. When he was 21, malfunctioning control elements in the suit caused a power surge that released his inhibited power and caused the suit to begin absorbing ambient electrical energy. Confused, frightened, and driven mad by isolation, Madrox felt himself drawn to New York City. There, he clashed with the [[Fantastic Four]] until Xavier arrived to defuse the situation. With the help of Xavier and the Fantastic Four's [[Mister Fantastic|Reed Richards]], Madrox's suit was repaired and he accompanied Xavier back to his mansion in Westchester. There, Madrox's temporary madness was cured and, after learning to cope with his powers, he was invited to join the [[X-Men]]. He declined, and instead accompanied Xavier to [[Muir Island]] where he became a laboratory assistant to mutant researcher Doctor [[MacTaggert, Moira|Moira MacTaggert]]. Madrox's ability proved invaluable to MacTaggert, and he quickly became a regular fixture on Muir. Unfortunately, Madrox also found himself battling against threats such as the [[Glossary:A#alien|alien]] [[Eric the Red (Davan Shakari)|Eric the Red]] and the reality-altering mutant [[Proteus]], who possessed one of Madrox's duplicates in order to escape confinement on Muir. Proteus's possession instantly killed the duplicate, and for the first time Madrox felt the severe [[Glossary:P#psychic|psychic]] backlash this caused. After Proteus was defeated, Madrox again declined to join the X-Men, preferring to remain on Muir with Moira and her lover, the X-Man [[Banshee]]. Soon after, Banshee's daughter [[Siryn]] came to live on Muir, and she and Madrox ultimately grew close.\n\nEventually, one of Madrox's duplicates sought to remain apart from the original and live his own life. To this end, he drugged the original Madrox and joined Moira and Siryn on a trip to the U.S. to search for [[Sunspot]] and [[Warlock (Technarchy)|Warlock]], two missing members of the [[New Mutants]]. Eventually finding the runaway mutants as members of the [[Vanisher (Telford Porter)|Vanisher's]] teenage gang, the Fallen Angels, the duplicate Madrox and Siryn were persuaded to join by the alien [[Ariel (Fallen Angels)|Ariel]]. During their time with the group, the duplicate Madrox and Siryn engaged in a brief romance. Eventually, the true nature of the Fallen Angels was revealed to be a ruse by aliens from the Coconut Grove [[Glossary:D#dimension|dimension]] who sought to cure their race's stalled evolution by experimenting on mutants. Defeating the aliens, the team returned to [[Earth]], but apparently disbanded soon after. The duplicate and Siryn rejoined Moira at the [[Xavier Institute For Higher Learning|Xavier Institute]] to return to Muir; however, the duplicate had no desire to be reabsorbed and so created another duplicate to take his place on the return trip while he secretly remained in the U.S.\n\nLater, the original Madrox was possessed by the [[Glossary:P#psionic|psionic]] entity the [[Shadow King]] during the [[Glossary:S#super-villain|villain's]] takeover of Muir; after his defeat Madrox joined the government-sponsored [[X-Factor]] team. Unknown to Madrox, the duplicate that had joined the Fallen Angels years before had since found a place in the Nasty Boys, a team of super-powered mercenaries employed by [[Glossary:G#genetics|geneticist]] [[Mister Sinister]]. With the help of Senator Stephen Shaffran, a.k.a. [[Ricochet (Stephen Shaffran)|Ricochet]], a mutant with the ability to turn other mutants' powers and fears against them, the duplicate convinced the Nasty Boys, and Madrox himself, that he was the original. Madrox merged with the duplicate, but it was a ruse; he \"disassembled\" the duplicate from the inside and remained the dominant personality in order to expose Shaffran and stop Sinister. \n\nLater, when most of the team were busy with another assignment, Madrox and his teammate [[Quicksilver]] were sent to investigate a murder case in Maine in which the prime suspect was a young mutant named Rachel Argosy, a.k.a. [[Rhapsody]], who had been fired from her music teaching job after turning blue and first manifesting her ability to entrance others with music. The man responsible for terminating her employment was found dead two days later, with Rhapsody apprehended at the scene of the crime. Exposed to the effects of Rhapsody's power, Madrox became convinced of her innocence and was set to break her out of prison when the truth was revealed. Rhapsody had used her power on the victim in an effort to make him see the error of his decision to fire her, only to accidentally cause his death.\n\nFollowing an attempted assassination of Xavier supposedly by the mutant soldier from the future, [[Cable]], X-Factor and the X-Men teamed up to capture Cable's team of young mutants, [[X-Force]]. Among X-Force's number was Siryn, who confronted Madrox over their past relationship. Madrox revealed to Siryn that although he retained all the memories of her relationship with his renegade duplicate, he possessed none of the related emotional attachment.\n\nAmong his X-Factor teammates, Madrox formed a close bond with Guido Carosella, a.k.a. [[Strong Guy]]. The pair shared an odd sense of humor and often joked around much to team leader [[Havok|Havok's]] chagrin. A psychiatric analysis by [[Doc Samson|Doctor Leonard Samson]] ultimately revealed the reason for Madrox's humorous attitude. His living alone for many years as a child created an almost pathological need for attention to ensure he would never be alone again, and he was willing to do virtually anything - whether it be telling jokes, playing gags, or creative use of dupes - to get people to notice him.\n\n[[image:MultipleMan03.jpg|thumb|left|180px]]During a subsequent mission with X-Factor to the island nation of [[Genosha]], one of Madrox's duplicates contracted the deadly [[Glossary:L#Legacy Virus|Legacy Virus]]; when reabsorbed, it was believed Madrox himself was infected. The mutant prophetess [[Haven]] offered to cure Madrox of the Virus, but the attempt failed and he seemingly died. However, Madrox unconsciously stayed split into separate bodies, ensuring that the Virus would be contained in one body and not duplicate into the others. When the infected body died, the shock of its death caused Madrox to lose his memory. Later, X-Factor was sent on a mission to apprehend a mysterious figure that was revealed to be Madrox, alive and well with his memory restored. Madrox had been recruited by elements of the U.S. government that wanted to turn him into the ultimate secret agent, training him to become a one-man army. Madrox ultimately rejoined X-Factor until the team's disbanding after the apparent death of its leader, Havok. He then returned to Muir Island where he was reunited with both Moira and his X-Factor teammate [[Wolfsbane]]. Madrox subsequently worked in Genosha at the behest of Professor X to monitor the situation there after the rise to power of mutant activist [[Magneto (Magnus)|Magneto]].\n\n\nMadrox was then recruited by Banshee into the paramilitary X-Corps organization for which Madrox created duplicates to function as support staff performing duties ranging from communications monitoring to gunship pilots. Following the restructuring of the X-Corps into the [[X-Corporation]] global mutant search and rescue organization, Madrox worked with the group's European branch for a time until a pitched battle against the living bacterial consciousness known as [[Huntsman|Weapon XII]] apparently cost the life of his teammate [[Darkstar]]. Madrox subsequently quit and struck out on his own, sending \"long-term explorer dupes\" around the world to learn new skills before returning to be reabsorbed. Madrox then established XXX Investigators (later the name was changed to X-Factor Investigations), in [[Mutant Town]] with Guido and Wolfsbane, both Madrox's friends of the previous X-Factor. His first case was to investigate the murder of one of his duplicates by an assassin named [[Clay (unrevealed)|Clay]], who also possessed the ability to create duplicates of himself, which led Madrox to Chicago and Sheila DeSoto, fiancée of multi-millionaire industrialist Edward Vance. Unbeknownst to Madrox, who had become romantically involved with Sheila, she was the one who had hired Clay to prevent Madrox from interfering in her plans to take control of the Chicago crime syndicate. Sheila was ultimately killed after she was revealed to be a self-styled highly evolved mutant.",
        "categories": [
            "Heroes",
            "X-Men",
            "Mutants",
            "Marvel Knights",
            "Civil War"
        ]
    }
}