{
    "id": 1011314,
    "name": "Junta",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/6/20/4c002e5a298b8",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011314",
    "comics": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011314/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/20497",
                "name": "Crew (2003) #3"
            }
        ],
        "returned": 1
    },
    "series": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011314/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/553",
                "name": "Crew (2003)"
            }
        ],
        "returned": 1
    },
    "stories": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011314/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/43908",
                "name": "Cover #43908",
                "type": "cover"
            }
        ],
        "returned": 1
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011314/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011314/junta?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Junta?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Manuel Diego Armand Vicente",
        "identity": "No dual identity",
        "occupation": "freelance espionage agent; (formerly) writer, secret police agent",
        "place_of_birth": "Queens, New York City, New York",
        "groups": "Formerly [[Defenders]], The [[Crew]]",
        "citizenship": "Vulcan Domuyan, U.S.A. (dual citizenship)",
        "education": "Military training, U.S. intelligence training",
        "aliases": "Danny Vincent",
        "relatives": "Unnamed father, mother",
        "height": "Unrevealed",
        "weight": "Unrevealed",
        "eyes": "Brown",
        "hair": "Brown",
        "powers": "The origin of Danny Vincent's powers remain unrevealed. His body actually exists in a \"gravity well,\" making his body naturally out of synch with reality. In fact, without a way to control the gravity field around him, Danny would implode, drawing him and anything within an eighth-mile radius into a miniature black hole. To safeguard against this, Danny wears a mechanical belt. Nevertheless, he cannot avoid the fact that the intense gravitational forces that are a part of his body will cause anyone in physical contact with his skin to experience disorientation an nausea, usually enough to instantly pass out.",
        "abilities": "Junta is a world-class spy, specializing in infiltration, information gathering, and false identities.",
        "weapons": "Conventional weaponry as needed per mission",
        "paraphernalia": "Danny wears a belt device to regulate his powers; it monitors and synchronizes his contact with the world around him. By adjusting this belt, Danny can avoid most kinds of attack, bending in a variety of gravity-defying moves or stopping/deflecting projectiles from their path. In the same manner, Danny can walk on walls and ceilings, lessen his rate of falling, and even phase through objects.",
        "debut": "Black Panther #9 (1999)",
        "origin": "",
        "significant_issues": "Joined Defenders (Last Defenders #3, 2008)",
        "main_image": "Junta.jpg",
        "bio_text": "Manuel Diego Armand Vicente was born in the United States but raised in his parents' native South American country of Vulcan Domuyo. A postage-stamp city-state built around an active volcano, Vulcan Domuyo is a lot like pre-Castro Cuba: corrupt to the bone, with the very rich, very corrupt well-to-do elite class lording it over a terribly impoverished peasant population living in the shadow of certain death from the volcano.",
        "bio": "Manuel Diego Armand Vicente was born in the United States but raised in his parents' native South American country of Vulcan Domuyo. A postage-stamp city-state built around an active volcano, Vulcan Domuyo is a lot like pre-Castro Cuba: corrupt to the bone, with the very rich, very corrupt well-to-do elite class lording it over a terribly impoverished peasant population living in the shadow of certain death from the volcano.\n\nVicente later grew to become a high-ranking officer of Los Cuarenta Ladrones (the LCL), meaning \"the Forty Thieves,\" a dismissive colloquialism for El Ministerio de Asuntos Internacionales Armó Servicio de Vulcan Domuyo-- the Vulcan Domuyan Secret Police. Moreover, due to his dual citizenship, Vicente (who used the alias Danny Vincent) became an agent for U.S. intelligence, writing books for the National Security Agency. Danny regularly did black bag operations for the LCL and the Americans with the code-name Junta.\n\nIn a recent operation, Danny accepted money from a CIA front, by way of a Russian mobster, to fund an operation to de-stabilize the African nation of Ghudaza. Supposedly, this would be nearly impossible to trace back to the American intelligence community, who hoped to ultimately de-stabilize Ghudaza's neighboring nation, Wakanda, in order to place their own operatives inside the walls of this mysterious and highly advanced kingdom. Unfortunately, Danny's operation caused Ghudaza to degenerate into a brutal civil war and massive ethnic genocide, sending a flood of refugees into [[Wakanda]]. Danny's intelligence career was dealt a severe blow, although his American contact, and his associate, the Ghudazan cleric [[Achebe]], did indeed use this situation to gain control of Wakanda (at least until its rightful ruler, the hero [[Black Panther (T'Challa)|Black Panther]], regained control.)\n\nLater, the LCL, the Russian mob, and the rogue CIA agents Danny worked with earlier formed a shadowy transcontinental cooperative called XCON. XCON began replacing highly-placed political figures with clone-like duplicates, gaining control of Canada before targeting the United States. XCON also began killing key intelligence operatives, causing Danny to flee his former employers of the LCL. As insurance for his own safety, Danny took with him the President of the United States, as XCON had replaced him with a duplicate some weeks before. Danny sought help from operatives of the Black Panther, ultimately teaming with the Panther's ally, [[Queen Divine Justice]]. After staying one step ahead of the agents of XCON, Danny and Queen Divine Justice finally returned the President safely to the White House at the same time the Black Panther and his ally [[Iron Man (Anthony Stark)|Iron Man]] managed to topple XCON.\n\nUnfortunately, Danny was left a pariah, as neither the LCL, his U.S. contacts, nor any espionage agency would talk to him. Danny found his way to his birthplace in Queens, New York, turning to freelance mercenary work, hoping to find one ultimate job that might catapult him back once more into the higher echelons of the intelligence community.\n\nA former contact of Danny's, Moishe, offered him a large sum if he would investigate the derailment of the so-called \"Money Train,\" a subway that carried the payoff for hundreds of crooked police officers, judges, and politicians on behalf of the powerful 66 Bridges Gang. Danny correctly guessed, however, that this was merely a setup from 66 Bridges' crime lord [[Triage]], and he confronted Triage directly, agreeing, on his own terms, to get to the Money Train before any cops or rival gang warlords.\n\nIn fact, the subway was derailed by [[Rhodes, James|James Rhodes]], who had declared war on the 66 Bridge Gang, as they were also responsible for the death of his sister. The derailment had sparked a running gun battle between police and street gangs. One of the police officers was [[Cole, Kasper|Kasper Cole]], who investigated the scene as the White Tiger. Danny and the White Tiger found themselves embroiled in the battle between police and gang warlords. Rhodes got the drop on both of them, but he wound up helping them escape the cops, who eventually managed to take control of the situation.\n\nRhodes had actually placed a chemical tracer on the Money Train so as to trace the agents of the 66 Bridges Gang to the top echelons. Rhodes pulled together Danny as well as the White Tiger and Justice (the local Muslim minister [[Josiah X]]) into an [[Crew|erstwhile team]] as each of them had reasons of their own to see the end of the 66 Bridges Gang. Danny, for his part, now saw the opportunity to hand Triage over to his superiors in the 66 Bridges of Chicago, earning back his place in serious underworld connections. The team managed to bring to justice scores of crooked contacts, finally ending with Triage. After a climactic battle, the band of heroes ultimately managed to defeat Triage and Danny personally turned him over to the authorities, despite the fact that it might irrevocably damage his mercenary reputation and sever all his former connections.",
        "categories": [
            "Heroes",
            "International",
            "Marvel Knights"
        ]
    }
}