{
    "id": 1011395,
    "name": "Talon (Fraternity of Raptors)",
    "description": "Falling to Earth wrapped in a ball of flame, Talon crash landed next to the home of Chris Powell, the young hero known as Darkhawk.",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/40/image_not_available",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011395",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011395/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011395/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011395/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011395/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011395/talon_fraternity_of_raptors?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Talon_(Fraternity_of_Raptors)?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "blurb": "",
        "real_name": "Shir Ydrn Talonis",
        "aliases": "Lord Talon; impersonated Araki,  and Smasher",
        "identity": "Secret",
        "occupation": "Agent of the Fraternity of Raptor",
        "citizenship": "Shi'ar Empire",
        "place_of_birth": "Unrevealed",
        "relatives": "None",
        "groups": "[[The Fraternity of Raptors]]",
        "education": "Unrevealed, but the Datasong of Talon's armor provides him with the knowledge of the universe, and all Raptors are educated in black sorcery",
        "height": "6'1\"",
        "weight": "180 lbs.",
        "eyes": "Unrevealed",
        "hair": "Unrevealed",
        "powers": "Talon, because of his Raptor armor, has a vast array of [[Glossary:S#superhuman|superhuman]] abilities such as the power of flight. Talon also possesses strength, durability, stamina and endurance far beyond normal levels, but to what degree has yet to be determined. He can fire laser blasts from both the amulet in his chest and his helmet's visor, and he can survive in space for extensive periods of time. Talon can use his amulet to form force shields in defense of himself, or another in close proximity. It can also be assumed, like the hero [[Darkhawk]], if Talon was injured and transformed back into his original state, he would be completely restored upon returning to his armored form. It is also likely Talon is either extremely long-lived or [[Glossary:I#immortal|immortal]].",
        "abilities": "Talon is a highly skilled strategist, flyer and combatant - both armed and unarmed",
        "weapons": "Talon's armor enables him the use of a multitude of weapons, including missiles and laser cannons as well as his basic razor wings and slashing claws. With its reconfiguration mode, it is entirely possible the combination and varieties of weaponry could be endless. Talon has a grappling hook and cable which he can use as an offensive weapon, or shape into the form of a winged bird for scouting purposes, and he can tune his helmet to see through the automation's eyes. Talon's armor has a mode to disguise himself as anyone he wishes.",
        "paraphernalia": "Talon is in possession of an amulet which is his direct link to the Raptor armor he wears. Talon's amulet also appears to be able to influence control over other amulets like the one in Darkhawk's possession.",
        "debut": "War of Kings: Darkhawk #1 (2009); (identified) War of Kings: Darkhawk #2 (2009)",
        "origin": "",
        "significant_issues": "Fell to Earth and met Darkhawk (War of Kings: Darkhawk #1, 2009); Fought with and against Darkhawk before leading him into the Negative Zone for training (War of Kings: Darkhawk #2, 2009); Tricked Darkhawk out of his armor in order to summon Razor (War of Kings: Ascension #1, 2009); Talon and Razor stole the Cosmic Control Rod to make a deal with Blastaar (War of Kings: Ascension #3, 2009); Saved Vulcan and ensured him he would remain in control of the Shi'ar empire (War of Kings #4, 2009); versus Darkhawk until Talon's host seemingly sacrificed himself along with Talon's crystal (War of Kings: Acsension #4, 2009); Posed as an adviser to Gladiator (War of Kings: Who Will Rule?, 2009); Disguised himself as Smasher to rescue two more amulets from The Fault (Realm of Kings: Imperial Guard #4, 2010); recruited two more members into the Fraternity of Raptors (Realm of Kings: Imperial Guard, 2010)",
        "main_image": "Talon_(Raptor).jpg",
        "bio_text": "Falling to [[Earth]] wrapped in a ball of flame, Talon crash landed next to the home of Chris Powell, the young hero known as [[Darkhawk]]. Much to Powell's surprise, Talon bore a similar resemblance to his armored form, but Chris thought he was the last. Talon didn't have time to explain at the moment because he was followed to Earth by a [[Hunter Drone]], a massive robotic creature designed to destroy their kind – [[The Fraternity of Raptors]]. Together, Talon and Darkhawk fought the Drone, and after Darkhawk instinctively reconfigured his armor into a more powerful form, the two of them destroyed the beast.",
        "bio": "Falling to [[Earth]] wrapped in a ball of flame, Talon crash landed next to the home of Chris Powell, the young hero known as [[Darkhawk]]. Much to Powell's surprise, Talon bore a similar resemblance to his armored form, but Chris thought he was the last. Talon didn't have time to explain at the moment because he was followed to Earth by a [[Hunter Drone]], a massive robotic creature designed to destroy their kind – [[The Fraternity of Raptors]]. Together, Talon and Darkhawk fought the Drone, and after Darkhawk instinctively reconfigured his armor into a more powerful form, the two of them destroyed the beast. \n\nDuring the battle, Powell's family was hurt and hospitalized. Darkhawk blamed their injuries on Talon, so the next time they met, Darkhawk attacked him. Talon was the superior fighter, and subdued Darkhawk as he explained his intentions. Talon traveled a great distance to find and teach Chris exactly how to use his Darkhawk armor, especially since it wasn't designed for humans. He briefly told him of The Fraternity of Raptors, and how they were the only two that remained. Talon also informed Powell that they were the only ones who could save the future of the universe. Darkhawk calmed himself and listened to what Talon had to say. It wasn't long before Darkhawk was following Talon into the [[Negative Zone]] to begin his training.\n\nUpon entering the Zone, Talon and Darkhawk trespassed in the territories belonging to [[Catastrophus]] – a minor lord in the service of [[Annihilus]]. They were attacked immediately by Catastrophus' minions, and Chris was put off by how easily Talon was able to exterminate his opponents. Again, Darkhawk fought with his mentor, and again, he was easily defeated. Talon offered all the praise and encouragement of a true teacher with the hope his pupil would succeed, and soon Talon led Darkhawk to the fortress of Catastrophus. After scouting the area, Talon led the charge against overwhelming odds, and Darkhawk was soon overrun. Darkhawk cried out for help, but Talon urged him to reconfigure his armor, claiming he was unable to aid him. In actuality, Talon was watching from a safe distance on the sidelines. Darkhawk did indeed reconfigure his armor and slaughtered his foes. Talon resurfaced, but Darkhawk was angered he was forced to murder living beings. Then suddenly, Darkhawk, now fully bonded with his armor, saw visions of what The Fraternity of Raptors really were, and it wasn't entirely how Talon described. Darkhawk attacked Talon for a third time, but Talon’s experience beat Powell down, even in his more powerful form. Then Talon confessed he only needed Powell to bond with his amulet, so he could obliterate him from it – permanently. Once Talon forced Darkhawk out, he was able to summon the armor's true owner – [[Razor (Fraternity of Raptors)|Razor]]!\n\nDisoriented because of his extended stay within the [[Null Void]], Razor needed some time to get up to speed, but even as Talon debriefed him on their current state of affairs, the two Raptors continued to battle the forces of Catastrophus. Talon assured Razor what they were doing was a necessity, and eventually the two found themselves face to face with Catastrophus himself. The Insect King was more mouth than mettle, and he was killed almost instantly. However, it wasn't his death they were after, but rather what he was guarding. The [[Cosmic Control Rod]] was now in their possession, and they brought it to [[Blastaar]] in exchange for his help. The king of the Negative Zone needed further persuading, thinking he was invincible now that he had possession of the Rod, so Talon relinquished the item until such a time a bargain could be struck. Talon told Blastaar to lay siege to the worlds governed by [[Ravenous]] in order to gain the favor of [[Vulcan (Gabriel Summers)|Vulcan]]. Talon then departed to seek out the emperor of the [[Shi'ar]].\n\nTalon found his intended target just as he was about to be obliterated by one of the new [[Inhumans|Inhuman]] sentries, and saved Vulcan's life claiming the emperor was under his protection. Introductions were made, and explanations given about both Talon and the Fraternity of Raptors. The Raptors were founded to preserve the sanctity of the Shi'ar Imperium, and Talon had plans to keep Emperor Vulcan in power. That was until he saw exactly how demented Vulcan actually was. Talon gave his opinion on the state of the war, and with Vulcan unwilling to listen, Talon changed his mind about keeping him in power. Vulcan lashed out at Talon, but a quickly erected force field prevented Talon from being injured. Talon left the company of the Shi'ar to rejoin his Fraternity brother once more - unaware Darkhawk had resumed control over Razor's body again. \n\nUpon reuniting, Darkhawk revealed the truth about Razor's demise, and the Raptors battled for a final time. During the battle, Talon's host - an injured [[Skrulls|Skrull]] - forced the change back to his original state and made Darkhawk promise to hunt down the remaining crystals of the Fraternity and destroy them right before throwing himself into the engine core of a Shi'ar ship, seemingly destroying himself and Talon's crystal. Back on the Shi'ar home world, [[Gladiator (Kallark)|Gladiator]] tried to hold his people together while the Inhumans decided who would rule over the Shi'ar. One of his adviser's was already planting a seed which could lead to a war with Earth, but she appeared to be loyal to Gladiator. When the Inhuman, [[Crystal]], convinced Gladiator to become the new ruler of the Shi'ar people, the female adviser privately revealed herself to be Talon in disguise. Talon was content with their choice - for now.\n\nWith the creation of the [[The Fault|Fault]], Talon used his camouflage abilities to stow away aboard the star ship of the [[Starjammers]] in the guise of Guardsman, [[Smasher (disambiguation)|Smasher]], when Gladiator sent them on an exploration mission. Once there the group came under attack by several hostile entities, and Talon turned the chaotic situation to his advantage. He did some investigating of his own and found two more amulets which would birth more of his brethren. He made a major mistake by disabling the craft they flew into the Fault with, and his deception was uncovered by [[Mentor (alien)|Mentor]]. Acting on the orders of her new Praetor, [[Plutonia]] seized the amulets, holding them hostage, while Talon was questioned. The interrogation would have to wait as the [[Imperial Guard]] were attacked by the deadliest foe yet. If not for the intervention of Gladiator, all would have perished. Talon's fate was not assured as Gladiator demanded he pay for the murder of [[Neramani, Lilandra|Empress Lilandra]], but Talon swore it was Darkhawk who committed the crime. As their very survival came into question, Mentor and Plutonia volunteered to undergo the permanent bond with the amulets in order to increase their chances of making out of the Fault alive.",
        "categories": [
            "Cosmic",
            "Magic"
        ]
    }
}