{
    "id": 1011157,
    "name": "Skreet",
    "description": "The Proemial God Aegis revealed that Skreet was a Chaos Mite, a race of very small and powerful beings, which were deemed unstable by the Cosmic Consonance.",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/8/20/4c002f4a15c1c",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011157",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011157/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011157/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011157/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011157/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011157/skreet?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Skreet?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Skreet",
        "aliases": "None",
        "identity": "No dual identity",
        "occupation": "Galactic Mercenary, bounty hunter",
        "citizenship": "Panto-9",
        "place_of_birth": "Pyx",
        "relatives": "[[Diableri]] (creator)",
        "groups": "Partner of [[Cammi]], former partner of [[Thanos]] & the Wy'nkarian [[Lunatik (unrevealed)|Lunatik]]",
        "education": "Self educated through her eight billion years of existence.",
        "height": "4.3\"",
        "weight": "3.2 oz.",
        "eyes": "Pink",
        "hair": "Black",
        "powers": "Skreet is a very small and extremely powerful being. She has a nearly indestructible body. She has the ability of interplanetary flight through the small wings on her back. Skreet can also navigate the voids of space by emitting plasma burst from her hands, thus enabling her to reach light speed. Skreet has used her speed of flight as an offensive weapon, propelling herself into her enemy like a cosmic torpedo. Her plasma blasts were strong enough to affect both the Fallen One and the Silver Surfer.",
        "abilities": "She can survive in the vacuum of space without life support. As a [[Chaos Mites|Chaos Mite]] Skreet has extended life (immortality), she has existed since the beginning of creation.",
        "weapons": "",
        "paraphernalia": "",
        "debut": "Marvel Comics Presents #172 (1995)",
        "origin": "Unrevealed",
        "significant_issues": "Marvel Comics Presents #172 (1995); Marvel Comics Presents #173-174 (1995); Marvel Comics Presents #175 (1995); Cosmic Powers Unlimited #3 (1995); Lunatik#1-3 (1995, 1996); Thanos #9-12 (2004); Annihilation: Prologue (May 2006); Annihilation: Silver Surfer#1-4 (2006); Annihilation #1-4 (2006, 2007); Annihilation #6 (March, 2007); Annihilation: Heralds of Galactus #2 (May, 2007)",
        "main_image": "Skreet Head.jpg",
        "bio_text": "The origin of the being called Skreet is unknown. The Proemial God [[Aegis (Lady of All Sorrows)|Aegis]] revealed that Skreet was a [[Chaos Mites|Chaos Mite]]. The Mites were a race of very small and powerful beings, which were deemed unstable by the Cosmic Consonance. All of the Chaos Mites were thought to have been erased from the universe during the great purge. It is not clear if the Chaos Mites and the [[Chaos Sprites]] are one in the same. It is document that the Chaos Sprites were created by the [[Proemial Gods|Proemial God]] [[Diableri]]. They served as his eyes and ears. They were designed to sow chaos wherever there was order.",
        "bio": "The origin of the being called Skreet is unknown. The Proemial God [[Aegis (Lady of All Sorrows)|Aegis]] revealed that Skreet was a [[Chaos Mites|Chaos Mite]]. The Mites were a race of very small and powerful beings, which were deemed unstable by the Cosmic Consonance. All of the Chaos Mites were thought to have been erased from the universe during the great purge. It is not clear if the Chaos Mites and the [[Chaos Sprites]] are one in the same. It is document that the Chaos Sprites were created by the [[Proemial Gods|Proemial God]] [[Diableri]]. They served as his eyes and ears. They were designed to sow chaos wherever there was order.\n\nSkreet's early documented exploits were with the estranged being known as [[Lunatik (unrevealed)|Lunatik]]. He came from the planet [[Wy'nkar-7]]. Together they became very successful mercenaries. At one point they were employed by the [[Universal Cosa Nostrum]]. Their most notable mission was to recover [[Addictum]]. This was a drug created by the Universal Cosa Nostrum's agent known as [[Lupal]]. The drug turned its users blood into napalm when they could not get their fix. Skreet and Lunatik tracked Lupal to [[Begal]], an insignificant planet, located in a little known star system far from developed space. Upon their arrival on the planet they learned that Lupal had committed suicide.\n\nThey were confronted by the former [[Heralds of Galactus|Herald of Galactus]] the [[Silver Surfer]]. The Silver Surfer and Lunatik engaged in a fierce battled. Skreet joined the battle by blasting the Surfer with a violent plasma blast. The Surfer returned the blast only to find that his Power Cosmic had no effect on Skreet. Lunatik quickly knocked out the distracted Silver Surfer. Skreet and Lunatik determined that Lupal had placed tattoos on a tribe known as the [[Children]]. This was his way of hiding the secret formula. Skreet and Lunatik slaughtered the entire tribe to harvest the tattoos, in order to decode the formula. Once the Silver Surfer recovered he destroyed the formula and he blasted Skreet far enough away to defeat Lunatik. \n\nSkreet and Lunatik landed on another planet were Lunatik purchased the [[Intergalactic Star Sled]] from [[Murray]]. Skreet entered a card game with [[Champman]], in which she won the Drogs to pull the Sled. They soon traveled to the planet [[Earth]] in search of [[Tyrk, Arisen|Arisen Tyrk]] also known as Lunatik. Tyrk was aging and sickly, they found him in the hospital, where Lunatik killed him. Skreet and Lunatik spent a short time with the [[Avengers]], during that time she was mistaken for the [[Wasp|Janet van Dyne]], by [[Yellowjacket (Henry Pym)|Giant-Man]]. Not long after that they returned to space and were hired by [[Lady Fynn-Geres]] of the [[Interstel Church of Perpetual Annoyance]]. She had offered them seventy five percent of twelve million credits. After defeating their foe [[Ictus the She Wolf]] Lunatik became the ICPA's pope.\n\nLunatik eventually betrayed Skreet, by withholding her share of the big bounty. He turned Skreet over to the authorities (possibly [[Star-Lord (Peter Quill)|Peter Quill]]), who imprisoned her in the [[Kyln]] prison planetoids. The Kyln housed many highly charged cosmic beings, such as the [[Proemial Gods]], [[Antiphon the Overseer|Antiphon]], Aegis and [[Tenebrous]]. The very first Herald of Galactus, the [[Fallen One (unrevealed)|Fallen One]] was also a prisoner there. Skreet was freed from a cocoon while on the planetoid by the [[Beyonder|Kosmos]] (also known as the Maker or Beyonder), who basically threw her away. She landed in a sandy desert area of the planet. The Maker shrunk down several other inmates who confronted her. The ferocious [[Mynx]] was among them. They were all tossed away just like Skreet. Mynx was caught in mid air by Skreet. She later witnessed [[Thanos]] being blasted through the air by the Maker.\n\nSkreet waited for Thanos to recover, she somehow knew that he wasn't dead. The two of them sought Kosmos out, and brought her down in battle. Skreet was about to finish her off, Thanos intervened and managed to manipulate her mind by some unknown method. Peter Quill was also imprisoned on the planetoid for the catastrophe he caused while trying to capture the Fallen One. Who was in the company of the [[Shi'ar]] warrior known as [[Gladiator (Kallark)|Gladiator]]. Peter Quill informed them that the Fallen One had been freed by Kosmos' power. Thanos and Skreet pursued the Fallen One who was looking for Galactus in a quest for revenge. Skreet and Thanos battled the Fallen One, at the conclusion of the battle the Fallen One was converted into Thanos' servitude. Skreet was not in agreement with this decision. Thanos and Skreet were last seen in allegiance with the universal conqueror known as [[Annihilus]].",
        "categories": [
            "Annihilation",
            "Cosmic",
            "Women"
        ]
    }
}