{
    "id": 1011177,
    "name": "Forgotten One",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/8/70/4c002f332fb1f",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011177",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011177/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011177/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011177/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011177/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011177/forgotten_one?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Forgotten_One?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Unrevealed",
        "identity": "Secret",
        "occupation": "Warrior, adventurer, monster-slayer",
        "place_of_birth": "Unrevealed",
        "groups": "(Formerly) [[Avengers]], [[Eternals]]",
        "citizenship": "[[Olympia]]",
        "education": "Unrevealed",
        "aliases": "Gilgamesh, Hero, Hercules, Samson, many other aliases as yet unrevealed",
        "relatives": "Unrevealed, possibly none",
        "height": "6'5\"",
        "weight": "260 lbs.",
        "eyes": "Blue",
        "hair": "Black",
        "abilities": "The Forgotten One was skilled at killing monsters and non-sentient beings as well as being a talented hand-to-hand combatant.",
        "weapons": "The Forgotten One has wielded various hand-held weapons and Eternal weaponry at various times.",
        "paraphernalia": "The Forgotten One has worn various suits of armor most of which he designed himself. He has also worn a suit of space armor, designed for him by Sprite, which is very durable allowing him to survive in a vacuum.",
        "powers": "Like all Eternals, the Forgotten One was sustained by cosmic energy and was virtually immortal and indestructible. He could manipulate energy allowing him to harness gravitons in order to levitate and fly at speeds up to Mach one. He possessed superhuman strength allowing him to lift over 100 tons. Gilgamesh could also release cosmic energy through its hands and eyes.",
        "debut": "Eternals #13 (1977)",
        "origin": "",
        "significant_issues": "",
        "main_image": "Forgottonone.jpg",
        "bio_text": "In ancient times, a mighty [[Eternals|Eternal]] roamed the Earth aiding ordinary human beings by overthrowing tyrants and slaying dangerous beasts. Human beings of those times called him by different names, sometimes mistaking him for other heroic figures. For example, it is known that the Forgotten One was mistaken for the Olympian god Hercules in ancient Greece, and, at other times, he has been known as Hero, Samson, and Gilgamesh, among others.",
        "bio": "In ancient times, a mighty [[Eternals|Eternal]] roamed the Earth aiding ordinary human beings by overthrowing tyrants and slaying dangerous beasts. Human beings of those times called him by different names, sometimes mistaking him for other heroic figures. For example, it is known that the Forgotten One was mistaken for the Olympian god Hercules in ancient Greece, and, at other times, he has been known as Hero, Samson, and Gilgamesh, among others.\n\nEventually [[Zuras]], leader of the Eternals, confined the Forgotten One to a sector of the Eternal city of [[Olympia]]. It is said that Zuras' reason for this action was the Forgotten One's pride and his insistence on intervening in human affairs. As yet, no details of these charges have been revealed. The Forgotten One remained banished to this sector, which the other Eternals shunned, for centuries.\n\nRecently, while virtually all of the Eternals were meeting in the form of the [[Uni-Mind]], the [[Deviants]] launched a spacecraft containing a powerful energy bomb in the hope of destroying the mother ship of the Fourth Host of the [[Celestials]]. [[Sprite (Eternal)|Sprite]], an Eternal left behind to monitor Earth, learned of the Deviants' plan and feared that the Celestials would retaliate by wreaking havoc on Earth. Sprite sought out the Forgotten One and equipped him with an armored costume and a spaceship. The Forgotten One traveled into space, and the Fourth Host's leader, the One Above All, teleported him into the Deviants' spacecraft. The Forgotten One wrecked the energy bomb and its spacecraft just before the moment of detonation. Then, floating stunned in space, the Forgotten One was drawn into the mother ship of the Fourth Host.\n\nSome time later, the Forgotten One reappeared on Earth and was temporarily blinded (the cause of this blindness remains a mystery since Eternals cannot be injured by conventional means). Possibly the power released by the energy bomb as he wrecked it was sufficient to blind him. He delivered what he said was a message from the Celestials to the Eternals, which was to not interfere with the Celestials' plans. In recognition of the Forgotten One's bravery, Zuras restored his freedom to him and renamed him \"Hero.\"\n\nBut the mission that the Celestials gave the Forgotten One went far beyond delivering that simple message. Exactly what that mission is remains unrevealed. However, in order to carry that mission out, the Forgotten One, once again with full sight, went to the city of the Deviants in undersea [[Lemuria]] some months later. Disguised in a hood and robes, the Forgotten One accompanied [[Kro]], the new ruler of the Deviants, on his mission to the Pyramid of the Winds.\n\nMore recently, the Forgotten One traveled to New York, during a time of [[Inferno (event)|demon invasion]]. He joined [[Captain America (Steve Rogers)|Captain America]] and [[Thor (Thor Odinson)|Thor]] in saving the son of [[Mister Fantastic]] and the [[Invisible Woman]], and remained with them to assemble a version of the [[Avengers]], whose ranks had then been depleted. He re-adopted the name Gilgamesh, at the prompting of Mister Fantastic. After several adventures with the Avengers, he sustained grave injuries in battle against the [[Lava Men]] and the extradimensional [[Blastaar]]. He was returned by the Avengers to Olympus to recuperate.\n\nGilgamesh was later kidnapped by the Avengers' archenemy [[Immortus]], posing as the time-traveling [[Kang]]. As part of Immortus' [[Crossing|ruse]] as Kang, he allowed Gilgamesh to be killed by the underling [[Newt]] to strike fear into the Avengers.",
        "categories": [
            "Heroes",
            "Avengers",
            "Deceased"
        ]
    }
}