{
    "id": 1011150,
    "name": "Paibok",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/3/30/4c002f617817e",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011150",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011150/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011150/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011150/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011150/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011150/paibok?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Paibok?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Paibok",
        "aliases": "Power Skrull",
        "identity": "Known to Skrull Empire",
        "occupation": "Former Captain in Skrull army and Espionage agent",
        "citizenship": "Skrull Empire",
        "place_of_birth": "Planet Tarnax IV, Tarnax System, Andromeda Galaxy",
        "relatives": "None",
        "groups": "(Formerly) [[Fearsome Foursome]] Former parnter of [[Devos]], former lover of [[Lyja]]",
        "education": "Graduate of Skrullian military academy",
        "height": "6'2\"",
        "weight": "615 lbs.",
        "eyes": "Green",
        "hair": "None",
        "powers": "Paibok has superhuman strength and has enhanced agility, stamina, durability, speed, and reflexes. Paibok also has the ability to fly, and his skin is also said to be as strong as steel.  Like all Skrulls, Paibok can shapeshift to a certain degree. However, unlike other Skrulls, Paibok has the ability to generate and hurl electricity. He also has the power to generate and manipulate extremely cold temperatures; with this he can freeze opponents, create ice structures and shoot ice projectiles at his opponents. Paibok also has the ability to hypnotize those around him, although the limits of his hypnosis powers have not been tested.",
        "abilities": "Paibok is a trained starship pilot and is skilled in all forms of armed and unarmed combat known to Skrulls.",
        "weapons": "",
        "paraphernalia": "",
        "debut": "Fantastic Four #358",
        "origin": "",
        "significant_issues": "",
        "main_image": "Paibok.jpeg",
        "bio_text": "Paibok was a captain in the [[Skrull]] army who sent [[Lyja]], his ex-lover to Earth to impersonate [[Masters, Alicia|Alicia Masters]] in order to infiltrate the [[Fantastic Four]]. Months after Lyja arrived she began to have feelings for [[Human Torch (Johnny Storm)|Johnny Storm]], the Human Torch and started to change her mind about betraying the team. However Paibok demanded she bring the Fantastic Four to his base on [[Warworld]]. Lyja agreed and lead the four heroes to Warworld where Paibok faced them. As the battle started it seemed as if Paibok was about to win, but due to some fast thinking the Fantastic Four managed to blow up Warworld and end Paiboks' scheme.",
        "bio": "Paibok was a captain in the [[Skrull]] army who sent [[Lyja]], his ex-lover to Earth to impersonate [[Masters, Alicia|Alicia Masters]] in order to infiltrate the [[Fantastic Four]]. Months after Lyja arrived she began to have feelings for [[Human Torch (Johnny Storm)|Johnny Storm]], the Human Torch and started to change her mind about betraying the team. However Paibok demanded she bring the Fantastic Four to his base on [[Warworld]]. Lyja agreed and lead the four heroes to Warworld where Paibok faced them. As the battle started it seemed as if Paibok was about to win, but due to some fast thinking the Fantastic Four managed to blow up Warworld and end Paiboks' scheme. \n\nPaibok later formed an alliance with [[Devos]] the Devastator in order to defeat the Fantastic Four. Lyja was still with the Fantastic Four at the time and met with Paibok in secret, who granted her superhuman powers. He then ordered her to kill the Human Torch. She agreed for the moment and along with Devos and Paibok attacked the Torch at [[Empire State University]]. The resulting battle caused massive damage to the surroundings and half of the University was burned to the ground. Paibok, Devos, and Lyja then witnessed the Fantastic Four fighting an alternate version of themselves. As the battle continued Lyja saw Johnny get hurt and realized her love for Johnny was true. She then turned on Paibok and Devos as the real Fantastic Four triumphed. Realizing Devos and himself were no match for Lyja and the Fantastic Four the two retreated. Later Devos and Paibok attacked the Human Torch at his trial and during the battle the two were forced to retreat.\n\nTime passed and Paibok grew bitter towards the Torch for stealing his lover. Devising a plan he formed the [[Fearsome Foursome]], whose members included [[Klaw]], Devos, and [[Huntara]]. The Foursome then attacked the Fantastic Four and Lyja at the [[Baxter Building]]. During the fight Paibok managed to teleport the two teams to the new Skrull home world were the Fantastic Four and Lyja became slaves. However his victory was short lived when Devos turned on him and revealed his plot to destroy all Skrulls. In order to save the Skrull race Paibok managed to send Devos and himself into sub-space, apparently killing them.\n\nHowever Paibok survived and fought against the Human Torch and the cloned [[Scarlet Spider (Ben Reilly)|Spider-Man]] alongside a multi-colored [[Venom]] spawn. He then returned and forced Skrull scientists to enhance his already fearsome powers. With these new powers he led a small band of renegade Skrulls to Earth in order to capture the infant Watcher, [[Talmadge]]. As he was about to capture the young Watcher, [[Kree]] forces, including [[Staak The Evolver]] and the [[Thing (Benjamin Grimm)|Thing]] managed to halt his plans. During the battle that followed Paibok was defeated and taken prisoner by the Kree. \n\nOn his way to the prison, [[Kyln]] the transport ship crashed on Earth. Freed by the crash Paibok allied himself with the [[Blood Brothers]] and [[Lunatik]] in order to rebuild the ship. However he turned himself over to the intergalactic police when he was confronted by [[Drax]].\n\nNot long after being incarcerated within Kyln the [[Annihilation|Annihilation Wave]] hit the Kyln freeing Paibok. Somehow [[Annihilus]] gained control of Paibok and throughout the Annihilation ordeal Paibok worked for Annihilus. However as soon as Annihilus was defeated by [[Nova (Richard Rider)|Nova]], his forces were free from his control, including [[Terrax]] and Paibok. The two teamed together and escaped from their former masters, landing on a planet inhabited by [[Centaurians]]. There Paibok and Terrax helped liberate the locals from a cosmic monster. After the battle with the monster Paibok and Terrax went their separate ways.\n\nPaibok's current whereabouts are unknown.",
        "categories": [
            "Cosmic",
            "Villains",
            "Fantastic Four",
            "Annihilation"
        ]
    }
}