{
    "id": 1011063,
    "name": "In-Betweener",
    "description": "",
    "modified": "2011-05-23T16:36:40-0400",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/9/60/4c0030f999ecb",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011063",
    "comics": {
        "available": 3,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011063/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17546",
                "name": "Avengers (1998) #60"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/1098",
                "name": "Avengers Vol. 1: World Trust (Trade Paperback)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/38981",
                "name": "Vengeance (2011) #3"
            }
        ],
        "returned": 3
    },
    "series": {
        "available": 3,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011063/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/354",
                "name": "Avengers (1998 - 2004)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/158",
                "name": "Avengers Vol. 1: World Trust (2003)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/14720",
                "name": "Vengeance (2011)"
            }
        ],
        "returned": 3
    },
    "stories": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011063/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/37461",
                "name": "Chaos & Order",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/94746",
                "name": "Vengeance (2011) #3",
                "type": "cover"
            }
        ],
        "returned": 2
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011063/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011063/in-betweener?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/In-Betweener?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "In-Betweener",
        "identity": "Existence is not known to the general populace of Earth",
        "aliases": "The Barrier between Dichotomies, He Who Stands in Shadow, the Separator of Actualities, Ankh the Wind-Giver, Ankh the Sun Holder, Ankh the Cosmic All of Our Dimension",
        "occupation": "Servant of the conceptual entities [[Lord Chaos]] and [[Master Order]]",
        "place_of_birth": "Unrevealed",
        "groups": "None",
        "citizenship": "Inapplicable",
        "education": "Unrevealed",
        "relatives": "Lord Chaos and Master Order (creators)",
        "height": "Variable",
        "weight": "Variable",
        "eyes": "(Right) black, (Left) white",
        "hair": "None",
        "powers": "The In-Betweener is the synthesis of all dualistic concepts in the universe, walking between the concepts of life and death, reality and illusion, good and evil, logic and emotion, and god and man. As a cosmic entity, he possesses immeasureable intelligence and stamina and incalcuable strength. His understanding of the forces of time and space is beyond human comprehension, although he is neither all-knowing or infallible (he is both strong and weak as well as wise and ignorant). He possesses virtually unlimited ability to manipulate time, space, matter and energy; and apparently the entire spectrum of psionic powers. He is immune to the effects of the Infinity Gems.",
        "weapons": "None",
        "paraphernalia": "None",
        "debut": "Warlock #9 (1975)",
        "origin": "Unrevealed",
        "significant_issues": "Warlock #10-11, Doctor Strange #26-28, Silver Surfer #17-18, Thanos Quest #1, Avengers #58-60",
        "main_image": "In-Betweener_Head.jpg",
        "bio_text": "",
        "bio": "A long time ago, the conceptual beings [[Lord Chaos]] and [[Master Order]] created the In-Betweener and charged him with the task of keeping the cosmos in balance for them. The In-Betweener was then sent out into the cosmos to fulfill its mission first by kidnapping the being [[Warlock, Adam|Adam Warlock]] in order to transform him into the [[Magus (Adam Warlock)|Magus]], but that planned ultimately failed when Warlock escaped by traveling through time and making the transformation impossible.\n\nThe In-Betweener later placed himself with a group of sorcerers known as the [[Creators]] as he planned to alter the fabric of reality by imposing his own concept of balance on the universe, but was opposed by the sorcerer supreme, [[Doctor Strange (Stephen Strange)|Doctor Strange]].  The two battled, but the In-Betweener ultimately lost when Doctor Strange alerted his masters to his scheme.\n\nAfterwards, the In-Betweener attempted to escape subservience to Lord Chaos and Master Order by allying himself with the [[Elders of the Universe]] with the plan to replace Galactus’s role in the universe.  However, [[Galactus]] did not agree with this plan and defeated the In-Betweener in battle allowing him to be imprisoned by Chaos and Order.  Later, the mad titan [[Thanos]] freed him from his prison only to trick the In-Betweener into surrendering his soul gem to him.  Although free for a while, the In-Betweener was captured by his masters once again.\n\nRecently, the would-be world conqueror called [[Scorpio (World Trust)|Scorpio]] learned that the last millennium had unraveled \"incorrectly,\" and that the [[Zodiac Key]] was needed to ensure the following thousand years would unravel correctly. He then used the Key to steal the capitals of the world, usurp the dimension the In-Betweener made for himself as a place of reflection, and divide the In-Betweener into his order and chaos selves because he needed the raw power of chaos and his realm to further his plans.  The [[Scarlet Witch (Wanda Maximoff)|Scarlet Witch]] had exhibited the characteristics of the In-Betweener when his chaos half tried to contact her because, as she explained to the other Avengers, he wanted to be rejoined with his order half.  The Scarlet Witch then used her magics to locate the order half of the In-Betweener, and the Avengers along with Namor, the [[Sub-Mariner]] set out to find him. When confronted, the order half, not wanting to be merged with his other self, sent several of the [[Avengers]] to the [[Ankh Dimension]], where they confronted Scorpio.  Namor then attacked the order half on his own and was easily defeated, but just as the order half claimed his victory the mighty [[Thor (Thor Odinson)|Thor]] returned to Earth and renewed the battle.  Thor was holding his own, but the Scarlet Witch’s patience had run out and she attacked, and forced open a dimensional portal to follow the other Avengers to Scorpio, and the chaos half of the In-Betweener.  The chaos half that was under the control of Scorpio was set free when the villain was defeated, and once it threatened the life of the Avenger, [[Vision]], the Scarlet Witch used her powers to merge the two halves together again.  Now whole, the In-Betweener returned the Avengers and the Earth’s cities and their peoples to their rightful places.  The In-Betweener also commented on how the Avengers were a great power for good, but spoke of an equally powerful evil that would come and many would die possibly warning them of the [[Avengers Disassembled|Scarlet Witch's mental breakdown]].  With that, the In-Betweener teleported away and has not been seen since.",
        "categories": [
            "Villains",
            "Cosmic",
            "Avengers"
        ]
    }
}