{
    "id": 1011088,
    "name": "Morlun",
    "description": "",
    "modified": "2013-11-01T16:42:27-0400",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/3/00/527411be42b48",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011088",
    "comics": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011088/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/3020",
                "name": "Amazing Spider-Man (1999) #526"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/5187",
                "name": "Spider-Man: The Other (Trade Paperback)"
            }
        ],
        "returned": 2
    },
    "series": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011088/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/454",
                "name": "Amazing Spider-Man (1999 - 2013)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1490",
                "name": "Spider-Man: The Other (2006)"
            }
        ],
        "returned": 2
    },
    "stories": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011088/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/1177",
                "name": "6 of 12 - The Other (Spider event)",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/1178",
                "name": "6 of 12 - The Other (Spider event)",
                "type": "interiorStory"
            }
        ],
        "returned": 2
    },
    "events": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011088/events",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/events/266",
                "name": "Other - Evolve or Die"
            }
        ],
        "returned": 1
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011088/morlun?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Morlun?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "identity": "Secret",
        "real_name": "Morlun",
        "occupation": "Unrevealed",
        "place_of_birth": "Unrevealed",
        "groups": "None",
        "citizenship": "Unrevealed",
        "education": "Unrevealed",
        "aliases": "Devourer of Totems",
        "relatives": "Unrevealed",
        "height": "6' 2\"",
        "weight": "175 lbs",
        "eyes": "White / red",
        "hair": "Black (white when weakened)",
        "powers": "Morlun is incredibly strong and durable, varying according to how recently he has fed, and on what kind of food source. He has demonstrated strength capable of lifting an estimated 20 tons. He absorbs life force upon contact with his victim. While he feeds himself for awhile on lesser sources, in order to sustain his centuries long life, Morlun must from time to time renew himself by consuming pure forms of totemistic (animal-related) super-beings from one of four categories which make up his own unusually pure DNA - animal, bird, human, or insect.",
        "abilities": "Once he touches someone, he can sense their life force and always find him/her.",
        "debut": "Amazing Spider-Man #30 (2001)",
        "origin": "Amazing Spider-Man #32 (2001)",
        "significant_issues": "Shot by Dex, apparently died (Amazing Spider-Man #35, 2001)",
        "main_image": "Morlun.png",
        "bio_text": "Morlun is a vampiric being who has walked the earth for centuries. He feeds on the totems-- the core power sources of the universe. While he can feed on lesser sources such as humans and super humans, he requires a pure source to fully satiate his hunger.",
        "bio": "Morlun is a vampiric being who has walked the earth for centuries. He feeds on the totems-- the core power sources of the universe. While he can feed on lesser sources such as humans and super humans, he requires a pure source to fully satiate his hunger.\n\n\nIn his initial appearance, Morlun drew [[Spider-Man (Peter Parker)|Spider-Man]], who possessed the power of a pure totem, to him. Spider-Man and Morlun battled in the streets of New York, but it was quickly revealed that Spider-Man was no match for Morlun's overwhelming powers. Before he left, Spider-Man was warned that now that Morlun had touched him, he could find him anywhere. Hoping to throw Morlun off, Spider-Man changed into his civilian clothes, but Morlun's warning struck true, and Spider-Man was found.\n\n\nHaving been offered earlier a place of refugee by [[Ezekiel]], Spider-Man sought help from him. Ezekiel told Spider-Man that he was out of luck, as Morlun could now track him anywhere. There was nothing Ezekiel could do.\n\nFacing Morlun again, Spider-Man was surprised when Ezekiel leaped to Spider-Man's rescue, battling Morlun to his apparent death. Satisfied with the life force he absorbed from Ezekiel, Morlun left to return at a later notice. Unable to find Ezekiel's body, Spider-Man noticed that in his fight with Morlun, Ezekiel had managed to shed some blood from him. Studying the blood, Spider-Man came up with a plan to defeat his enemy.[[Image:Morlunhold'nnearlydeadSpidey.jpg|left]]\n\nMorlun tracked Spider-Man to a nuclear power plant, where Spider-Man seemed as if he was dead, having absorbed great amounts of radiation. When Morlun went to touch Spider-Man, his hand was burned. His strength returned, Spider-Man revealed that whatever totemic powers might have been given to him by the spider, the radiation had played a role, and thus his powers were not pure. Spider-Man proceeded to deliver a sound beating to Morlun, but when Morlun was at death's door, he hesitated. Suddenly, Dex, Morlun's servant who had endured great suffering underneath his masters rule, drew a gun he had stolen and killed Morlun. Spider-Man let Dex go, and left, thinking that his nigh invincible foe was dead.\n\nMorlun mysteriously returned months later and plagued Spider-Man by sudden and mysterious appearances, warning him that he was coming. Spider-Man, for a reason not explainable by science, was dying, and Morlun hung back to watch the causes and effects of his ailment. Finally, Morlun struck, and in a climactic battle, Morlun delivered Spider-Man the worst beating any hero had ever endured. Morlun left when the police arrived, opting for a more appropriate time to absorb Spider-Man's life force, leaving the web slinger at death's door with only one eye.\n\nReturning soon thereafter, Morlun entered Spider-Man's room in the Emergency Ward and prepared to feast. Peter's wife, who was standing by his side, tried to stop Morlun. As it appeared he would kill Mary Jane, Spider-Man suddenly sprung to life in a ferocious display of mysterious new powers. Using stingers that sprouted from his arms, Spider-Man was seemed to eat his essence as Morlun had. Morlun apparently died, crumbling to dust. It remains to be seen whether this was a permanent death, or if the vampiric totem eater will rise again. [[image:Morlun defeats the Man Ape.jpg|thumb|Morlun defeats the Man Ape|200px|left]]\n\n\nMorlun has returned to life once again and he has set his sights on the proud African warrior nation of [[Wakanda]]. His objective was to claim the Panther totem that was protected by the [[Black Panther (T'Challa)|Black Panther]], T’Challa. In his quest to obtain the Panther totem, Morlun swept through the kingdom of the great [[Man-Ape]], M'Baku. He tore through their defenses like a lion through a spider’s web and then the vicious devourer consumed the mighty Man Ape, by sucking the life straight out of his body.",
        "categories": [
            "deceased",
            "People who used to be dead but aren't anymore",
            "Spider-Man",
            "Spider-Man Villains",
            "Villains"
        ]
    }
}