{
    "id": 1011343,
    "name": "Jamie Braddock",
    "description": "",
    "modified": "2004-04-14T00:00:00-0400",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/40/image_not_available",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011343",
    "comics": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011343/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/35296",
                "name": "Uncanny X-Force (2010) #17"
            }
        ],
        "returned": 1
    },
    "series": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011343/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/9976",
                "name": "Uncanny X-Force (2010 - 2012)"
            }
        ],
        "returned": 1
    },
    "stories": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011343/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/78007",
                "name": "Uncanny X-Force (2010) #17",
                "type": "interiorStory"
            }
        ],
        "returned": 1
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011343/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011343/jamie_braddock?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Braddock,_Jamie?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "Marvel Universe",
        "real_name": "James Braddock Jr.",
        "identity": "No dual identity",
        "occupation": "None; former race driver, slave trader, agent of Sat-Yr-9",
        "place_of_birth": "U.K.",
        "groups": "Former agent of Sat-Yr-9",
        "citizenship": "U.K. with criminal record in Mbangawi",
        "education": "University graduate",
        "aliases": "None",
        "relatives": "James Braddock Sr. (father, deceased); Elizabeth Braddock (mother, deceased); Brian Braddock (Captain Britain, brother); Elizabeth \"Betsy\" Braddock (Psylocke, sister); Meggan Braddock (sister-in-law)",
        "height": "6'1\"",
        "weight": "151 lbs.",
        "eyes": "Blue",
        "hair": "Black",
        "powers": "Jamie sees the world as invisible quantum string constructs, like messy balls of wool full of loose ends and empty spaces, which he can pull to transform reality, reshaping people into other individuals, animals or grotesque caricatures, making them shrink or grow, redirecting energy, or changing memories. He can also watch objects in other realities, even granting powers to them. Originally he could only manipulate dense forms (phased beings had some level of resistance), needed to be close enough to touch the \"cosmic filaments\" things were composed of, and if his concentration was disrupted some items or people changed would spontaneously revert to normal. There may have been a correlation between his sanity and his power level, as both increased noticeably after he spent time in a coma. With a simple act of will, he can now generate vast, complex illusions, redirect another's teleport, and open interdimensional portals. He can raise the dead, and can render someone immune to external influences by tightening their quantum strings, removing the gaps; however, Jamie remains able to affect them at will, possibly because he knows which strings are left avaliable to pull. He has created functional copies of the Fury, and could presumably copy other objects too. Jamie appears to be largely impervious to physical damage; even having large holes shot through him causes purely cosmetic damage that swiftly vanishes. He is also able to listen in on telepathic conversations between his siblings, although this power may be unrelated to his other abilities.",
        "debut": "Captain Britain #9 (1976)",
        "creators": "Chris Claremont",
        "origin": "Excalibur #56 (1992); Excalibur Annual #2 (1994)",
        "significant_issues": "Targeted by Doctor Synne (Captain Britain #8-12, 1976); became involved with slavery and murder, captured by Doctor Crocodile (Captain Britain #9-10, 1985); freed by Technet, joined Sat-Yr-9 (Excalibur #15, 1989); attacked Braddock Manor (Excalibur #55-56, 1992); prevented destruction of Earth-616 by Saturnyne (Uncanny X-Men #462, 2005)",
        "title_graphic": "generic_headshot.gif",
        "main_image": "jamiebraddock.jpg",
        "bio_text": "Ten years older than his siblings, Brian and Betsy, Jamie learned his brother had become the superhero [[Captain Britain]] when Brian stopped a possessed Betsy from killing them both on behalf of Dr. Synne. Later, Jamie was also peripherally involved in Brian's battles with the Red Skull, Lord Hawk and Slaymaster; however, after Brian went overseas and Betsy's modelling career took off, Jamie lost touch with both of them.",
        "bio": "Ten years older than his siblings, Brian and Betsy, Jamie learned his brother had become the superhero [[Captain Britain]] when Brian stopped a possessed Betsy from killing them both on behalf of Dr. Synne. Later, Jamie was also peripherally involved in Brian's battles with the Red Skull, Lord Hawk and Slaymaster; however, after Brian went overseas and Betsy's modelling career took off, Jamie lost touch with both of them.\n\n\nAddicted to his racing career's rich lifestyle, Jamie took a bribe from the criminal Maggia organization to lose a race, then won anyway. To repay them he took illegal jobs, using his racing as cover to travel the world; minor crimes became increasingly lucrative and immoral ones, until he was trading in human lives. Jamie was eventually captured by Joshua N'Dingi (Dr. Crocodile); learning from Crocodile of Jamie's activities, Brian left him to his fate. Trying to mystically cure Jamie's evil nature, Crocodile's Witch Woman instead unlocked his latent mutant powers, but the magic which held him also bound these. Dimensionally displaced despot Sat-Yr-9 hired the Technet to free Jamie, knowing her reality's version of him possessed powers; left insane by his torture and believing he was living in a dream without consequences, Jamie entered her service. He helped Sat-Yr-9 take over the crimelord Vixen's organization, and targeted his brother's team Excalibur, empowering an otherworldly counterpart of his to battle them. He later clashed with Alfie O'Meagan, an other-dimensional reality warper, which briefly put him off playing with alternate Earths.\n\n\nEventually, Sat-Yr-9 ambushed Excalibur and Betsy, now the X-Man [[Psylocke]], in Braddock Manor. Jamie slew their ally Alysande Stuart, and then tortured the captives for hours before Meggan broke free and attacked him, breaking his concentration. Psylocke rendered Jamie comatose with her psychic knife. Sat-Yr-9's troops fled, taking Jamie with them, though his unconscious form somehow ended up at Excalibur's Muir Island base, where his siblings attempted to reach him telepathically.\n\n\nRecently, Jamie appears to have awoken. [[Marvel Girl (Rachel Summers)|Marvel Girl]] (Rachel Grey) and Psylocke have caught glimpses of him, and he prevented Saturnyne (a counterpart of Sat-Yr-9) from destroying Earth-616 (his home reality). He seems to be manipulating events, possibly in connection with the recent reappearance of another reality warper, Mad Jim Jaspers, an old foe of Brian's; but his true motivations remain unrevealed.",
        "categories": [
            "X-Men",
            "Villains",
            "International",
            "Mutants"
        ]
    }
}