{
    "id": 1011099,
    "name": "Mentallo",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/2/c0/4c0030b9256c6",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011099",
    "comics": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011099/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/38316",
                "name": "Astonishing X-Men (2004) #39"
            }
        ],
        "returned": 1
    },
    "series": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011099/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/744",
                "name": "Astonishing X-Men (2004 - Present)"
            }
        ],
        "returned": 1
    },
    "stories": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011099/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/90530",
                "name": "Astonishing X-Men #39 ",
                "type": "interiorStory"
            }
        ],
        "returned": 1
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011099/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011099/mentallo?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Mentallo?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Marvin Flumm",
        "identity": "Known to the authorities",
        "occupation": "Criminal; (formerly) secret agent, shoe salesman",
        "place_of_birth": "Watford City, North Dakota",
        "groups": "Former partner of [[Fixer (Paul Norbert Ebersol)|Fixer]], formerly [[S.H.I.E.L.D.]], [[Hydra]], [[Resistants]]",
        "citizenship": "U.S.A. (criminal record)",
        "education": "Unrevealed; S.H.I.E.L.D. training",
        "aliases": "Think Tank",
        "relatives": "unrevealed",
        "height": "5'10\"",
        "weight": "175 lbs.",
        "eyes": "Brown",
        "hair": "Brown",
        "powers": "Marvin Flumm has the mutant ability to read minds as well as induce psychic hallucinations directly into his victims. Using his psychic abilities, Flumm can perform a type of radar sense to detect the presence and shape of intangible or out-of-reach objects. It is difficult for him to focus on moving targets, and he is susceptible to telepathic feedback, especially in the presence of other telepaths or psychics (his helmet mitigates these weaknesses.)",
        "weapons": "None",
        "paraphernalia": "Flumm has also employed an anti-psionic helmet, which allowed him to resist psionic attacks against him and grant himself invisibility by clouding others' minds. As Think Tank, Flumm operated a mentally-powered tank that fired missiles and had tentacled arms. His costume also serves as a type of body armor.",
        "debut": "Strange Tales #141 (1966)",
        "main_image": "Mentallo.jpg",
        "bio_text": "Although his telepathic ability emerged during adolescence, Marvin Flumm grew up content to be a shoe salesman . He was recruited by [[S.H.I.E.L.D.]]'s E.S.P. division, led by Niles Nordstrom. After learning the use of his ability, Flumm hatched a plan to gain control of S.H.I.E.L.D., but was forced to flee when he was discovered. He did manage to steal special equipment to augment his abilities, and he used these to create his identity of Mentallo.",
        "bio": "Although his telepathic ability emerged during adolescence, Marvin Flumm grew up content to be a shoe salesman . He was recruited by [[S.H.I.E.L.D.]]'s E.S.P. division, led by Niles Nordstrom. After learning the use of his ability, Flumm hatched a plan to gain control of S.H.I.E.L.D., but was forced to flee when he was discovered. He did manage to steal special equipment to augment his abilities, and he used these to create his identity of Mentallo. \n\nFlumm later allied himself with fellow criminal Norbert Ebersol, a.k.a. [[Fixer (Paul Norbert Ebersol)|Fixer]], and they nearly succeeded in raiding S.H.I.E.L.D.’s New York headquarters before being forced to escape. The two began to work for the terrorist organization [[Hydra]]. One of their most involved missions for Hydra involved the pair tapping into S.H.I.E.L.D. computer systems, but this plot was prompted by Hydra’s usurper, [[Baron Karza]], archenemy of the [[Microns]]. The Microns battled Mentallo and the Fixer, and the Micron’s Commander forced Mentello’s helmet off, bombarding him with telepathic information that overloaded his mind and rendered him comatose.\n\nS.H.I.E.L.D. took custody of Mentallo, but [[Professor Power]] arranged for Mentallo’s body to be placed in his care. Power hoped to use [[Professor X]]’s telepathic power to revive Mentallo and, in turn, force Mentallo to use his power to restore Power's son's mind, which was in a severe state of shock. Linked by a process created by the Fixer, Mentallo psychically battled Professor X on the astral plane, but Professor X proved too worthy an opponent and Mentallo’s condition was unchanged.\n\nSomehow recovering, Flumm appeared among the mutants calling themselves the [[Resistants]], publicly opposing the proposed Mutant Registration Act, , an act of Congress that was proposed in order to force mutants to register their abilities with the federal government. Their public protests were opposed by Captain America (John Walker, the [[U.S.Agent]]) his partner [[Battlestar]], and [[Freedom Force]]. Several of the Resistants were badly injured, and the team was remanded to custody. \n\nLater, Mentallo tried to resume his partnership with the Fixer. Unfortunately, the being he contacted was not the Fixer at all, but the [[Super-Adaptoid]] who was posing as the Fixer to escape the [[Avengers]]. After attempting to read his former partner’s mind, Mentallo’s own mind shut down, rendering him insensible. On the trail of the Fixer, the Avengers discovered Mentallo and remanded him to custody once more.\n\nWith his body being held in a stasis field in Seagate Federal Penitentiary, the authorities believed Mentallo’s threat to be over. In fact, his mind was still actively involved in criminal activities. In this manner he discovered clues regarding a weapon of great power left behind by the death of the criminal industrialist [[Hammer, Justin|Justin Hammer]]. The weapon had come to the attention of Mentallo by Hammer himself before he died, as Hammer awakened Mentallo's powers while he was in the stasis field.\n\nMentallo psychically sought out [[Hawkeye (Clint Barton)|Hawkeye]], who was also a prisoner there at the time. He secretly aided Hawkeye in surviving an attack by his more villainous inmates, finally convincing him to aid him in escape. Mentallo then organized for Hawkeye and three others (one of which was a Mentallo-possessed [[Headlok]]) to join a rotation of transferring prisoners. The rotation occurred during an attack by [[Graviton]] on the Earth, and his attempts to reshape the world allowed the prisoners to escape. Hawkeye, remotely \"chained\" to his inmates, escaped with the so-called Chain Gang. \n\nHawkeye's Chain Gang reluctantly agreed to work together to search for a way to survive, deactivate their security manacles, and to find Hammer’s weapon. Unknown to his associates, Hawkeye was actually working undercover on behalf of S.H.I.E.L.D., and they were using Hawkeye as a mole to track Mentallo's criminal activities. The Chain Gang's escape briefly made S.H.I.E.L.D. lose track of them, and S.H.I.E.L.D. hired Songbird to track Hawkeye and his allies. When Songbird finally caught up with the Chain Gang, she helped Hawkeye defeat the villains. \n\nHowever, Mentallo was later seen forced by [[Von Bardas, Lucia|Lucia von Bardas]] to band together with other villains who previously used technology that she helped provide for their equipment.  The villains began a massive attack against S.H.I.E.L.D. and dozens of New York’s heroes, but the battle turned out to be part of von Bardas’ ploy to assemble the heroes in one place. She triggered a device common to all the villains in the technology they used, and she and the villains were linked together in a giant bomb over the city. S.H.I.E.L.D. agent [[Johnson, Daisy|Daisy Johnson]] was able to kill von Bardas, defusing the bomb, and the villains were remanded to custody.",
        "categories": [
            "Villains",
            "Mutants"
        ]
    }
}