{
    "id": 1011084,
    "name": "Starfox",
    "description": "The youngest son of Mentor and Sui-San, Eros had the natural ability to excite pleasure in others, but his power had no effect upon his mutant older brother, Thanos, who worshiped the cosmic embodiment of Death and led an army against Titan.",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/70/4c0030cbcba98",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011084",
    "comics": {
        "available": 11,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011084/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17490",
                "name": "Avengers (1998) #1"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17501",
                "name": "Avengers (1998) #2"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17512",
                "name": "Avengers (1998) #3"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17523",
                "name": "Avengers (1998) #4"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17518",
                "name": "Avengers (1998) #35"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/1311",
                "name": "Avengers Assemble (Hardcover)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/5844",
                "name": "Avengers Assemble Vol. 4 (Hardcover)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/10100",
                "name": "Marvel Comics Presents (1988) #22"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/10147",
                "name": "Marvel Comics Presents (1988) #65"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/5637",
                "name": "Marvel Comics Presents: Wolverine Vol. 4 (Trade Paperback)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/18424",
                "name": "Warlock and the Infinity Watch (1992) #2"
            }
        ],
        "returned": 11
    },
    "series": {
        "available": 6,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011084/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/354",
                "name": "Avengers (1998 - 2004)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1340",
                "name": "Avengers Assemble (2004)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1816",
                "name": "Avengers Assemble Vol. 4 (2007)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2039",
                "name": "Marvel Comics Presents (1988 - 1995)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1697",
                "name": "Marvel Comics Presents: Wolverine Vol. 4 (2006)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/3654",
                "name": "Warlock and the Infinity Watch (1992 - 1995)"
            }
        ],
        "returned": 6
    },
    "stories": {
        "available": 12,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011084/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/23207",
                "name": "New Worlds To Conquer",
                "type": ""
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/23486",
                "name": "Wang Dang Doodle",
                "type": ""
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/37337",
                "name": "Cover #37337",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/37338",
                "name": "Once an Avenger...",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/37359",
                "name": "Cover #37359",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/37360",
                "name": "The Call",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/37386",
                "name": "Fata Morgana",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/37397",
                "name": "Cover #37397",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/37398",
                "name": "Interstellar Intrigues",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/37408",
                "name": "Cover #37408",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/37409",
                "name": "Too Many Avengers!",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/39253",
                "name": "Gathering the Watch",
                "type": "interiorStory"
            }
        ],
        "returned": 12
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011084/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011084/starfox?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Starfox?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Eros",
        "identity": "True identity unknown to general populace of Earth",
        "occupation": "Adventurer, womanizer",
        "place_of_birth": "Titan, moon of Saturn",
        "groups": "[[Eternals]]; formerly [[Avengers]], [[Queen's Vengeance]]",
        "citizenship": "[[Titan (Moon of Saturn)|Titan]]",
        "education": "Unrevealed",
        "aliases": "Knave of Hearts",
        "relatives": "Alars ([[Mentor (Alars)|Mentor]], father), [[Sui-San]] (mother, deceased), [[Thanos]] (brother), Genis-Vell ([[Photon (Genis-Vell)|Photon]], adopted son, deceased), [[Zuras]] (uncle, deceased), [[Thena]] (cousin), [[Cybele]] (aunt), [[Kronos]] (grandfather), Daina (grandmother), [[Nebula]] (alleged grandniece), Donald and Deborah Ritter (second cousins)",
        "height": "6'1''",
        "weight": "190 lbs.",
        "eyes": "Blue",
        "hair": "Red",
        "powers": "As an Eternal, Eros can harness cosmic energy for various purposes, although he has not developed his full potential (for instance, he seems to have little or no proficiency in molecular restructuring, though he once helped reverse one of Sersi's transmutations). He has a superhumanly strong and durable physique and ages far more slowly than most humanoids. His chief power is to stimulate the pleasure centers in the brains of others. Eros can surround himself with a personal force field so that he can travel through space and underwater, and can both fly and perform telekinetic stunts using his ability to harness gravitons.",
        "abilities": "Eros can speak 500 extraterrestrial languages.",
        "debut": "Iron Man #55 (1973)",
        "creators": "this has not been updated yet",
        "main_image": "Starfox better.jpg",
        "bio_text": "750,000 years ago, [[Mentor (Alars)|Alars]], a member of the [[Eternals]] of Earth, a cosmic-powered sub-species of humanity, departed Earth after his brother [[Zuras]] became the Eternals' leader. Alars journeyed to [[Titan (Moon of Saturn)|Titan]], a moon of Saturn, where a band of exiled [[Titans (Eternals of Titan)|Eternal]] settlers had slaughtered each other in war. Alars married the only survivor, a young woman named [[Sui-San]], and they transformed Titan into a paradise. Alars ruled the Eternals of Titan as Mentor and created [[ISAAC]], a computer which serviced all of Titan's technological needs.",
        "bio": "750,000 years ago, [[Mentor (Alars)|Alars]], a member of the [[Eternals]] of Earth, a cosmic-powered sub-species of humanity, departed Earth after his brother [[Zuras]] became the Eternals' leader. Alars journeyed to [[Titan (Moon of Saturn)|Titan]], a moon of Saturn, where a band of exiled [[Titans (Eternals of Titan)|Eternal]] settlers had slaughtered each other in war. Alars married the only survivor, a young woman named [[Sui-San]], and they transformed Titan into a paradise. Alars ruled the Eternals of Titan as Mentor and created [[ISAAC]], a computer which serviced all of Titan's technological needs.\n\nThe youngest son of Mentor and Sui-San, Eros had the natural ability to excite pleasure in others, but his power had no effect upon his mutant older brother, [[Thanos]], who worshiped the cosmic embodiment of [[Death (embodiment)|Death]] and led an army against Titan. During this assault, Thanos killed and dissected Sui-San, trying to learn why he was born different. While his brother was captivated by Death, Eros loved life, and began visiting other systems for adventure and romance. Eros even visited Earth at least once, and was remembered in Earth's legends. He had many lovers, but his only steady relationship was with the prostitute Heater Delight. Eros later helped Heater escape more than one possessive master, including Dark Roger and Axel the Rescorlan. While she was the property of Pro-Boscis the Procurer, Heater kept Eros from saving her because she didn't want his face damaged; she instead manipulated [[Pip the Troll]] into saving her.\n\nIn recent times, Thanos conquered Titan with another army, slaughtering most of the Titans until Mentor and Eros were the only remaining resistance. Thanos, now seeking the [[Cosmic Cube]], brought [[Jones, Rick|Rick Jones]] to Titan to learn its location. Rick was freed by Mentor, Eros and the [[Kree]] warrior [[Captain Marvel (Mar-Vell)|Captain Marvel]], who had been bonded to Rick; together, they battled Thanos' armies and drove off his lieutenant on Titan, the [[Super-Skrull]]. Mar-Vell ultimately bested Thanos by seemingly destroying the Cosmic Cube, and Mentor and Eros were able to rebuild Titan. Mar-Vell became a close friend of the Titans after his help. \n\nThanos, however, had secretly left behind a programming virus compelling ISAAC to act on his behalf. Creating lieutenants for itself, ISAAC took the Titans captive. One lieutenant, [[Elysius]], was attracted to Eros, but she later shifted her affections to Mar-Vell and changed sides when he came to Titan to oppose ISAAC. Mar-Vell ultimately drove Thanos' programming from ISAAC, saving Titan. Mar-Vell soon succumbed to cancer, spending his last days on Titan. Eros was devastated by the loss, and remained close to Elysius in the days that followed. Elysius eventually had ISAAC help her create a son from Mar-Vell's DNA; she named the child [[Photon (Genis-Vell)|Genis]]. He was raised to believe that Eros was his father, and Eros helped maintain the facade until Genis' accelerated coming of age.\n\nLonging for new adventures, Eros visited Earth again and encountered the [[Avengers]] battling the [[Blackheath|Plantman]]. Eros asked to join their team and was accepted as an Avenger-in-training; but the Avengers were reluctant to present a man named \"Eros\" to the public so the [[Wasp]] rechristened him \"Starfox.\" Eros was chagrined to meet fellow trainee [[Rambeau, Monica|Captain Marvel (Monica Rambeau)]], and he looked down on her, still stung by the death of Mar-Vell. Starfox learned teamwork and responsibility amongst the Avengers, but still found time to engage in several romantic liaisons, including a one-night stand with his teammate [[She-Hulk]]. The team also valued Starfox for his scientific knowledge as he was serving on a roster devoid of the Avengers' usual scientific geniuses. After many of the Avengers were taken to Battleworld to serve in the [[Maker|Beyonder]]'s \"[[Secret Wars]],\" the [[Vision]] became the Avengers' chairman and promoted Starfox to full membership to fill out the roster. Starfox retained his standing when the other Avengers returned.\n\nOne evening, Starfox invited himself and the Wasp to a party in Soho which was held by Sersi, a member of Earth's [[Eternals of Earth|Eternals]]. When Sersi was brought to the Eternals' city of [[Olympia, City of|Olympia]] to participate in a gathering of all Eternals, Starfox was brought along. In Olympia, he fascinated his Earth-bound cousins with the story of how Alars had founded Titan. Starfox participated in the Eternals' Ritual of the [[Uni-Mind]], merging with them into a single psionic entity; but when the villain [[Maelstrom]] tried to siphon the Uni-Mind's power for himself, and the Vision and [[Scarlet Witch (Wanda Maximoff)|Scarlet Witch]] freed the Eternals from the Uni-Mind. Starfox managed to incapacitate Maelstrom with his pleasure powers, which he revealed to the Avengers for the first time. Maelstrom caused his own death by having his servant [[Deathurge]] kill him so that he could live anew in another cloned body. The Avengers subsequently thwarted Maelstrom's next plot to halt the Earth's rotation. After seeing Captain Marvel's courage in that battle, Starfox finally accepted her use of his friend's name, apologizing to her for the way he had slighted her. \n\nThe Avengers became embroiled in a civil war amongst the [[Skrulls]], during which the pirate [[Nebula]] seized Thanos' starship Sanctuary II and used it to command a Skrullian fleet to destroy the planet [[Xandar, Planet of|Xandar]]. When Starfox confronted Nebula, she claimed that Thanos was her grandfather. Before Eros could learn more, Nebula was teleported away by the Beyonder, who had misunderstood the wish of the Xandarian survivor [[Firelord (Pyreus Kril)|Firelord]] that Nebula be cast out of the galaxy. Starfox was determined to learn if Nebula's story was true, quit the Avengers to hunt her alongside Firelord. The pair were attacked by [[Super-Nova]], another survivor of Xandar who incorrectly believed Nebula to be one of the Avengers, and Starfox was badly injured, but he soon recuperated and resumed his pursuit of Nebula. He finally caught up to her and helped the Avengers thwart her attempt to harness the [[Infinity Union]], a device of the [[Stranger]]'s which could grant her cosmic power.\n\nSoon afterwards, Thanos obtained the [[Infinity Gauntlet]] (which housed the six [[Infinity Gems]]) and used it to offer the universe to Death. Thanos took Starfox hostage during the crisis so that his brother could witness his actions, but Thanos allowed himself to be beaten, not truly desiring victory in the end. Starfox continued to serve as an occasional Avenger, participating in the Avengers' mission to the [[Shi'ar]] Empire during the Kree-Shi'ar war, as well as joining the Avengers against [[Morgan Le Fay]] when she mastered the power of the [[Twilight Sword]]. \n\nIn the aftermath of that battle, Starfox befriended his fellow Avenger [[Tigra]], and she set off into space with him to visit [[Deneb-VII, Planet of|Deneb-VII]]. Tigra soon became bored of Deneb-VII, but the duo found new excitement when the universe was threatened by the [[Infinites]], cosmic beings from another universe who had no regard for the lives of lesser beings. Starfox and Tigra teamed with [[Jack of Hearts]], [[Quasar (Wendell Vaughn)|Quasar]], [[Thor (Thor Odinson)|Thor]], [[Rambeau, Monica|Photon]] and [[Moondragon]] to face the Infinites. Starfox helped appeal to the Infinites through [[Eternity]], the embodiment of space, and one of the Infinites ultimately chose to sacrifice itself to repair some of the damage they had done. Later, Starfox led a small army of Eternals in attacking Thanos (or possibly one of the \"clones\" known as the [[Thanosi]]) during his quest for the Celestial Messiah, but they were soundly defeated and Eros was cast into outer space, beaten senseless. \n\nStarfox later confronted the time-traveler [[Thanatos (2099)|Thanatos]], a version of Rick Jones from another reality intent on gathering items of power. Thanatos struck Starfox in the neck with the Spear of Destiny, causing a wound which could not be healed, then threatened to kill him unless he brought Rick Jones (now bonded to Genis) to him. Starfox was forced to comply, but Rick and Genis were able to defeat Thanatos in the end, reversing his actions. After Genis' power of cosmic awareness drove him insane, Starfox joined with Elysius, Mentor and the other Titans in opposing him; they were ultimately able to help Genis regain his sanity.",
        "categories": [
            "Avengers",
            "Heroes",
            "Cosmic"
        ]
    }
}