{
    "id": 1011069,
    "name": "Harrier",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/30/4c0030e7aba3e",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011069",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011069/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011069/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011069/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011069/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011069/harrier?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Harrier?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Donald Joshua Clendenon",
        "aliases": "Cardinal",
        "identity": "Known to the authorities",
        "occupation": "Inmate; former adventurer, criminal, mercenary",
        "citizenship": "U.S.A. with criminal record",
        "place_of_birth": "Birmingham, Alabama",
        "relatives": "Unidentified father, Valerie Barnhardt ([[Meteorite (Valerie Barnhardt)|Meteorite]], daughter, deceased)",
        "groups": "None; (formerly) [[Thunderbolts]], [[Masters of Evil]], [[Air Force]]",
        "education": "Unrevealed; some military training",
        "height": "6'2\"",
        "weight": "257 lbs.",
        "eyes": "Brown",
        "hair": "Black",
        "powers": "None",
        "abilities": "Clendenon is an accomplished soldier, tactitian, and pilot.",
        "weapons": "Among his armor's offensive capabilities were blasts of electricity, a titanium net, and \"tar pellets\" ensnaring projectiles.",
        "paraphernalia": "As both Cardinal and Harrier, he used winged body armor which granted him the cabability of jet-powered flight, capablity to travel underwater, and enhanced strength.",
        "debut": "(as Cardinal) New Warriors #28 (1992); (as Harrier, in shadow) Thunderbolts #65 (2002); (as Harrier, fully) Thunderbolts #67 (2002)",
        "origin": "Thunderbolts #67 (2002)",
        "significant_issues": "[[OHOTMU:Bibliography-AZ5#Harrier|Official Handbook Bibliography]]",
        "main_image": "Harrier.jpg",
        "bio_text": "Not much has been revealed regarding the early life and origin of Cardinal, the mercenary identity of Joshua Donald Clendenon. Presumably of a military background, Clendenon had a daughter, [[Meteorite (Valerie Barnhardt)|Valerie Barnhardt]], who would later join the marines.",
        "bio": "Not much has been revealed regarding the early life and origin of Cardinal, the mercenary identity of Joshua Donald Clendenon. Presumably of a military background, Clendenon had a daughter, [[Meteorite (Valerie Barnhardt)|Valerie Barnhardt]], who would later join the marines.\n\nClendenon was the leader of the mercenary group known as the [[Air Force]], a band of individuals using winged body armor as their signature motif. The Air Force clashed with the [[New Warriors]] during the course of their missions and were repeatedly defeated.\n\n[[image:Cardinal (Joshua Clendenon) Head.jpg|left|200px]]\n\nOn one such occasion Clendenon attacked the Taylor Foundation Board of Directors after being hired by Ms. Hancock. When he boarded the plane he was attacked by his ex-girlfriend Sprocket, who happened to be the plane’s pilot. After disabling most of the crew, Tanager went into the back and confronted Dwayne Taylor, [[Night Thrasher]]. Using Tanager’s helmet, Dwayne was able to control the other members of Air Force. He then threatened the Air Force into participating in African relief efforts. During his time in Africa, Clendenon was genuinely moved by the suffering of the continent's starving refugees and worked diligently to aid the needy, but his work ended disastrously when the radical right-wing organization [[Undertow]] tried to massacre the refugees. During the battle with Undertow's superhuman [[Soldiers of Misfortune]], Clendenon was badly wounded. His close friend [[Sparrow]] was captured, and the rest of the Air Force was killed. Subsequent attempts by Clendenon and the New Warriors to rescue Sparrow were unsuccessful, though the Warriors did eventually succeed in freeing one of their own members, [[Namorita]], from Undertow's custody.\n\nEmbittered by these experiences, Clendenon decided to abandon his flirtation with heroism and dedicate himself exclusively to the pursuit of profit. This led him to join the [[Crimson Cowl (Justine Hammer)|Crimson Cowl]]'s [[Masters of Evil]] in their plot to blackmail the world's governments with a weather control device, but he was defeated and captured by the [[Thunderbolts]] along with most of the other Masters.\n\nLater, when the Thunderbolts' leader [[Hawkeye (Clint Barton)|Hawkeye]] was incarcerated at [[Seagate]] prison for illegal vigilante activities, Clendenon was one of many inmates who tried in vain to kill the resourceful hero. More recently, Clendenon was freed from prison by the Crimson Cowl to rejoin the Masters, participating in their new world conquest scheme; in return, the Cowl promised Clendenon she would destroy Hawkeye, whom Clendenon held responsible for the recent death of his daughter Valerie Barnes, who as Meteorite had joined the Thunderbolt's interim team called the [[Redeemers]] but was killed in the line of duty.\n\nThe Masters of Evil were confronted by Hawkeye and his allies Songbird and [[Plantman]] (as Blackheath) who were searching for the legacy of criminal industrialist [[Hammer, Justin|Justin Hammer]]. Their search ended with Hammer's daughter, Justine, who turned out to be the Crimson Cowl. Hawkeye convinced Clandenon and other members of the Masters of Evil to side with him against Crimson Cowl and their former allies, pointing out the dangers of the super-weapon, a biological toxin that threatened to kill any villain who had ever worked with Hammer, which included Clendenon. Hoping to throw off suspicion, Hawkeye made the villains reinvent their costumed identities, and Clendenon joined his new team of Thunderbolts as Harrier, although he still harbored a grudge against Hawkeye over the fate of his daughter.\n\nThe group ultimately defeated the Cowl and her Masters of Evil, and Blackheath managed to release an antidote into the atmosphere instead. During the battle, Clendenon appeared to drop Hawkeye from a great height, but this was proved to be the work of the villain [[Machinesmith]] who controlled the Harrier armor. The Thunderbolts immediately fought against the [[Elite Agents of SHIELD]] who caught up with them and wanted the remains of Blackheath's body, although he soon revived himself. The Thunderbolts were aided by the arrival of the true [[Citizen V (John Watkins III)|Citizen V]], who needed the team's immediate help with his agency's ship-- the engines of which were made of alien technology that had began distorting, threatening to suck the Earth into the null space of a white hole. Hawkeye's Thunderbolts were asked to move a great quantity of mass to plug the hole. In so doing, the Thunderbolts encountered the original Thunderbolts, who emerged from the void after severing the alien ship's presence from where they had been trapped on [[Counter-Earth (Franklin Richards)|Counter-Earth]]. The two teams of Thunderbolts combined forces to plug the void and shunt the alien ship from Earth, similar to the manner in which Zemo's team stopped the threat on Counter-Earth.\n\nAfter much discussion, most of the costumed heroes and villains chose to part company, including Clendenon, who made peace with Hawkeye and chose to return to prison in order to serve the remainder of his sentence.",
        "categories": [
            "Heroes",
            "Reformed Villains",
            "Thunderbolts",
            "Villains"
        ]
    }
}