{
    "id": 1011076,
    "name": "Grandmaster",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/5/10/4c0030dc410d6",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011076",
    "comics": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011076/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/5045",
                "name": "Thunderbolts (2006) #106"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/15898",
                "name": "Thunderbolts: Guardian Protocols (Trade Paperback)"
            }
        ],
        "returned": 2
    },
    "series": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011076/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/18527",
                "name": "Thunderbolts (2006 - 2012)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2427",
                "name": "Thunderbolts: Guardian Protocols (2007)"
            }
        ],
        "returned": 2
    },
    "stories": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011076/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/3916",
                "name": "1 of 3 - Guardian Protocols",
                "type": "cover"
            }
        ],
        "returned": 1
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011076/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011076/grandmaster?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Grandmaster?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "En Dwi Gast",
        "identity": "His existence is unknown to most of the residents of Earth",
        "occupation": "Game player",
        "place_of_birth": "Unrevealed planet in now dead galaxy",
        "groups": "[[Elders of the Universe]], founder of the [[Squadron Sinister]]",
        "citizenship": "None",
        "education": "Unrevealed",
        "aliases": "None",
        "relatives": "None",
        "height": "7’ 1”",
        "weight": "240 lbs.",
        "eyes": "Red, with no visible pupils",
        "hair": "White",
        "powers": "The Grandmaster posses a cosmic life force which grants him a variety of superhuman traits, including a virtually immortal body, immunity to aging and disease, and imperviousness to conventional injury through regeneration of any injury. Also, the Grandmaster can utilize his cosmic life force for a variety of effects, including levitation, the projection of energy blasts, and travel through time and space and into alternate dimensions. He is also capable of transforming and rearranging matter on a planetary scale, he can cause death to others just by wishing it, and he can resurrect beings who are dead for less then 29.5 hours. Currently due to his machinations against [[Death (embodiment)|Death]], he cannot die. He is also capable of mentally computing diverse low information probabilities to the tenth decimal place with ease, and to retain vast amounts of data. He also possesses certain abilities of mental perception beyond those currently known, which enable him to receive information about his environment through extrasensory means. He also maintains a psychic link with the highly advanced computers of his base world, which extend and enhance his mental abilities.",
        "abilities": "Vast knowledge and comprehension of games and game theory far beyond present-day Earth, as well as encyclopedic knowledge of thousands of exotic games played throughout the universe.",
        "weapons": "",
        "paraphernalia": "",
        "debut": "Avengers #69 (1969)",
        "origin": "",
        "significant_issues": "Contest against Scarlet Centurion, formed Squadron Sinister (Avengers #69-71, 1969); challenged Death to contest and sacrificed life to bring Collector back from dead (Marvel Super-Hero Contest of Champions #1-3, 1982); won immortality for the Elders (Avengers Annual #16, 1987); resurrected Hyperion and reformed the Squadron Sinister (New Thunderbolts #15-16, 2006)",
        "main_image": "Grandmaster_Head.jpg",
        "bio_text": "Like those of all the [[Elders of the Universe]], the Grandmaster’s origin is lost in early history of the universe. It is known that he is one of the oldest living beings in the universe. Like other Elders, he is the survivor of one of the intelligent races that evolved in one of the first galaxies to form after the “Big Bang”, the cataclysmic event in which the [[Marvel Universe|universe]] was created. Although his race became extinct and even his native galaxy died as the ages passed, the Grandmaster, like the other Elders, lived on, having become virtually immortal. As the relatively few survivors of the earliest period of the universe, the Elders regarded themselves as figuratively being brothers.",
        "bio": "Like those of all the [[Elders of the Universe]], the Grandmaster’s origin is lost in early history of the universe. It is known that he is one of the oldest living beings in the universe. Like other Elders, he is the survivor of one of the intelligent races that evolved in one of the first galaxies to form after the “Big Bang”, the cataclysmic event in which the [[Marvel Universe|universe]] was created. Although his race became extinct and even his native galaxy died as the ages passed, the Grandmaster, like the other Elders, lived on, having become virtually immortal. As the relatively few survivors of the earliest period of the universe, the Elders regarded themselves as figuratively being brothers.\n\nThe Grandmaster has spent his extraordinary long life in pursuit of amusement through the playing of games. He has traveled throughout the known universe studying many civilizations’ forms of games and play to the point of mastering them. He then began to devise his own types of tournaments and contests, challenging various opponents to games of skill and chance for high stakes.\n\nCapable of traversing space, time and the dimensions, the Grandmaster once journeyed to the alternate Earth inhabited by the [[Squadron Supreme (Earth-712)|Squadron Supreme]] to stage a contest with the time-traveling [[Scarlet Centurion]]. The Grandmaster’s standard method of playing games was to choose a team of champions to do combat with another team selected by his opponent. The Grandmaster used the Squadron Supreme as pawns for his games, while the Scarlet Centurion assembled various of the Squadron’s enemies as the [[Institute Of Evil (Earth-712)|Institute of Evil]]. Winning the contest, the Grandmaster determined to create is own Squadron since the original Squadron was unwilling to participate in further games.\n\nReturning to his own universe he traveled to Earth and transformed three men ([[Doctor Spectrum (Kinji Obatu)|Doctor Spectrum]], [[Nighthawk (Kyle Richmond)|Nighthawk]], and the [[Speed Demon|Whizzer]]) into counterparts of the Squadron members. He also created a counterpart to the Squadron’s [[Hyperion (Zhib Ran)|Hyperion]] out of non-living extra dimensional matter and invested it with consciousness and artificial memories. These four counterparts became the criminal team known as the [[Squadron Sinister]].\n\nThe Grandmaster then journeyed to the time period of [[Kang|Kang the Conqueror]] (a temporal counterpart to the Scarlet Centurion) to engage in a contest against him. After Kang’s champions, the [[Avengers]], defeated the Squadron Sinister, the Grandmaster drafted the World War II heroes, the [[Invaders]]. If Kang won, the Grandmaster would briefly grant him the power of either life or death. If Kang lost, the Grandmaster would destroy the Earth. Fortunately, Kang’s champions triumphed.\n\nLater, having returned to the 20th Century, the Grandmaster used [[Daredevil (Matthew Murdock)|Daredevil]] and the [[Defenders]] as his pawns against [[Doctor Doom (Victor von Doom)|Doctor Doom]]‘s artificial creation the [[Prime Mover]]. Winning this match he decided to take control of the Earth as a breeding ground for superhuman-powered pawns for his games, but gave up the Earth after losing a bet with Daredevil.\n\nAlthough the Grandmaster can resurrect most living beings after their deaths, he cannot do so with virtually immortal beings like himself who are killed. Therefore the Grandmaster was unable to resurrect his “brother” the [[Collector (Taneleer Tivan) |Collector]], after he had been murdered. The Grandmaster challenged [[Death (embodiment)|Death]] itself to a game. If Grandmaster won, then the Collector would live, but if he lost, then he too would also die. The Grandmaster and Death each selected teams from among Earth’s superhumans to do battle in a [[Contest of Champions|contest of champions]]. The Grandmaster’s team won, but Death revealed in order to bring the Collector to life, the Grandmaster would have to forfeit his own life. Compelled by his sense of gamesmanship to see the game through to its end, the Grandmaster died and the Collector returned to life. \n\nHowever, Death then challenged the Collector to a game, apparently with the resurrection of the Grandmaster as the stakes. The outcome of the game is unknown, but the Collector is known to have survived and the Grandmaster has been seen since. The Grandmaster then used the Avengers and an incarnation of the [[Legion of the Unliving]] in another contest against Death, in which he won immortality for himself and all of the Elders. \n\nLater the Elders of the Universe plotted to kill [[Galactus]] by using the [[Infinity Gems]] against him. This plan failed and the Elders were then confronted by a power seeking [[Thanos]]. The Grandmaster lost one of the gems in the process, and Thanos gained [[Infinity Gauntlet|ultimate power]] shortly thereafter.\n\nRecently, the Grandmaster has been seen reuniting the Squadron Sinister, and only he knows what games are yet to come.",
        "categories": [
            "Avengers",
            "Villains",
            "Cosmic",
            "People who used to be dead but aren't anymore"
        ]
    }
}