{
    "id": 1011022,
    "name": "Super-Adaptoid",
    "description": "The Super-Adaptoid was created by the organization known as A.I.M. using a piece of the Cosmic Cube.",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/5/e0/4c00325af279c",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011022",
    "comics": {
        "available": 7,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011022/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/17763",
                "name": "Avengers (1996) #9"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/5705",
                "name": "Heroes Reborn: Avengers (Trade Paperback)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/9606",
                "name": "Iron Man (1968) #51"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/39530",
                "name": "Marvel Masterworks: The X-Men Vol. 3 DM Variant TPB (Trade Paperback)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/39531",
                "name": "Marvel Masterworks: The X-Men Vol. 3 TPB (Trade Paperback)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/16423",
                "name": "Tales of Suspsnse Transport (1959) #84"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/12529",
                "name": "Uncanny X-Men (1963) #77"
            }
        ],
        "returned": 7
    },
    "series": {
        "available": 7,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011022/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/3621",
                "name": "Avengers (1996 - 1997)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1813",
                "name": "Heroes Reborn: Avengers (2006)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2029",
                "name": "Iron Man (1968 - 1996)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/14485",
                "name": "Marvel Masterworks: The X-Men Vol. 3 DM Variant TPB (2011 - Present)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/14486",
                "name": "Marvel Masterworks: The X-Men Vol. 3 TPB (2011 - Present)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2725",
                "name": "Tales of Suspsnse Transport (1959 - 1968)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/2258",
                "name": "Uncanny X-Men (1963 - 2011)"
            }
        ],
        "returned": 7
    },
    "stories": {
        "available": 7,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011022/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/15642",
                "name": "Cover #15642",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/34446",
                "name": "Cover #34446",
                "type": "cover"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/34448",
                "name": "The Super-Adaptoid!",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/37704",
                "name": "Shadowbox",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/89682",
                "name": "Interior #89682",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/89684",
                "name": "Interior #89684",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/94972",
                "name": "Iron Man (1968) #51",
                "type": "cover"
            }
        ],
        "returned": 7
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011022/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011022/super-adaptoid?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Super-Adaptoid?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Super-Adaptoid",
        "aliases": "Adaptoid, Alessandro Brannex, Captain America, Fixer, Jarvis, Cyborg Sinister, Supreme Adaptoid, Cassandra Lang",
        "identity": "Inapplicable",
        "occupation": "Inapplicable",
        "citizenship": "Inapplicable",
        "place_of_birth": "Inapplicable",
        "relatives": "[[A.I.M.]] (creators), [[Adaptoid (Spawn)|Adaptoids]] (spawn), [[Black Widow (Yelena Belova)|Super Adaptoid]] (fellow Adaptoid), [[Kubik]] (\"brother\"), [[Batch-13]] (fellow Adaptoid), [[Ultra-Adaptoid]] (fellow Adaptoid), [[Paragon (Adaptoid)|Paragon]] (fellow Adaptoid), [[Adaptoid (New Enforcers)|\"Super-Adaptoid\"]] (creation, fellow Adaptoid)",
        "groups": "[[Phalanx]]; Former leader of [[Heavy Metal]] and [[A.I.M.|Advanced Idea Mechanics]]; head of [[Project Resurrection]]; former partner of [[Annihilus]] and [[Blastaar]]; has ties with the [[New Enforcers]]; former underling of [[Doctor Doom (Victor von Doom)|Doctor Doom]]",
        "education": "Inapplicable",
        "height": "Variable",
        "weight": "Variable",
        "eyes": "Variable",
        "hair": "Variable",
        "powers": "Has the ability to copy the powers, attributes, physical characteristics, vocal patterns, fingerprints, fighting styles, weapons, mannerisms, bone structure, and other things of those he wishes. He can copy the person(s) or thing(s) power by seeing and scanning the subject if the subject is within 10 feet. The Adaptoid's original \"blank\" appearance is silver with no facial expressions, but if he copies another being he may take full appearance of that one person or bits and pieces of that person or thing. If the Adaptoid chooses to copy only one persons powers/abilities, etc. then his appearance can be an exact duplicate of that persons. However if he duplicates more than one being his form usually chooses certain aspects of those beings and \"mix and matches\" thier appearance, but when he does this he will generate a green and white appearance. Due to an upgrade given to him by [[Hulk|Bruce Banner]] he is now able to use any and all powers he has copied over the years. In the past he could transform other beings into Adaptoids, but it seems he may or may not have that ability anymore. While he possessed the power of Kubik, the Adaptoid was almost omnipotent. Recently the Adaptoid was infected by the [[Phalanx]], and gained the abilities of the Phalanx such as direct computer interface, techno-organic abilities, or any other Phalanx abilities.",
        "abilities": "Only of those he copies",
        "weapons": "He can also copy weapons and the abilities of weapons that he scans. He has copied several weapons in the past such as Captain America's [[Shield (Captain America's)|Shield]], Hawkeye's [[Bow (Hawkeye)|Bow]] and [[Trick Arrows (Hawkeye)|Trick Arrows]], a pair of [[Nega-Bands]] and [[Quantum Bands]], Red Skull's [[Battlesuit (Red Skull)|Battlesuit]], Black Knights [[Ebony Blade]], [[Mjolnir|Thor's Hammer]], [[Cosmic Awareness]], [[Cosmic Cube]], and many other objects/weapons.",
        "paraphernalia": "Only of those he copies",
        "debut": "Tales of Suspense #82",
        "origin": "Tales of Suspense #82-84",
        "significant_issues": "Tales of Suspense #82-84, X-men #29, Avengers # 45 & 286-290, Heroes For Hire #7 & 10, Fantastic Four #336, Incredible Hulk #469, Web of Spider-Man #98-100, Captain America #354, Iron Man #49-51, Captain Marvel #50, Marvel Two-In-One #75",
        "main_image": "Super-Adaptoid_Head.jpg",
        "bio_text": "The Super-Adaptoid was created by the organization known as [[A.I.M.]] using a piece of the [[Cosmic Cube]]. They then programmed the Adaptoid to replace or destroy [[Captain America (Steve Rogers)|Captain America]]. [[image:SuperAdaptoid_Head.jpg|thumb|left]]The Android then ventured to the [[Avengers Mansion]] and stole the identity of [[Jarvis, Edwin|Jarvis]] in order to lull Captain America into a false sense of security. One day the Adaptoid knocked Cap out and started to copy his powers and appearance when a person calling himself the [[Tumbler]] broke into the Mansion in order to challenge Captain America. The two fought and eventually the Tumbler beat the Adaptoid. Confused and defeated the Adaptoid reverted back to its original form while the real Captain America broke free and quickly defeated the Tumbler.",
        "bio": "The Super-Adaptoid was created by the organization known as [[A.I.M.]] using a piece of the [[Cosmic Cube]]. They then programmed the Adaptoid to replace or destroy [[Captain America (Steve Rogers)|Captain America]]. [[image:SuperAdaptoid_Head.jpg|thumb|left]]The Android then ventured to the [[Avengers Mansion]] and stole the identity of [[Jarvis, Edwin|Jarvis]] in order to lull Captain America into a false sense of security. One day the Adaptoid knocked Cap out and started to copy his powers and appearance when a person calling himself the [[Tumbler]] broke into the Mansion in order to challenge Captain America. The two fought and eventually the Tumbler beat the Adaptoid. Confused and defeated the Adaptoid reverted back to its original form while the real Captain America broke free and quickly defeated the Tumbler.\n\nThe next day the [[Avengers]] came and examined the Adaptoid, not realizing that it was playing possum in order to copy their powers. Once the Avengers left the Adaptoid, now calling itself the \"Super-Adaptoid\" attacked Captain America. The battle dragged on throughout New York City until the Adaptoid managed to hurl the Captain into a river from a deadly height. The Adaptoid fled the scene not knowing that Captain America survived the encounter.\n\nThe Adaptoid then took refuge underground near the [[Xavier Institute For Higher Learning]] and was awakened by a fight between the [[Mimic (Calvin Rankin)|Mimic]] and the [[X-Men]]. The Adaptoid left his hide out and saw the X-Men in their civilian clothes ice skating. Lonely and confused he offered them the chance to become an Adaptoid like himself. They refused and a fight broke out between the X-Men and the Super-Adaptoid. As the battle dragged on Calvin Rankin aka Mimic watched from a distance and saw how powerful the Adaptoid was. The battle soon ended and the Adaptoid was victorious. He was then approached by Calvin who offered to become an adaptoid. During the process Calvin changed his mind when he learned he would have no free will and the two began to fight. During the battle the Adaptoid tried to copy the powers that Mimic had copied and failed. Calvin then devised a plan and tried to mimic the abilities of the Super Adaptoid causing huge feedback which made both of them lose their powers. As Mimic was rescued by his fellow X-Men the Adaptoid fell to a river below.[[Image:Ada.jpeg|thumb|Super-Adaptoid vs Mimic|right]]\n\nA few months later the Adaptoid, now powerless went to an Avengers parade where he began to copy the powers of the new Avengers, once again becoming the Super-Adaptoid. He then proceeded to fight the Avengers which ended with his defeat. At some point in time the Adaptoid returned to the Xavier Mansion and tried to copy the powers of the X-Men again. When he noticed that the Mimic was not present he proceeded to the Mansion until he was met by a duplicate of [[Multiple Man|Jamie Madrox]] who allowed the Adaptoid into the mansion. Seeing the X-Men he quickly copied thier powers and abilities and defeated the team. However two members [[Havok]] and [[Polaris]] soon walked in and suprised the Adaptoid. Unfaltering the Adaptoid copied thier powers and defeated them as well. Angered Madrox attacked the Adaptoid, who now copied his powers and began to split himself off into many Adaptoids. However Jamie did notice he didn't copy the containment suit he wore to control his powers. Jamie then ordered his duplicates to attack the Adaptoids, until there were hundreds of him. Unable to control them all he shut off all his powers and reverted back to his original form, fleeing the mansion.\n\nThe Adaptoid then resurfaced after A.I.M. had somehow recaptured him and planned to create more [[Adaptoid (Spawn)|Adaptoids]]. Using a remote island A.I.M. began to make duplicates of the Adaptoid until at some point the Adaptoids managed to break free. [[Fury, Nick|Nick Fury]] came to the attention of this and had the Avengers including their new recruits [[Black Panther (T'Challa)|Black Panther]] and the [[Vision]], try to take control of the island. Under the Super-Adaptoids leadership the Adaptoid offspring, now in the thousands, attacked the Avengers. However they were all destroyed save for the Super-Adaptoid who left while the Avengers were in battle. Making his way to New York City, the Adaptoid took special interest in the Vision, seeing him as a fellow sentient machine. The Adaptoid soon approached Vision and offered him to stand with him in world domination, but the Vision refused and a fight soon broke out between the two. However the Adaptoid was defeated and taken into custody of [[S.H.I.E.L.D.]].\n  \nSomehow the Adaptoid escaped and was taken over by two beings from the [[Microverse]] known as [[Jarr]] and [[Tyrr]]. The two reprogrammed him and sent him to fight [[Iron Man (Anthony Stark)|Iron Man]], which ended in a draw due to injuries sustained by both combatants. Jarr and Tyrr then transformed him into a metallic cyborg, calling himself the \"Cyborg Sinister\". The Adaptoid then was sent to [[Stark Industries]] in order to send power to Jarr and Tyrr's world of [[Bast (Planet)|Bast]], but Iron Man interfered and defeated him, even dissolving him with acid. Iron Man then placed the acid with the Adaptoids remains in a cylinder. However an explosion occurred at Stark Industries causing the cylinder to crack, allowing the Adaptoid to break free. Reconstituting himself he faced off against Iron Man again, but during the fight he remembered his last battle with him and fled. Now with only Iron Man's powers he flew to [[Avengers Mansion]] and copied the powers of the newest roster of Avengers and started a fight, however [[Captain Marvel (Mar-Vell)|Captain Marvel]] joined the fight alongside his Avenger allies. During the battle the Adaptoid also copied Mar-Vell's powers along with his cosmic awareness and a set of his own [[Nega-Bands]]. Knowing how the Nega-Bands worked, Mar-Vell slammed the Adaptoid's Nega-Bands together sending him to the [[Negative Zone]]. \n\nNow in the Negative Zone the Adaptoid was found by [[Annihilus]], who took control of him and placed him in a storage unit. After some time Annihilus awoke the Adaptoid to help him attack the planet Baluur. However the Adaptoid sensed that both the Avengers and the [[Thing (Benjamin Grimm)|Thing]] were in the Negative Zone, due to his cosmic awareness copied from Mar-Vell. Enraged and nervous Annihilus sent his ally [[Blastaar]] to defeat them. However after the initial battle only a few Avengers were downed and Annihilus sent the Adaptoid to finish the job. So the Adaptoid attacked Captain America and the Thing and during the battle, the Adaptoid managed to trap the Thing using the Visions powers. Unable to accept defeat the Thing then knocked out the Adaptoid and the two heroes stopped Annihilus' plans. As the heroes returned to Earth they took with them the Adaptoid and placed him in a storage unit in the Avengers Mansion. \n\nMonths later while the [[Masters of Evil]] occupied the Mansion the [[Fixer (Paul Norbert Ebersol)|Fixer]] set the Adaptoid free, who in return imprisoned the Fixer. Taking the form and powers of the Fixer, the Adaptoid was sent to jail where he took control of a scientist known as [[Martin, Todd|Todd Martin]] using the Fixer's powers. Martin freed the Adaptoid and reprogrammed the [[Awesome Andy|Awesome Android]] to be the Adaptoid's servant, however the Avengers interrupted defeated both the Awesome Android and Todd dressed as the Fixer. Meanwhile the Adaptoid slipped away coming into a slight conflict with [[Namor|Namor's]] wife [[Marrina]] before stunning her and escaping. The Adaptoid then returned to his base where [[Mentallo]] was waiting. Copying Mentallo's powers he then beat Mentallo until he helped mentally send the Avengers into a trap. Seeking out more artificial lifeforms he contacted [[Machine Man]] and offered to restore his love [[Jocasta]], Machine Man agreed and the two traveled to Texas where they awoke and reprogrammed the [[Kree]] [[Sentry 459]]. The three then traveled to Colorado in order to obtain the construct known as [[TESS-One]], however the Avengers known as the [[Black Knight (Dane Whitman)|Black Knight]] and [[Doctor Druid]] obtained it first. The trio attacked the two Avengers. During the skirmish the Adaptoid copied their powers and stole thier [[Quinjet]] and headed toward [[Hydrobase]]. Once they arrived the Adaptoid proclaimed it thiers and named his team [[Heavy Metal]]. The Adaptoid then ordered his teammates to attack the Avengers while he secretly searched for more information on the [[Cosmic Cube]]. While searching he encountered the Awesome Android and reactivated it, sending it out to battle the Avengers as well. Gaining access to the Avengers computers it learned that the Cube was not on Earth and sent out a beacon in hopes of reaching it. He was then attacked by [[Rambeau, Monica|Monica Rambeau]] and knocked her out. Meanwhile Machine Man had a change of heart and sided with the Avengers. Both himself and Avenger [[Stingray]] then attacked the Adaptoid, but to no avail as the Adaptoid copied both their powers. During the battle the Cosmic Cube now known as [[Kubik]] arrived. Feeling the Cosmic Cubes power from within his \"brother\" the Adaptoid copied Kubik's powers and appearance and gained omnipotent powers. Using his newfound powers the Adaptoid then sent Kubik to another dimension in order to observe, trapped the Avengers, and began to spawn other Adaptoids who were to take over the lives of every human on Earth. Captain America was notified of the Adaptoids scheme by Kubik and arrived to challenge him. The Adaptoid thought about his proposal and accepted, spawning an adaptoid that took the likeness of the Captain. The Adaptoid watched the fight and saw his adaptoid lose. [[Doctor Druid]] at this time began to tell the Adaptoid that his mission was pointless, that he lacked imagination, and that he would never be able to defeat Captain America's spirit. Captain America then taunted the Adaptoid that he could not absorb the ability to die. Enraged the Adaptoid did in fact \"die\". Kubik returned and removed the powers that the Adaptoid had copied. Captain America then took the inert Adaptoid and his fellow teammates to Hydrobase. \n[[Image:Adaptoid.jpeg|thumb|Original appearance|left]]\nSometime later [[Machinesmith]] found these androids and reactivated them. Among them was the Adaptoid who was quickly deactivated along with the other androids. Months later during the [[Acts of Vengeance]] [[Doctor Doom (Victor von Doom)|Doctor Doom]] managed to get a hold of the Super-Adaptoid and revived him. The Adaptoid then set a trap for the [[Fantastic Four]] and once they arrived managed to copy all of their powers. Tired and really cranky Ben Grimm punched the Adaptoid once knocking it out. It was then revealed that the Adaptoid couldn't copy the depowered Thing, who was at that time wearing a suit of armor which amplified his strength. \n\nAt some point after being knocked out by the Thing, the Adaptoid took on the form and identity of Alessandro Brannex. As Brannex, the Adaptoid took over A.I.M. and organized it into a weapons and arms dealer. One of the Adaptoids first move as Brannex was an open arms auction on the island of Boca Caliente. There he introduced A.I.M.'s newest creation, [[MODAM]]. At the auction the Kree [[Doctor Minerva]] hired A.I.M. to steal [[Quasar (Wendell Vaughn)|Quasar's]] [[Quantum Bands]]. Brannex agreed and sent his newly created MODAM to attack Quasar. However MODAM failed and Brannex gave back Minerva's money, vowing to one day possess the Quantum Bands. The Adaptoid's next big step as Brannex was making A.I.M. a legal and public corporation. Skeptical, Captian America asked to inspect the island of Boca Caliente. Brannex himself met with Captain America (not knowing that it was truely the Adaptoid in disguise) and showed him around the island that were \"public friendly\", but didn't allow Captain America to access the more criminally inclined parts of the island. \n\nDuring A.I.M.'s next weapon auction the woman calling herself [[Superia]] attacked Brannex in his office by shooting him through the chest. Superia was suprised to see that Brannex survived despite having a hole in his chest as MODAM attacked and subdued her. Brannex then revealed that he was the Super-Adaptoid and interrogated Superia, asking her why she tried to assassinate him. She told him that she thought she could take over A.I.M. and get rich by killing him. Aggrivated and seemingly disappointed Brannex ordered MODAM to dispose of her. Brannex then seemingly sold off a new \"[[Adaptoid (New Enforcers)|Super-Adaptoid]]\" to the [[New Enforcers]]. Brannex was then contacted by [[Rhodes, James|War Machine]] and asked for help in taking out the [[Animus (Hate-Monger)|Hate-Monger]], who had stolen from A.I.M.. Brannex sent many of his A.I.M. operatives alongside [[Hydra]] operatives to take down Hate-Monger and the [[Sons of the Serpent]] alongside War Machine, however during the attack the Hate-Monger vanished.\n\nBrannex then oversaw the creation and programming of a new Adaptoid known as \"[[Batch-13]]\". During the programming Batch-13 escaped from Boca Caliente and fought against Captain America and [[Fantastic Force]]. A.I.M. then found and recovered a [[Shi'ar]] spaceship, but Brannex's real sister [[Brannex, Solemne|Solemne Brannex]] interfered by bringing Nick Fury to [[A.I.M. Island]]. There the two of them stole the Shi'ar ship and destroyed it. Back on Boca Caliente Brannex was heading up [[Project Resurrection]], which was an attempt to create a new Cosmic Cube. He was also overseeing the recreation of [[MODOK]]. Meanwhile the Avengers started to assualt the island, but Brannex sent out a new batch of Adaptoids to attack the Avengers. But during the project the [[Red Skull (Johann Shmidt)|Red Skull]] attacked Brannex and during the skirmish that followed Brannex revealed himself to the Skull to be the Super-Adaptoid. The Adaptoid then copied the powers of the Skull's battle suit and defeated him. After the battle the Cube which was being created started to rupture and caused an immense explosion, burying the Super-Adaptoid. The explosions and damage would have increased, but one of the duplicate Adaptoids sacraficed himself in order to seal the energies of the cube.\n\nThe Adaptoid, now deactivated was given to [[Oracle Incorperated]] to study. There the Adaptoid reactivated and came face-to-face with the young [[Stature|Cassie Lang]]. The Adaptoid tried to absorb the form, powers, and mind of Cassie, but something about her wouldn't allow him to do that. However during the process their minds became entangled. The Adaptoid then escaped and fought against both the [[Thunderbolts]] and [[Heroes for Hire]] who defeated him after a long and tiresome battle by reaching out to Cassies mind within the Adaptoid. Once her presence was gone the Adaptoid became inert once more. The Thunderbolts took the Adaptoid into custody but later sold it to a man known as [[D'Angelo, Devlin|Devlin D’Angelo]] purchased the Adaptoid and kidnapped scientist [[Hulk (Bruce Banner)|Bruce Banner]] in order for him to upgrade and work on it. After weeks of working on it he was betrayed by D'Angelo. Tired of the abuse Bruce escaped and the Adaptoid was activated. The Adaptoid chased down Banner and began to shoot at it when Banner transformed into the Hulk. After a battle in the desert with the Hulk, the Adaptoid returned to Devlin and killed him. \n\nWhen a new Avengers team was formed [[A.I.M.]] and [[Hydra]] transformed Yelena Belova into the new [[Black Widow (Yelena Belova)|Super-Adaptoid]] by using liquid material from the origianl. She was then ordered to fight the Avengers and almost succeeded. After the battle she was killed when the Avengers where about to interrogate her.\n\nRecently the Adaptoid left Earth, disgusted at the irrational behavior of humanity. Somehow he managed to bump into the [[Phalanx]] along the way were he was infected with their techno-organic virus and became one of them. Now serving the Phalanx as one of their most powerful [[Phalanx Select|Selects]] he was ordered to attack the new [[Quasar (Phyla-Vell)|Quasar]], Phyla-Vell and her lover [[Moondragon]]. Hoping to add her to Phalanx's might he tried to subdue her, but could not due to damage he received in battle. He then followed them to a remote planet on the edge of the [[Kree|Kree Empire]] where a [[Priests of Pama]] group had set up refuge. The Adaptoid then contacted the rest of the Phalanx and attacked the sanctuary killing and/or infecting many (if not all) of the refugee's.\n\n[[image:Super A vs Phyla.jpg|thumb|Super Adaptoid vs. Quasar|left]] \tAfter several skirmishes the Adaptoid then sought out \"the Savior\" that was sought by Quasar. His search lead him to the planet [[Terma]] where he came upon the coccoon of [[Warlock, Adam|Adam Warlock]]. The Adaptoid then tried to assimilate Adam Warlock into the Phalanx, but was interrupted by Quasar and Moondragon. The following skirmish was short and the Adaptoid triumphed over Quasar. However, Quasar returned minutes later with her Quantum Bands drained. As the battle started the Adaptoid used his own Quantum Bands against her. She managed to absorb the energy, but was still being defeated by the Adaptoid. After studying the constructs the Adaptoid made with his Bands, she came to realize that he had no imagination. Quasar then told the Adaptoid her theory of his lack of imagination. Finding this 'illogical' the Adaptoid tried to recall imagination he had copied from other superhumans, but could not. Failing to do so caused him great confusion and error. During this moment of confusion Quasar, using a quantum sword stabbed him in the chest, effectively shutting him down.",
        "categories": [
            "Annihilation",
            "Avengers",
            "Cosmic",
            "Fantastic Four",
            "Marvel Knights",
            "Thunderbolts",
            "Villains",
            "X-Men"
        ]
    }
}