{
    "id": 1011344,
    "name": "Jazinda",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/b/00/4c002e3dbc0b3",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011344",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011344/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011344/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011344/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011344/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011344/jazinda?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Jazinda?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "blurb": "",
        "real_name": "Jazinda Kl'rt-spawn",
        "aliases": "Jaz; impersonated Darqon Par, General Eng, Jenifer Walters, Mrs. Murphy, others",
        "identity": "No dual identity",
        "occupation": "Bail enforcement agent, galactic bounty hunter; former agent of the Skrull empire",
        "citizenship": "[[Skrull|Skrull Empire]]",
        "place_of_birth": "Tarnax VI, Andromeda galaxy",
        "relatives": "[[Super-Skrull|Kl'rt]] (Super Skrull, father), Mother (unknown), [[Sarnogg]] (brother, presumed deceased)",
        "groups": "[[Freeman Bonding Inc. (F.B.I.)]], [[Lady Liberators]] (honorary member)",
        "education": "Unrevealed",
        "height": "5'6\" (variable)",
        "weight": "135 lbs. (variable)",
        "eyes": "Green (variable)",
        "hair": "Black (variable)",
        "powers": "Jazinda possesses the natural shape-shifting abilities of the Skrull race, although she prefers her human disguise. As with many Skrulls, her strength and stamina is greater than that of the average human being.",
        "abilities": "Jazinda is a highly accomplished spy skilled in infiltration and espionage, excellent in both armed and unarmed combat, a starship pilot, and gifted in tracking.",
        "weapons": "",
        "paraphernalia": "Jazinda is bonded to the [[Sy-Torak gem]], a Skrull artifact that revives her from any fatal injury.",
        "debut": "She-Hulk #22 (2007)",
        "origin": "",
        "significant_issues": "",
        "main_image": "Jazinda.jpg",
        "bio_text": "Jazinda is the current partner of [[She-Hulk]], they are both currently employed by Freeman Bonding Inc. (F.B.I.). They are bounty hunters who track down wanted criminals. During their first mission, Jazinda posed as Jennifer Walters, She-Hulk's alter ego, to bring in the criminal known as [[Hi-Lite]].",
        "bio": "Jazinda is the current partner of [[She-Hulk]], they are both currently employed by Freeman Bonding Inc. (F.B.I.). They are bounty hunters who track down wanted criminals. During their first mission, Jazinda posed as Jennifer Walters, She-Hulk's alter ego, to bring in the criminal known as [[Hi-Lite]].\n\nDuring the arrest of Hi-Lite, Jazinda locked horns with the [[Absorbing Man]], who broke her neck; little did she know that the Absorbing Man was Hi-Lite's cousin. Having no way to know that Jazinda was only impersonating Jennifer Walters, he attempted to kill her for payback, for all the misery she had caused his wife, [[Titania]]. Jazinda quickly healed from her injuries and took Hi-Lite into custody before joining the real She-Hulk in the fight against The Absorbing Man and Titania.\n\nShe later received an angry message from her father, [[Super-Skrull|Kl'rt]] the Super-Skrull. He called Jazinda a traitor to her race, and swore that if they would ever meet each other again, he would kill her. During the Skrulls' [[Secret Invasion]], Super-Skrull traveled to [[Earth]] to fulfill his promise to his daughter, only to find her locked in battle with the Talisman known as [[Sacrosant]]. She-Hulk intervened, and battled the Super-Skrull. Jazinda's tussle with the Talisman ended with them smashing the ship's console, which sent them plummeting to the Earth. Jazinda survived the crash, but the resolution of the battle came when the Super-Skrull departed with the Talisman instead of fulfilling his promise to kill his daughter.\n\nSometime later Jazinda and She-Hulk traveled to Milwaukee in search of a bail jumper by the name of [[Farrell, Max|Max Farrell]], or “Captain Feral” as he sometimes is referred. The apprehension of Max was interrupted by the sudden appearance of a very powerful woman serving the entity [[Enmity]]. Jazinda and She-Hulk appeared to be at the point of defeat, but an unknown benefactor mysteriously saved them. Jazinda and She Hulk were teleported to a strange room, where they were met by [[Storm]], [[Invisible Woman]], [[Thundra]] and the [[Valkyrie]]. The six women realized that they were being held captive, and used their combined power to break through the barrier that was holding them. They were surprised to see four other cosmic women heroes, ([[Gamora]], [[Lyja|Lyja the Laser Fist]], [[Mantis]], [[Quasar (Phyla-Vell)|Phyla-Vell]]) on the other side of the barrier. Suddenly the [[Collector]] appeared out of nowhere; he was under attack by [[Unum]], who Jazinda quickly recognized for their earlier encounter. Unum was defeated an all ten women were returned to their prior locations by the Collector.",
        "categories": [
            "Heroes",
            "Women"
        ]
    }
}