{
    "id": 1011279,
    "name": "Masters of Evil",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/9/30/4c002e75e67db",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011279",
    "comics": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011279/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/7343",
                "name": "Avengers (1963) #9"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/87",
                "name": "Marvel Masterworks: The Avengers Vol. (Hardcover)"
            }
        ],
        "returned": 2
    },
    "series": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011279/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1991",
                "name": "Avengers (1963 - 1996)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/1390",
                "name": "Marvel Masterworks: The Avengers Vol. (2004)"
            }
        ],
        "returned": 2
    },
    "stories": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011279/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/15249",
                "name": "The Coming the... Wonder Man!",
                "type": "interiorStory"
            }
        ],
        "returned": 1
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011279/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011279/masters_of_evil?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Masters_of_Evil?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "base_of_operations": "Justine Hammer's Symkarian estate; formerly Mount Charteris complex, Burton Canyon, Colorado; Doctor Octopus's lair; Avengers Mansion; Helmut Zemo's lair; Egghead's suburban hideout; Rutland, Vermont; Crimson Cowl's underground lair, New York City; Heinrich Zemo's Amazon jungle castle",
        "debut": "Avengers #6 (1964)",
        "origin": "",
        "significant_issues": "",
        "current_members": "None",
        "former_members": "[[Absorbing Man]] (Carl “Crusher” Creel), [[Aqueduct]] (Peter van Zante), [[Baron Zemo (Heinrich Zemo)|Baron Zemo]] (Heinrich Zemo), [[Baron Zemo (Helmut Zemo)|Baron Zemo]] (Helmut Zemo), [[MACH-IV|Beetle]] (Abner Jenkins), [[Black Knight (Nathan Garrett)|Black Knight]] (Nathan Garrett), [[Black Knight (Dane Whitman)|Black Knight]] (Dane Whitman), [[Black Mamba]] (Tanya Sealy), [[Blackout (Marcus Daniels)|Blackout]] (Marcus Daniels), [[Manfredi, Joseph|Blackwing]] (Joseph Manfredi), [[Bison]] (William Kitson), [[Blizzard (Donald Gill)|Blizzard]] (Donald Gill), [[Boomerang]] (Fred Myers), [[Bulldozer (Henry Camp)|Bulldozer]] (Henry Camp), [[Harrier|Cardinal]] (Donald Clendenon), [[Constrictor]] (Frank Schlichting), [[Crimson Cowl (Justine Hammer)|Crimson Cowl]] (Justine Hammer), [[Cyclone (Pierre Fresson)|Cyclone]] (Pierre Fresson), [[Doctor Octopus (Otto Octavius)|Doctor Octopus]] (Otto Octavius), [[Dragonfly (Veronica Dultry) | Dragonfly]] (Veronica Dultry), [[Eel (Edward Lavell)|Eel]] (Edward Lavell), [[Egghead]] (Elihas Starr), [[Enchantress]] (Amora), [[Executioner (Skurge)|Executioner]] (Skurge), [[Fixer (Paul Norbert Ebersol)|Fixer]] (Paul Norbert Ebersol), [[Flying Tiger]], [[Gargantua]] (Edward Cobert), [[Atlas (Erik Josten)|Goliath]] (Erik Josten), [[Grey Gargoyle]] (Paul Duval), [[Skein|Gypsy Moth]] (Sybil Dvorak), [[Hydro-Man]] (Morris Bench), [[Icemaster]], [[Jackhammer]], [[Joystick]] (Janice Yanizeski), [[Klaw]] (Ulysses Klaw), [[Lodestone (Andrea)|Lodestone]] (Andrea), [[Machinesmith]] (Samuel Saxon), [[Man-Ape]] (M'Baku), [[Man-Killer]] (Katrina van Horn), [[Melter]] (Bruno Horgan), [[Mister Hyde]] (Calvin Zabo), [[Moonstone (Karla Sofen)|Moonstone]] (Karla Sofen), [[Oddball]] (Elton Healey), [[Piledriver (Brian Calusky)|Piledriver]] (Brian Calusky), [[Powderkeg]], [[Puff Adder]] (Gordon Fraley), [[Quicksand]], [[Radioactive Man (Chen Lu)|Radioactive Man]] (Chen Lu), [[Scorcher]] (Steven Hudak), [[Venom (Mac Gargan)|Scorpion]] (Mac Gargan), [[Songbird|Screaming Mimi]] (Melissa Gold), [[Shatterfist]], [[Shocker (Herman Schultz)|Shocker]] (Herman Schultz), [[Shockwave]] (Lancaster Sneed), [[Slyde]] (Jalome Beacher), [[Sunstroke]], [[Supercharger]], [[Thunderball]] (Eliot Franklin), [[Tiger Shark]] (Todd Arliss), [[Titania (Mary MacPherran)|Titania]] (Mary MacPherran), [[Whirlwind]] (David Cannon), [[Wrecker (Dirk Garthwaite)|Wrecker]] (Dirk Garthwaite), [[Yellowjacket (Rita DeMara)|Yellowjacket]] (Rita DeMara)",
        "other_members": "[[Ultron|Crimson Cowl]] (Ultron)",
        "main_image": "MastersofEvil442.jpg",
        "bio_text": "The Masters of Evil is one of the largest and longest-running alliances of super-villains in history, led by assorted criminal masterminds and comprised of an ever-changing membership ranging from minor thugs to major menaces. In many ways, they are the criminal equivalent of the [[Avengers]], the Masters' first and most frequent foes.",
        "bio": "The Masters of Evil is one of the largest and longest-running alliances of super-villains in history, led by assorted criminal masterminds and comprised of an ever-changing membership ranging from minor thugs to major menaces. In many ways, they are the criminal equivalent of the [[Avengers]], the Masters' first and most frequent foes.\n\nAfter seemingly slaying [[Captain America (Steve Rogers)|Captain America]] and [[Winter Soldier|Bucky]] during World War II, the Nazi scientific genius [[Baron Zemo (Heinrich Zemo)|Heinrich Zemo]] had withdrawn to South America, where he subjugated a native tribe, carving out his own private kingdom. Zemo lived in seclusion until recent years when he learned that the Avengers had found and revived Captain America. Determined to destroy his old enemy but unwilling to face the Avengers alone, Zemo recruited the super-criminals [[Black Knight (Nathan Garrett)|Black Knight]], [[Melter]], and [[Radioactive Man (Chen Lu)|Radioactive Man]] (foes of Avengers members [[Yellowjacket (Henry Pym)|Giant-Man]], [[Iron Man (Anthony Stark)|Iron Man]] and [[Thor (Thor Odinson)|Thor]], respectively). Calling themselves the Masters of Evil, the villains drew the Avengers into battle by spraying the streets of New York with Zemo's Adhesive X, causing citywide chaos. Aided by adhesives expert [[Trapster|Paste-Pot Pete]], the Avengers defeated the Masters, and Zemo himself barely escaped.\n\n[[image:MastersofEvil.jpg|thumb|right|180px]]Zemo formed a new alliance with Thor's foes Amora the [[Enchantress]] and [[Executioner (Skurge)]]. The trio mystically turned Thor against the Avengers, but the spell soon broke and Thor hurled them into another dimension. Upon returning, the Masters mutated embezzler Simon Williams into [[Wonder Man]], who infiltrated and betrayed the Avengers on Zemo's behalf; however, in the end, a conscience-stricken Williams sacrificed himself to save the Avengers. The Masters' brief alliance with the mysterious time lord [[Immortus]] fared little better, resulting in another Avengers victory. Retrieving Black Knight and Melter from prison, the Masters regrouped in New York for an all-out assault on the Avengers while Zemo faced Captain America in the Amazon. The Masters were defeated yet again, and Zemo accidentally killed himself in battle. \n\nWith Zemo gone, the Masters broke up; but the mad robot [[Ultron]] (a rogue creation of Avengers founder Henry Pym), hiding his mechanical nature behind the costumed identity of the Crimson Cowl, recruited Melter, Radioactive Man, [[Klaw]], and [[Whirlwind]] into a new Masters of Evil in a plot to destroy the Avengers. Ultron hypnotized Avengers butler [[Jarvis, Edwin|Edwin Jarvis]] into compromising the Avengers' security system, even compelling Jarvis to act as his occasional stand-in, supposedly the \"real\" Crimson Cowl; but a new [[Black Knight (Dane Whitman)|Black Knight]] (Dane Whitman), secretly the heroic nephew of his recently deceased predecessor, had joined Ultron's Masters to fight them from within. Thanks in part to the efforts of Whitman and a repentant Jarvis, the Masters were defeated; however, they soon regrouped (minus Ultron and Whitman) in an attempt to kidnap noted scientist Dr. T. W. Erwin from the annual Halloween parade in Rutland, Vermont. They were soundly defeated through the combined efforts of the Avengers and the short-lived feminist super-group known as the [[Lady Liberators]]. \n\nThe Masters reorganized under criminal scientist [[Egghead]], who had faked his own death and framed his old foe Hank Pym for treason, recruiting [[Moonstone (Karla Sofen)|Moonstone]], [[Venom (Mac Gargan)|Scorpion]], [[Tiger Shark]], and Whirlwind to serve him. However, an overeager Whirlwind made an unauthorized attack on his old foe [[Wasp]], leading the Masters into an unplanned battle with the Avengers, and all four of Egghead's recruits were captured. Freeing Moonstone and Tiger Shark, Egghead also hired the [[MACH-IV|Beetle]], the [[Shocker (Herman Schultz)|Shocker]], and the Radioactive Man, and had the Masters abduct Pym from his treason trial, framing Pym as their employer; they even deliberately allowed the Avengers to capture the Shocker, who had been brainwashed into believing Pym was the Masters' leader. Egghead put the seemingly broken Pym to work in his secret lab on a project seeking a means of immortality, but Pym quickly constructed an arsenal of disguised super-weaponry which he used to defeat the Masters single-handedly. By this time, the Avengers had proven Pym's innocence and tracked down Egghead, who was trying to shoot the victorious Pym in the back when [[Hawkeye (Clint Barton)|Hawkeye]] arrived just in time to plug the villain's energy gun with an arrow, causing a backfire that killed Egghead-an ironically fitting end, as Egghead had killed Hawkeye's brother, Barney Barton, years earlier. \n\nBy now, Helmut Zemo had assumed his late father's title as the new [[Baron Zemo (Helmut Zemo)|Baron Zemo]]. Trying to destroy Captain America through his love for the Avengers, Zemo assembled the largest Masters of Evil up to that point, recruiting [[Absorbing Man]], [[Titania (Mary MacPherran)]], Moonstone, [[Grey Gargoyle]], [[Songbird|Screaming Mimi]], [[Yellowjacket (Rita DeMara)|Yellowjacket]], [[Blackout (Marcus Daniels)|Blackout]], [[Bulldozer (Henry Camp)|Bulldozer]], [[Fixer (Paul Norbert Ebersol)|Fixer]], [[Atlas (Erik Josten)|Goliath]], [[Mister Hyde]], [[Piledriver (Brian Calusky)|Piledriver]], [[Thunderball]], Tiger Shark, [[Wrecker]], and Whirlwind. Grey Gargoyle and Screaming Mimi were captured by the Avengers and [[Paladin]] during Zemo's recruiting drive, and the unreliable Whirlwind was sent off on a make-work assignment, but the rest of the Masters staged a carefully planned assault in which they managed to invade and occupy [[Avengers Mansion]], wrecking the historic headquarters, taking Jarvis and several Avengers hostage, beating [[Hercules]] nearly to death, and forcing Captain America to watch while Jarvis was brutally tortured. Aided by [[Ant-Man (Scott Lang)|Ant-Man]] and [[Doctor Druid]], the Avengers finally retook the Mansion. A few Masters escaped, but more were captured, Blackout was killed, and Zemo and Moonstone were both gravely injured. Whirlwind and Tiger Shark were soon apprehended by [[Tigra]], [[Hellcat]] and Hank Pym. \n\nCriminal mastermind [[Doctor Octopus (Otto Octavius)|Doctor Octopus]] formed the next Masters with Absorbing Man, Shocker, Titania, Yellowjacket, [[Gargantua]], [[Jackhammer]], [[Oddball]], [[Powderkeg]], and [[Puff Adder]]. This group tried to loot Avengers Mansion during the [[Infinity War]], but were thwarted through the combined efforts of the Avengers staff, the visiting [[Guardians of the Galaxy]] and Yellowjacket, who switched sides and soon went on to join the Guardians. The Guardians and Masters were also briefly forced to team up against a horde of doppelgangers spawned by the Infinity War. In the end, half of the Masters were captured and the rest turned on Octopus, forcing him to flee. \n\n[[image:mastersofevil01.jpg|thumb|left|230px]]Z[[Black Talon]], Goliath, and [[Man-Ape]] formed an alliance against Wonder Man in concert with disguised demons under the auspices of [[Mephisto]]. This grouping was referred to in passing as a possible revival of the Masters of Evil (even though it more closely resembled the [[Lethal Legion]]), but they broke up almost immediately and many of these events may have been part of an elaborate illusory deception spun by Mephisto. Helmut Zemo began rebuilding his own Masters, recruiting Fixer, Screaming Mimi, Beetle, Goliath, and Moonstone; but after the [[Avengers]] were seemingly killed in the [[Onslaught (event)|Onslaught]] disaster, Zemo decided to disguise his group as a new super-hero team called the [[Thunderbolts]], accumulating public trust and resources while plotting world conquest. The ruse worked too well, however, and most of the Thunderbolts opted to keep playing super hero after their cover was blown, breaking away from Zemo. \n\nBy this time, a mysterious new female [[Crimson Cowl (Justine Hammer)|Crimson Cowl]] had formed a more mercenary Masters of Evil alongside Klaw, Tiger Shark, [[Cyclone (Pierre Fresson)|Cyclone]], [[Flying Tiger]], and [[Man-Killer]], and they repeatedly battled the Thunderbolts both before and after their split with Zemo, eventually delivering an ultimatum: rejoin the Masters or be destroyed. Taking over the abandoned high-tech Mount Charteris complex as their headquarters and recruiting a small army of new members-including [[Aqueduct]], [[Bison]], [[Manfredi, Joseph|Blackwing]], [[Boomerang]], Cardinal, [[Constrictor]], [[Dragonfly (Veronica Dultry)| Dragonfly]], [[Eel (Edward Lavell)|Eel]], [[Icemaster]], [[Joystick]], [[Lodestone (Andrea)|Lodestone]], Man-Ape, [[Quicksand]], [[Scorcher]], [[Shatterfist]], [[Shockwave]], [[Slyde]], [[Sunstroke]], and [[Supercharger]]-the Masters used weather control technology to launch a grand global blackmail scheme which was foiled by the Thunderbolts (now led by Hawkeye), who captured almost all the Masters and adopted the Mount Charteris base as their new headquarters.\n\nThe Cowl escaped, rebuilding her Masters with Cardinal, Cyclone, Man-Killer, [[Black Mamba]], [[Skein]], [[Hydro-Man]], and [[Machinesmith]], and embarked on a quest to control a biotoxin produced by the late [[Hammer, Justin|Justin Hammer]] that had secretly infected many super-beings, giving whoever controlled the toxin the power of life and death over them. When the Masters realized they were infected by the toxin as well, half of them-including Cardinal, Cyclone, Man-Killer, and Gypsy Moth-defected to Hawkeye's Thunderbolts and helped defeat the Cowl, who was exposed as Hammer's daughter, Justine. The Cowl and her remaining Masters were all captured, and the biotoxin was neutralized by Thunderbolts member [[Plantman|Blackheath]]. How and when the Masters will reorganize next remains to be seen, but ex-Masters such as MACH-IV (Beetle), Songbird (Screaming Mimi), Atlas (Goliath), Joystick and Radioactive Man remain active as the heroic Thunderbolts alongside other ex-villains such as [[Blizzard (Donald Gill)|Blizzard]], [[Photon (Genis-Vell)|Photon]] and [[Speed Demon]]-a most surprising legacy for the Masters of Evil.",
        "categories": [
            "Avengers",
            "Villains"
        ]
    }
}