{
    "id": 1011353,
    "name": "Cosmo",
    "description": "",
    "modified": "1969-12-31T19:00:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/9/70/4ce5a6c1c9554",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1011353",
    "comics": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011353/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/39982",
                "name": "Annihilators: Earthfall (2011) #1"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/37979",
                "name": "The Thanos Imperative: Devastation (2010) #1"
            }
        ],
        "returned": 2
    },
    "series": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011353/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/14818",
                "name": "Annihilators: Earthfall (2011)"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/13604",
                "name": "The Thanos Imperative: Devastation (2010)"
            }
        ],
        "returned": 2
    },
    "stories": {
        "available": 2,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011353/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/83506",
                "name": "Interior From The Thanos Imperative: Devestation (2010) #1",
                "type": "interiorStory"
            },
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/90732",
                "name": "Annihilators: Earthfall (2011) #1",
                "type": "interiorStory"
            }
        ],
        "returned": 2
    },
    "events": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1011353/events",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/events/294",
                "name": "The Thanos Imperative"
            }
        ],
        "returned": 1
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1011353/cosmo?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Cosmo_(dog)?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel Universe]]",
        "real_name": "Cosmo",
        "identity": "Secret",
        "aliases": "None",
        "occupation": "Chief of Security on [[Knowhere]]",
        "place_of_birth": "Possibly Russia",
        "groups": "[[Guardians of the Galaxy]]; formerly Security forces on Knowhere",
        "citizenship": "Citizen of Knowhere",
        "education": "Unrevealed",
        "relatives": "Unrevealed",
        "height": "23\" (at withers)",
        "weight": "70 lbs.",
        "eyes": "Brown",
        "hair": "Golden-yellow fur",
        "powers": "Cosmo is a high-level telepath with the added abilities to create defensive shields wide enough to block a corridor and strong enough to deflect energy blasts, and project powerful mind blasts of tremendous force. The level of his powers has yet to be revealed, but Cosmo has proven himself to be powerful enough to take on a being such as [[Warlock, Adam|Adam Warlock]] single handedly, and strong enough to unleash a telekinetic blast potent enough to disable two teams of super beings.",
        "abilities": "Cosmo has heightened senses of a dog, and he can talk. In addition, Cosmo has access to all of Knowhere's technology and information resources when he needs it.",
        "weapons": "None",
        "paraphernalia": "Besides his space suit, Cosmo wears something called a [[Dimensional Envelope]] on his collar where he can safely contain life forms for a finite period of time.",
        "debut": "Nova #8 (2008)",
        "origin": "Unrevealed",
        "significant_issues": "Met Nova on Knowhere, battled the Luminals and Abyss (Nova #8-9, 2008); Became liaison to the Guardians of the Galaxy and was at odds with them when Adam Warlock thought Cosmo was allied with Skrull terrorists (Guardians of the Galaxy #1-6, 2008); Cosmo sent a message to Adam Warlock from the future using Knowhere as a conduit (Guardians of the Galaxy #16, 2009); Allied with Kang to return to his time but apparently killed Magus (Guardians of the Galaxy #17-18, 2009); revealed to still be alive, along other guardians, prisoners of the Magus (Guardians of the Galaxy #22, 2010); versus Universal Church of Truth and Thanos to get to freedom (Guardians of the Galaxy #24-25, 2010)",
        "main_image": "Cosmo_(new).jpg",
        "bio_text": "Heading up the security forces in a place called [[Knowhere]], Cosmo met a distraught [[Nova (Richard Rider)|Nova]] shortly after he witnessed a female alien with the alias [[Suspensor]] turned into a [[Glossary:Z#zombie|zombie]] right before his eyes. She attacked, and Nova accidentally killed the woman in self defense only to have her allies [[Cynosure (zombie)|Cynosure]], [[Crater]] and [[Discharge]] blame him for her death. Unable to battle the three powerful aliens, Nova retreated and was surprised yet again with his discovery of a talking dog. However, Cosmo gained Nova’s trust and friendship, and the two set out to find the fiend responsible for all the recent deaths on Knowhere.",
        "bio": "Heading up the security forces in a place called [[Knowhere]], Cosmo met a distraught [[Nova (Richard Rider)|Nova]] shortly after he witnessed a female alien with the alias [[Suspensor]] turned into a [[Glossary:Z#zombie|zombie]] right before his eyes. She attacked, and Nova accidentally killed the woman in self defense only to have her allies [[Cynosure (zombie)|Cynosure]], [[Crater]] and [[Discharge]] blame him for her death. Unable to battle the three powerful aliens, Nova retreated and was surprised yet again with his discovery of a talking dog. However, Cosmo gained Nova’s trust and friendship, and the two set out to find the fiend responsible for all the recent deaths on Knowhere. \n\nCosmo brought Nova up to speed on when the events started, and [[Worldmind]] added any data he had at his disposal. Cosmo was mainly concerned with the safety of the remaining citizens of Knowhere who were safely hidden away in a [[Dimensional Envelope]] he wore on his collar. It wasn’t long before Cosmo and Nova were ambushed by more zombies including the surviving members of Suspensor's former team, the [[Luminals]], and determined that the creature known as [[Abyss (alien)|Abyss]] was behind the mayhem. Together, Nova and Cosmo fought off the attacks, sealed Abyss inside his prison, and brought serenity back to Knowhere. As a final parting gift to Nova, Cosmo charted a course to the birthplace of the [[Phalanx]], [[Kvch]], in hopes that Nova can find a way to cure himself of the “transmode virus” that is slowly killing him. Just when Cosmo thought that peace was restored, alarms were triggered when a murderous [[Gamora]] and [[Drax]] – now under the control of the Phalanx – slaughtered many innocents on Knowhere in their pursuit of Nova. Cosmo arrived too late to stop them before they could follow the same path as Nova through the Continuum Cortex. \n\nRecently, Cosmo has become the liaison to the new [[Guardians of the Galaxy]] and assists them in plotting courses for the trouble-spots in the universe. Cosmos's loyalty to the group came into question after a group of terrorist [[Skrulls]] were found aboard Knowhere and destroyed the Continuum Cortex. Cosmo was protecting a group of Skrulls who were trying to escape persecution from the Skrull fanatics that were [[Secret Invasion|waging war on Earth]], and [[Warlock, Adam|Adam Warlock]] accused him of being a traitor. Cosmo forced Warlock to see the truth as he did with Drax and [[Quasar (Phyla-Vell)|Quasar]]. Unfortunately, things became more complicated when [[Cynosure (female)|Cynosure]] led the Luminals in attacking the Skrulls, and Cosmo was again forced to defend them. Cynosure almost blindsided Cosmo with an energy blast from her baton, but a Skrull threw himself in front of the blast to save Cosmo. In his rage, Cosmo unleashed a massive telekinetic blast that disabled both the Luminals and the Guardians of the Galaxy. Once both teams came to, Cosmo apologized for any confusion he caused.\n\nThe peace on Knowhere was short-lived as war broke out between the [[Kree]] and [[Shi'ar]], and the Guardians found themselves in the middle of it in order to protect the very fabric of the universe. Unfortunately, failed negotiations with both sides and a temporary alliance with the [[Starjammers]], brought the Shi'ar [[Imperial Guard]] and the [[Inhumans|Inhuman]] royal family to Knowhere, leaving Cosmo and the others to defend his home. In the midst of the attack, a being calling herself [[Starhawk]] abducted [[Star-Lord (Peter Quill)|Star-Lord]], [[Jack Flag]], [[Mantis]], [[Bug]] and Cosmo to her future. In that future, the Guardians saw the destruction of the universe caused by the [[War of Kings]]. The only individuals left alive was a conglomeration of heroes calling themselves the Guardians of the Galaxy, and the foul warrior race known as the [[Badoon]]. Upon discovering it was none other than [[Black Bolt]] himself who was the cause of all this destruction, the Guardians attempted to send a message back to their present using another Celestial to talk to Knowhere. The Badoon had somehow enslaved the remaining Celestials and used them as a cage around the sun in order to prevent the last vestige of the universe from dying. Infiltrating the Celestial Engine - as it was called, Cosmo spoke to one of the Celestials who, in turn, relayed the message to Knowhere. The message came too late, for Black Bolt had detonated his weapon of mass destruction and created [[The Fault]] that would one day destroy all life.\n\nCosmo and the Guardians had their own troubles to tend to as they shifted through different times and stages in their lives while fighting insurmountable odds against a seemingly infinite army. It wasn't until [[Kang]] decided to lend a hand that these valiant heroes were plucked from their predicament and placed back into their own time. Unfortunately, the stress put on Warlock from halting The Fault's expansion caused him to transform into the [[Magus (Adam Warlock)|Magus]], yet another threat to all life in the universe. Star-Lord had the chance to eliminate the Magus' taint, but in his hesitation to kill the madman, the lives of [[Mantis]], Martyr, Gamora, [[Astro, Vance (Major Victory)|Major Victory]] and Cosmo were apparently forfeit. In actuality, Magus altered reality to make Star-Lord believe the deaths of all involved were true. Cosmo, and the others, were held prisoner by the [[Universal Church of Truth]] until Martyr liberated them of their chains. The small group had to fight their way through incredible odds, and that was even before Martyr unwittingly released [[Thanos]] from a cocoon the UTC had in their possession. A distress call went out, and reinforcements arrived just in time to save Cosmo from certain death at the hands of the Mad Titan.",
        "categories": [
            "Cosmic",
            "Heroes"
        ]
    }
}