{
    "id": 1012200,
    "name": "Spider-Man (House of M)",
    "description": "In the House of M universe, surrounded by his family, including his young son Richard and close friends, Peter Parker is the envy of the world and its most popular mutant; but lately, Peter has felt like something is wrong in his world.",
    "modified": "2014-03-05T13:49:00-0500",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/3/60/5317718f0a2e7",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1012200",
    "comics": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1012200/comics",
        "items": [],
        "returned": 0
    },
    "series": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1012200/series",
        "items": [],
        "returned": 0
    },
    "stories": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1012200/stories",
        "items": [],
        "returned": 0
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1012200/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1012200/spider-man_house_of_m?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Spider-Man_(House_of_M)?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[House of M]]",
        "real_name": "Peter Benjamin Parker",
        "identity": "World famous celebrity; the general public believes Peter Parker is a mutant",
        "occupation": "Actor, professional wrestler, owner of Spider-Man, Inc.",
        "place_of_birth": "New York City, New York",
        "groups": "Spider-Man, Inc.",
        "citizenship": "U.S.A.",
        "education": "Ph.D in biochemistry",
        "aliases": "None",
        "relatives": "Richard  (father, deceased), Mary  (mother, deceased), Benjamin  (uncle), May  (aunt), Gwen  (wife), Richard  (son), George Stacy (father-in-law)",
        "height": "5'10\"",
        "weight": "165 lbs.",
        "eyes": "Hazel",
        "hair": "Brown",
        "powers": "Spider-Man possesses superhuman strength, reflexes, and equilibrium; the ability to cause parts of his body to stick with great tenacity to most surfaces; and a subconscious premonitional \"danger\" sense.",
        "debut": "House of M #1",
        "main_image": "Spider HoM.jpg",
        "bio_text": "Peter Parker was orphaned at the age of six and left in the care of his elderly uncle and aunt, Ben and May Parker. Peter was academically gifted, displaying an uncanny affinity for science that was nothing short of genius. As a student at Midtown High School, Peter attended a public evening exhibition where a spider, accidentally irradiated by a particle beam, fell onto Peter's hand and bit him. Peter left the exhibition in a daze and walked into the path of an oncoming car. Without thinking, Peter jumped onto the side of a wall to which he stuck with his bare hands. Stunned, he realized he had acquired superhuman powers similar to those of a spider: enhanced strength and agility, and the ability to cling to almost any surface.",
        "bio": "Peter Parker was orphaned at the age of six and left in the care of his elderly uncle and aunt, Ben and May Parker. Peter was academically gifted, displaying an uncanny affinity for science that was nothing short of genius. As a student at Midtown High School, Peter attended a public evening exhibition where a spider, accidentally irradiated by a particle beam, fell onto Peter's hand and bit him. Peter left the exhibition in a daze and walked into the path of an oncoming car. Without thinking, Peter jumped onto the side of a wall to which he stuck with his bare hands. Stunned, he realized he had acquired superhuman powers similar to those of a spider: enhanced strength and agility, and the ability to cling to almost any surface. \n\nTo test his new powers, Peter donned a mask and took part in an all-comers wrestling match against Crusher Hogan, winning with ease. Spotted by a talent scout who promised to arrange a TV appearance, Peter hurried home and created a more elaborate costume. Thus Spider-Man was born. With his new powers and sudden fame, Peter promised himself he would take care of Uncle Ben and Aunt May. Following his first appearance on television Peter ended up making the decision that would change his life. Peter tackled a burglar escaping past him, saving the owner of the wrestling arena thousands of dollars. The wrestling arena owner thanked Peter by promising Spider-Man a prominent role in his brand new wrestling league. \n\nThe wrestling league was a huge success and Spider-Man became its star. As the money rolled in, he decided to reveal to his aunt and uncle the powers he had acquired from the spider bite. Initially, his aunt was frightened by these powers, but Uncle Ben was ecstatic. He was happy for his nephew and could see these amazing powers gave Peter a self-confidence and a belief in himself he did not have before. \n\nAt this time the Mutant-Human War went into full swing. Peter, as the mysterious Spider-Man, was accused of being a mutant by the local press. Peter wanted to deny it, but Uncle Ben advised him to stay quiet. Ben could see that Peter was the idol of mutants everywhere. Finally, one of them was not afraid to be seen in public. Ben believed if Peter could give hope to those children who were born different than normal humans, then he should. Uncle Ben's wisdom paid off in the end when the Mutant-Human War ended with mutants victorious. The most public and popular of mutants, Peter revealed his true identity and became an international superstar as a wrestler and an actor. He even starred in a movie with his high school human friend Mary Jane Watson, a controversial move since normal humans rarely scored major lead actor roles. The movie ended up launching Mary Jane's career and established Peter as a \"can't miss\" star.\n\nShortly thereafter, Peter took a break from public life. He married his high school sweetheart, Gwen Stacy, and the two of them attended college together, earning doctorates. Peter returned to public life and he and his Uncle Ben set up Spider-Man, Inc., spreading out into many areas including science and charity work.\n\nToday, surrounded by his family, including his young son Richard, and close friends, Peter Parker is the envy of the world and its most popular mutant; but lately, Peter has felt like something is wrong in his world. And he has begun to worry about his secret. What would happen if the world discovered he was not truly a mutant?\n\nThey did find out, when J. Jonah Jameson discovered a journal of his. In the journal was not only the truth about his not being a mutant, but also the fact that he knew that this was not the way things were supposed to be, that he knew Gwen, Uncle Ben, and Gwen's father should be dead. It was discovered that the green goblin had lead J. Jameson to the book.\n\nThis changed everything for the human race. Peter's bodyguard, Rhino, attacked and nearly beat to death the real green goblin, a close friend of Peter. The world turned on Peter, even when he tried to help. A boy was nearly beaten to death just for wearing a Spider-man shirt. Eventually, it was discovered that it was Peter himself who gave JJ the book in the Green Goblin outfit.\n\nWhen Gwen and the rest of the family got hold of the book, they thought that he had just made it all up, and that he was insane. Finally, in the end, Peter and his family moved to the countryside, to live a peaceful life.",
        "categories": [
            "House of M"
        ]
    }
}