{
    "id": 1014873,
    "name": "Spider-Man (2099)",
    "description": "",
    "modified": "2013-08-15T14:16:16-0400",
    "thumbnail": {
        "path": "http://i.annihil.us/u/prod/marvel/i/mg/8/c0/520d1ad3e543f",
        "extension": "jpg"
    },
    "resourceURI": "http://gateway.marvel.com/v1/public/characters/1014873",
    "comics": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1014873/comics",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/comics/24042",
                "name": "Timestorm 2009/2099 (2009) #1"
            }
        ],
        "returned": 1
    },
    "series": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1014873/series",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/series/7220",
                "name": "Timestorm 2009/2099 (2009)"
            }
        ],
        "returned": 1
    },
    "stories": {
        "available": 1,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1014873/stories",
        "items": [
            {
                "resourceURI": "http://gateway.marvel.com/v1/public/stories/53309",
                "name": "Cover #53309",
                "type": "cover"
            }
        ],
        "returned": 1
    },
    "events": {
        "available": 0,
        "collectionURI": "http://gateway.marvel.com/v1/public/characters/1014873/events",
        "items": [],
        "returned": 0
    },
    "urls": [
        {
            "type": "detail",
            "url": "http://marvel.com/comics/characters/1014873/spider-man_2099?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        },
        {
            "type": "wiki",
            "url": "http://marvel.com/universe/Spider-Man%20(2099)?utm_campaign=apiRef&utm_source=35410e46c72ea769348ceb6ba8cc90fd"
        }
    ],
    "wiki": {
        "universe": "[[Marvel 2099 (Earth-928)]]",
        "real_name": "Miguel O'Hara",
        "identity": "Publicly known",
        "occupation": "Genetic engineer, CEO of Alchemax Corporation",
        "place_of_birth": "Nueva York, circa late 21st Century",
        "groups": "None",
        "citizenship": "future citizen of Nueva York",
        "education": "Genetics Degree",
        "aliases": "S-Man, Miggy",
        "relatives": "Xina Kwan (wife), Conchata O'Hara (mother), George O'Hara (stepfather), Tyler Stone (father), [[Venom (2099)|Kron Stone]] (Venom 2099, half-brother), [[Firelight (2099)|Gabriel O'Hara]] (Firelight, half-brother), Tiberius Stone (ancestor)| height = 5' 10\"",
        "weight": "170 lbs",
        "eyes": "Brown",
        "hair": "Brown",
        "powers": "Miguel's hybrid human/spider physiology gives him a wide array of powers. He has the proportionate strength and agility of a spider, which allows him to lift 10 times his own body weight, and jump distances of up to 30 feet. His speed and reflexes are also enhanced to superhuman levels. Spinnerets in his forearms enable him to fire organic spider-webbing from the top of his wrists.",
        "abilities": "O'Hara is a brilliant geneticist.",
        "debut": "Amazing Spider-Man #365",
        "origin": "Spider-Man 2099 #1-3 (1992)",
        "significant_issues": "",
        "main_image": "Spidey(2099) head.jpg",
        "bio_text": "Young Miguel O’Hara was raised in the alternate universe of Earth-928, during a future time after the end of the “Heroic Age”. He grew up with his eccentric mother, Conchata, younger brother Gabriel, and the abusive man he believed to be his father, George. Brilliant and precocious, Miguel was awarded enrollment in the Alchemax School for Gifted Youngsters (formerly the X-Men’s Headquarters) in Westchester under the fair direction of headmistress Angela Daskalakis. Here he befriended Xina Kwan, who helped Miguel defend himself against the bullying of Kron Stone, son of Alchemax’s Vice President of Research and Development, [[Stone, Tyler (2099)|Tyler Stone]]. With Xina’s encouragement, Miguel mustered the bravery to have Kron expelled from the school.",
        "bio": "Young Miguel O’Hara was raised in the alternate universe of Earth-928, during a future time after the end of the “Heroic Age”. He grew up with his eccentric mother, Conchata, younger brother Gabriel, and the abusive man he believed to be his father, George. Brilliant and precocious, Miguel was awarded enrollment in the Alchemax School for Gifted Youngsters (formerly the X-Men’s Headquarters) in Westchester under the fair direction of headmistress Angela Daskalakis. Here he befriended Xina Kwan, who helped Miguel defend himself against the bullying of Kron Stone, son of Alchemax’s Vice President of Research and Development, [[Stone, Tyler (2099)|Tyler Stone]]. With Xina’s encouragement, Miguel mustered the bravery to have Kron expelled from the school. \n\nYears later, as young adults, Miguel and Xina dated until Miguel cheated on her with Gabriel’s girlfriend, Dana D’Angelo. In time, Miguel and Dana were engaged. Confident and smugly self-assured, Miguel became project head of the genetics program of [[Alchemax]], performing research inspired by the Spider-Man of the Heroic Age involving alterations of animal’s genetic structure. Told he was poisoned by Tyler Stone with an addictive drug called Rapture for quitting after Alchemax fatally used a criminal as a test subject to expedite research, Miguel tried to purge his body clean on a genetic level. Once the drug was bound to his system, he would need it for the rest of his life. Since only Alchemax legally sold the drug, Miguel would have been forced to continue employment at Alchemax or buy the drug through the black market. His experiment to genetically rest his body was sabotaged by his jealous supervisor, Aaron Delgato, accidentally endowing Miguel with fantastic spider-like abilities. After an explosion in the lab, Delgato apparently fell to his death while Miguel fled, realizing his new powers as he avoided the Alchemax sponsored Public Eye security patrol. A Thor worshipper aided Miguel’s escape, deeming “Spider-Man’s” return as an omen of his god’s return. Tyler Stone hired the cyborg bounty-hunter named Venture to investigate the incident. With Venture in pursuit, Miguel returned to his Babylon Towers apartment, and concealed his identity in a full body costume acquired at a Mexican Day of the Dead festival. After a fierce assault, Spider-Man shredded Venture’s circuitry. Upon recounting the events to his quirky holo-agent (holographic assistant) Lyla, Miguel realized his uncertain future. \n\n[[image: spm2099-91.jpg|thumb|left|200px]]With Stone feigning ignorance of Miguel’s transformation, Miguel returned to work, hopeful to find a cure for his condition; but Miguel gradually discovered the importance of Spider-Man in his world, where his own employer was a major source of corruption and oppression. He helped rescue Karyn “Kasey” Nash, Gabriel’s girlfriend, after she was kidnapped by a Zaibatsu Samurai, the Specialist, for Alchemax to perform human experimentation. Spider-Man’s victory over the Specialist earned him the enmity of another major corporation, Stark-Fujikawa, and left him plummeting below the elevated city into Downtown, the realm of the forgotten and undesirables of Nueva York, independent of the major corporations’ control but ruled by gangs. Here, Spider-Man encountered the cruel Watchdogs and Fenris gangs, the hopeful Thorites, the justice seeking Throwbacks, and the largest gang, the Freakers, with their cannibalistic leader, the Vulture. Spider-Man rejected the Vulture’s offer to join his crusade against Alchemax, and after a vicious battle aided by Kasey, Gabriel and the Throwback, he retreated home. While he was away, Dana was approached by Tyler to partner with her firm, Synthia, and Alchemax. Miguel had discovered that Spider-Man had become a hero to his institutionalized mother (alone after George died at a young age) and inspiration for the Spiderite cult of costumed followers. \n\nAfter another battle with the Vulture, Miguel’s world was turned upside-down as he switched places with the Spider-Man (Peter Parker) of the Heroic Age of Earth-616, waking up next to Peter’s wife, Mary Jane, due to Fujikawa (in the Modern Age) and Stark-Fujikawa (in 2099) running experiments on a temporal energy generator. While Peter tackled the Vulture of 2099, Miguel faced Venom (Eddie Brock). The two Spider-Men were united to face the twisted time-traveling Hobgoblin of the year 2211 (Robin Borne) from the alternate universe of Earth-9500. Hobgoblin’s father, Spider-Man (Max Borne) deflected her Retcon bombs into the generations and the ensuing explosion sent everyone back to their respective universes. \n\nIn the weeks that followed, Miguel became more comfortable in his role as a costumed defender. He halted the attacks of the hyper-adaptable Mutagen (Gerald Bernardson), protected the city from disaster from a reawakened Cold War Russian super soldier, Chernobyl, wrestled himself free from electronically transmitted mind control by Macroware software developer Dr. Damian Fawcett, clashed with a specially trained agent heavily armed with SItuation Emergency GEar (SIEGE), and defended Dana from the monstrous Man-Spider (Antoine Tarantella). The mysterious amnesiac Net Prophet (formerly Justice, John Roger Tensen of Earth-148611) was liberated from Interspace after the Virtual Unreality experiments of Euromax transfer, the pretentious scientist Jordan Boone, lured the nigh-unstoppable Thanatos (a Destiny-Force powered megalomaniac Rick Jones of Earth-9309) to Alchemax, where he kidnapped Tyler Stone and Spider-Man, and after the two defended Dana’s sister, Father Jennifer D’Angleo, in Downtown against the Fenris gang, Tensen opted to explore the world. \n\nCaptain Marvel (Genis-Vell) and a critically injured Starfox of the Heroic Age of Earth-616 were sent to 2099. After encountering Spider-Man, Captain Marvel located Miguel to act as their guide. At Alchemax they battled Thanatos, sending the three into the Dystopian alternate future of Earth-9200 ruled by evil future Hulk, Maestro, the other heroes defeated Thanatos, returning everyone back to their original timeline. \n\nWhen Spider-Man battled the savage Bloodsword and the Fenris gang Downtown, back home Lyla began malfunctioning, while at Alchemax Stone made romantic advances towards Dana. Upon his return, Miguel with Dana visited Alchemax’s floating city, Valhalla, where it appeared that Thor and Heimdall had returned, though lacking the nobility of their Heroic Age counterparts. Alchemax CEO, Avatarr, had transformed ordinary people into the Aesir, loyal to the corporation, in order to eliminate the rising super heroic interferance. With help from Doom, Ravage, Punisher (Jake Gallows), the X-Men and Loki ( a transformed Jordan Boone), the Aesir were defeated. \n\nWhile Miguel tried to get back to a normal life, Lyla attacked Dana out of apparent jealously. She and the rest of the city were victims of the mad cyberspace entity named Discord, trying to \"ease humanity into Armageddon\". After saving Stark-Fujikawa’s head, Hikaru-Sama, Miguel joined Gabriel (as “Firelight”) in Cyberspace and defeated Discord. Afterwards, Gabriel admitted to his brother that he knew his secret identity from the start, recognizing the costume from the Mexican festival. Meanwhile, Kasey was kidnapped by SIEGE for Stark-Fujikawa and, as a repayment of Hikaru-Sama’s debt, transformed into Payback, a cyborg warrior designed to be a worthy associate of Spider-Man. Fighting against Risque, Venture’s cyborg sister, Payback failed, leaving Spider-Man alone to defeat the villain. Gabriel was beaten by Alchemax’s Flyboys as they arrested Kasey. While Miguel eavesdropped, Conchatta confronted Tyler to release Kasey, Blackmailing him with evidence that he killed his ex-wife, Nancy. There, Miguel learned the truth that the Rapture he was given was only a short-lasting simulation-and that Tyler Stone was really his father. Miguel left profoundly disturbed. \n\nXina, Lyla’s creator, repaired the holo-agent, spitefully programming her to insult Dana. Offended, Dana accused the emotionally raw Miguel of dating Xina again; after an explosive fight, Miguel and Dana broke up. Later, Spider-Man battled the mercenary android Vlad the Impaler targeting a boy named Gedde Ohara (mistakenly believed by Miguel to be targeting his brother Gabriel O’ Hara), and after Woodstock 2099 fought against Major Jones, a dealer peddling a metamorphosis-enabling drug called Chameleon. For a vacation, Miguel and Xina visited Nightshade, an independent corporation run by their old headmistress, Angela, when Alchemax performed a literal hostile takeover via Mr. Pembert, the Corporate  Headhunter, and the six Corporate Raiders. Though the monstrous genetically manipulated ex-Flyboy, Sgt. Rico Estevez (Subject 394, a.k.a Travesty), and Spider-Man defended Nightshade, the Raiders succeeded, killing Angela in the process. Packrat and his scavenger gang of Foragers descended upon the ruins of Nightshade, kidnapping Spider-Man. The gang offered Spider-Man a means of freedom if he fixed an old robot named Junior. The android, apparently the inert body of a Super-Adaptoid, recognized something in Spider-Man, and awakened as an amalgam of O’ Hara’s Spider-Man with Spider-Man and Venom from the Heroic Age. Calling itself Flipside, it behaved like an emotionally unstable psychopath. Heroically, Spider-Man saved his captors life, leaving Flipside shredded and decapitated; however, after Spider-Man departed, Filpside reassembled itself and resumed its assault on Packrat’s gang. On Miguel’s walk home through the desert, he was assaulted and exhausted, having a horrific nightmare before Xina rescued him. \n\nMiguel and Xina attempted another vacation in Mexico City, where they ran into Gabriel and Kasey (who believed Gabe was secretly Spider-Man). There a man named Fernando Morgez performed an arcane ritual to revive his dead sister Anita, inadvertently summoning zombies from a local graveyard instead. Spider-Man, temporarily blinded by Morgez’ spell due to his sensitive eyes, teamed with the Sorceress Supreme, Strange, to end the undead invasion. Distraught over his failure  to make amends for his sister’s accidental death, Morgez committed suicide. The four returned back home seeking some normalcy; instead, they found the country had been overtaken by Doom, who sent federal officers to abduct Miguel from Xina’s car. Taken to the White House, Miguel impressed President Doom with his confidence. With all megacorps nationalized under Doom’s control and Avartarr dead, Tyler Stone became Doom’s corporate Minister, while Stone offered Miguel his seat as CEO of Alchemax. Later, as Spider-Man assisted protesting Spiderites brutalized by federal Watchdogs, Doom offered him a cabinet position as Minister of Supernormal Affairs. Disgusted with Tyler and his dubious relationship with Dana, Conchatta surprised Tyler at his apartment and shot him twice. \n\n[[image: spm2099-02.jpg|thumb|right|200px]]In Neuva York, the battle cries of Blood mace (formerly Bloodsword and Bloodaxe) against “leaderless” Alchemax were abbreviated by the return of the Venom symbiote, which engulfed him in an acid-excreting ebony shroud, leaving behind only a skeleton. Venom traveled to confront the hospitalized Tyler, burning Miguel and slashing Dana. Spider-Man and S.H.I.E.L.D. agents engaged in fierce combat to protect Stone from Venom, but the monster escaped. Miguel, accepting his promotion, decided to use his position to forge a new direction for Alchemax, and to protect his alter-ego by ordering S.H.I.E.L.D. reps to leave Spider-Man alone. Venom resurfaced and kidnapped both Dana and Xina; Venom released Xina, while Miguel severed Venom’s arm. After Venom escaped, grabbing Xina again, Miguel authorized S.H.I.E.L.D. to use lethal force. Miguel returned to find Venom had taken Dana again and fled, forcing Xina to drive her car. The battle culminated at the visually askew place called the Escher Club, where Miguel had first met Dana. Dana shoved Venom, allowing Xina to escape, but was killed by S.H.I.E.L.D. bullets passing through Venom. While Venom eluded the authorities, Dana died in Spider-Man’s arms. Miguel returned to Alchemax, demanding answers from his researchers on how to stop Venom. Studying a piece of the symbiote, Miguel realized the symbiote was averse to sound. Broadcasting high intensity sound through the public speaker system, Spider-Man tackled a weakened Venom, discovering that beneath the symbiote was his half-brother, Kron Stone. Miguel separated Kron from the symbiote and forced a confession out of him. After being left for dead by the Punisher, Kron had encountered and bonded with the mutated symbiote, which had been sitting dormant in the sewers for some time. Kron faked his own death, and upon hearing his father had survived an assassination attempt, he had sought to complete the murder. \n\nMeanwhile, Downtown, the Vulture and the mysterious Goblin attacked Kasey Nash, out to prove Spider-Man was allied with Alchemax and the corporate establishment. Summoned Downtown by Gabriel, Spider-Man battled the Goblin. Struggling against the Goblin’s hallucinogenic attack, Spider-Man barely escaped with his life. The Goblin rallied Downtown’s citizen’s against Spider-Man by projecting images of Spider-Man (taken out of context) implicating him as a corporate flunky. Spider-Man left, disgusted by the ingratitude, to find President Doom’s sovereignty at an end as evident by fragments of his Environmental Maintenance Platforms (EMPs) fallen from the sky. \n\nAfter Dana’s funeral, wheelchair bound Tyler Stone attempted to return as CEO of Alchemax. Miguel refused to yield, stating his intention to run a compassionate corporation to serve people, and ejected Stone from the building. Tyler’s attempt to shock Miguel with the knowledge of his paternity had no effect. Miguel discovered that his time as Spider-Man had brought out the best in him, and it was time to become a hero out of costume as well. At Alchemax, Miguel was joined by his brazen mother as the best candidate for his personal assistant, handling even the violent Grunt Union representative, Boru. \n\nUnion problems became a minor issue for Miguel when communications with the New Atlantis project, Alchemax’s undersea research and habitation endeavor, were severed. Miguel learned that Alchemax had been exploiting the undersea mutates, using them for slave labour. The mutates, under leadership of one called Marriner, broke free; and Roman, who modeled himself after the legendary Sub-Mariner, rebelled. Torn between corporate loyalties and ethical treatment of the mutates, Miguel opted to attempt peaceful negotiations; however, Roman took the initiative to launch an offensive, flooding Nueva York and dispatching a leviathan, Giganto. Spider-Man incapacitated and captured Sub-Mariner, and sent the sea-monster home. Via holovid, Tyler confronted Conchata about her assassination attempt, telling Miguel he’s his father, and admitting he knew all along Miguel was Spider-Man. These revelations, however, actually brought Miguel and his mother closer. \n\nTrying to reach Jennifer from the flooded Downtown, Spider-Man fought the Goblin. The Goblin revealed himself to be Gabriel, motivated by jealously for his brother. Chaos reigned in the city as the Atlanteans waged war while the Vulture set charges to demolish the Alchemax building As Tyler attempted to flee to a Martian colony, he was killed by the Atlantean, General Dagim. As Spider-Man and Fr. Jennifer made their escape, Conchatta was believed to have been killed and Alchemax was destroyed. Miguel later learned that Gabriel was innocent, since a shape-shifter took over Gabriel’s life for a time and played the role of the Goblin. Pronouncement of Conchatta’s death was premature, and she later worked to identify the shapeshifter. \n\nAfter the polar ice caps melted, a massive deluge killed most of the world’s inhabitants. The remnants faced a new threat from space from the techno-organic Phalanx. Spider-Man worked together with Doom, whose foresight ended the invasion at the cost of his life. As society rebuilt itself, Miguel reopened Alchemax and married Xina, Together they reawakened Steve Rogers,  offering him Thor’ hammer, Mjolnir. Jettisoned into space, Rogers passed Mjolnir back to Miguel, deemed worthy to lift the hammer. Though not physically transformed, Miguel became heir to awesome power. Secretly aided by the Cyberspace persona Zero Cochrane 2.0, Miguel ruled for the next thousand years, ushering in an unprecedented age of enlightenment. Peace, morality and progress that spread from Earth to the surrounding worlds. In 3099, Rogers was once again revived and received the hammer, leaving Miguel to retire. Miguel O’ Hara’s journey from a cowardly, arrogant youth to super-hero to galactic leader and icon was at an end.\n\nNote: Proteus (Kevin MacTaggert) of the “House of M” reality arrived in 2099 via Jordan Boone’s Virtual Unreality portal, diverging a new reality, Earth-6375, one in which Miguel’s dual identity was made public early on. This version of [[Spider-Man (Miguel O'Hara Earth-6375)|Miguel O'Hara]] joined the [[Exiles]] to help fix damaged alternate realities.",
        "categories": [
            "Marvel_2099",
            "Spider-Man"
        ]
    }
}